{
  "episode_recaps": [
    {
      "episode_title": "Smoked",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/smoked-1381336/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "The victim, Annette Fox, is gunned down in the street while her daughter Jenna watches. The detectives find out that Annette had been raped and was about to testify in the trial, so they track down the rapist assuming that he had killed her or had her killed.Luke Ronson, the man accused of raping Annette, claims that the sex was consensual. Luke appears to be a model citizen, volunteering to cut hair at the homeless shelter. He doesn't seem to know that Annette has died, and claims he was with his publicist at the time of the crime. The detectives search Luke's house and find a gun and a black hoodie, and get ready to arrest Luke. Luke says that he doesn't have a permit for the gun in NY, just in Arizona. However, owning an unloaded gun without a permit is just a misdemeanor in NY and not enough to keep Luke in holding. The gun doesn't match the murder weapon, either, so Luke is set free. Jenna spots him leaving the police station and becomes very upset.Fin and Stabler follow Luke as he heads for the homeless shelter run by Sister Peg. They watch as Luke argues with one of the homeless men there, Eddie. Eddie was the person who said he saw that Luke had a gun. When Eddie sees the detectives, he bolts and is arrested.Luke claims that he hired Eddie to scare Annette and make her life uncomfortable, but he never said to kill her. But Eddie says that he and Luke never agreed to that. Benson believes that Luke is telling the truth, and that Eddie was the shooter. However, they still don't have the murder weapon, and without it, they don't really have a case.ADA West tells the detectives that they can arrest Luke for witness tampering and get Eddie on assault charges for attacking a police officer. Eddie gets his phone call and screams at the person on the other end of the line before Stabler takes Eddie back to holding. Later Stabler is ordered to move Eddie to central booking, but when he goes to the cell, Eddie is missing, taken by the ATF because he's the key to busting a cigarette smuggling ring. Stabler cuffs Eddie and takes him away anyway, and ADA West calls DA Jack McCoy to help smooth things over.Stabler works with Eddie undercover with the cigarette investigation, but the exchange gets botched and Eddie escapes in the confusion of gunfire. ATF is pleased with the bust, but SVU has just lost its killer.The detectives track Eddie down to Luke's apartment, where Luke is being held at gunpoint by Eddie, who is demanding money. Stabler manages to convince Eddie to put the gun down and then arrests both Luke and Eddie. Eddie admits to killing Annette all on his own. He tries to bargain with SVU, saying that Luke told him a detailed story about the rape. If the murder charges against him are lessened, he'll give up the source of the gun he used to kill Annette.The ATF agent is confronted by Benson and Stabler, and accused of giving the gun to Eddie. He is arrested as an accessory to murder. At SVU, Eddie and Luke are in holding, along with the ATF agent. Sister Peg visits the station to drop off evidence, a picture of Jenna and Annette with an address written in Eddie's handwriting. Jenna arrives at the station, and Benson tells her that they have her mother's killer. They also have Luke in custody and they will go ahead with the rape trial. Jenna is brought to the \"cage\", and she asks about the third man in the cell. Benson tells her that it's the person who gave Eddie the gun. Jenna then shoots at the three men in the cell, and then starts shooting her gun haphazardly. One of the bullets hits Sister Peg. Eddie taunts Jenna and says he should have killed her along with her mother. Jenna is about to shoot Eddie again but Stabler fires at her. As Jenna lies on the floor bleeding, she tells Stabler that she just got the gun off the street. Jenna and Sister Peg die from their wounds."
    },
    {
      "episode_title": "Delinquent",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/delinquent-1378348/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Bang",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/bang-1378347/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "A baby is found abandoned outside of a children's gym, and Benson and Stabler are charged with figuring out the baby's identity. The baby (Jasper) is the adopted son of a well-to-do woman, Dede Aston. The baby's nanny, Imelda, is in tears when the detectives speak with her, worrying over the empty crib. A neighbor, Wade, claims that he heard screams coming from the apartment the night the baby went missing. A used condom is found in the trash and the nanny confesses that while Dede was away on a business trip, Imelda invited her boyfriend, prominent attorney Ken Turner, over.Dede arrives at the precinct to get her baby back, and Ken shows up as well. It turns out that Dede and Ken are engaged, and it was Ken's idea for Dede to adopt the baby. He knew a pregnant woman who was a drug addict, and arranged for Dede to take custody of the child because she'd be able to offer him a better life.Imelda claims that Ken doesn't love Dede and he promised her that he'd leave Dede as soon as he gets the chance. Imelda and Dede have an explosive argument, with Dede accusing Imelda of abandoning the baby. When asked where she went on her business trip, Dede confesses that she never left town that night. She was staying at a hotel. Dede then blows up at Ken for sleeping with Imelda and then tells Ken that she's pregnant. Ken is excited because now there will be a new sibling for baby Jasper, and even if the condom broke, having a baby is a blessed event. Benson notices that Ken's condoms break rather often and that he might be a reproductive abuser. He has an undeniable urge to father children and will stop at nothing to get what he wants. Benson points out that Ken pokes holes in his condoms, which is typical reproductive abuser behavior. However, Dede is too in love with Ken to listen to Benson's warning.Wade, the neighbor, admits to kidnapping Jasper and placing him outside the children's gym. He believed that the baby was in a terrible environment and hoped that one of the other families who frequent the gym would take him in instead. Dede is relieved to hear the truth behind the baby's kidnapping, but Benson tells her that Ken has fathered over twenty children, and in fact, he's also Jasper's father.The detectives bring in Dr. Audrey Shelton to help with the case. She is an expert in reproductive abusers and provides insight into what goes on in Ken's mind when he tries to seduce women into bearing his children. Benson goes to talk to Bridget, Jasper's mom. Bridget is a drug addict, but it's clear that she regrets giving her son up for adoption and says that Ken pretty much forced her to. Audrey realizes that they can bring Ken in for facilitating an illegal adoption, without the mother's consent.Ken is brought in, but he doesn't seem to understand that what he did is wrong. Audrey says that she's never seen a worse case of reproductive abuse as with Ken. However, Ken is released from custody on a technicality. Benson confronts him with all the women who carried his children, along with all the children. Ken is still unapologetic, claiming that he loves them. Later, Ken is found dead outside Dede's home.The detectives see that Wade (the neighbor) is getting ready to leave town. Wade says that he found Ken's body but he didn't kill him. A wasp injection knife, which could have been used in the murder, is found in Wade's home. Wade says that he's not the only person who has the same type of knife. In fact, Dede has the same type of knife.There was a meeting of Ken's partners and children and Audrey was the only one missing. It turns out that Audrey had murdered Ken, as punishment for his misdeeds."
    },
    {
      "episode_title": "Reparations",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/reparations-1378346/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Totem",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/totem-1378344/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "The detectives are called to investigate when a girl's body is found in a duffel bag outside of a church. The victim, Marnie Foster, was reported missing the previous day. Evidence suggests that Marnie was sexually assaulted, but since no DNA was found, the penetration was done by a smooth object. Dr. Huang is away in Washington, so the team enlists the services of Dr. Cap Jackson, who notes that the killer still had some empathy for the victim, as they made sure Marnie was comfortable. A doll was placed with her in the bag. The autopsy reveals that Marnie was given sleeping pills so she didn't suffer pain during the assault. The killer didn't wish to murder Marnie; they might have taken the girl's life because they didn't want to get caught.According to Marnie's mother, the doll is not Marnie's. In fact the doll hasn't been made since 1989. As Benson and Fin head back to Marnie's home, they spot the girl's mother (Susan) arguing with a man. The man, Chet Hadler, had an affair with Susan. Chet actually has a police record, getting arrested for forcing himself on his previous girlfriend's daughter, and for suggesting that they have a threesome together. Chet has an alibi. Susan was with him at a hotel the night Marnie was killed.Cap wonders whether the killer is a woman, but Benson and Stabler dismiss the suggestion. Female rapists are extremely rare and female rapists who kill their victims are even rarer. Benson and Cap have a conversation over coffee, with Benson giving her condolences for the death of Cap's daughter. Benson also asks whether Cap plans to reopen his clinic, but Cap explains that he lost credibility with his colleagues for cooperating with police and breaking doctor/patient confidentiality. Cap thinks that the tenderness that the killer gave to the victim suggests that the perp is a woman, and probably was abused as a child herself. Maybe the doll is a totem for the killer's lost innocence.The detectives start to focus on the other adults in Marnie's life, which leads to her piano teacher, June Frye. June and Marnie seemed particularly close, and June is devastated with news of her young student's death. June explains that both her parents died a long time ago.Evidence suggests that June may be connected somehow with the murder. Cap speaks with June, who finally agrees to allow him and the detectives to take a look around her brownstone. Cap discovers some doll's hair on a pile of sheet music, and Benson finds pillows which match the pillow found in the duffel bag with Marnie's body. Luggage which matches the style of the duffel bag is found in the garbage outside of June's house. None of this is hard proof, however.Cap interviews June, who says that her mother was the one who first taught her piano, saying that it was where she could find perfection in her life. When June asks for a lawyer, the detectives have to make Cap stop questioning June, otherwise everything else she says can't be admissible in court.Cap goes back to June, explaining that he can't talk to her anymore with a lawyer present because she asked for one. However, June doesn't want to stop talking, waiving her right to a lawyer. As the detectives explained, it's legal if she changes her mind afterwards. June continues to talk about her past, with her father being the one who gave her the doll. Her father sexually abused her when she was 7. June confesses to giving Marnie the milk and the sleeping pills, and then sexually abusing the girl and placing her body outside the church.The detectives focus on the rest of June's students, most of whom have only good things to say about their piano teacher. One student says that she saw June arguing with an older lady outside and was acting strangely. The student tried to speak with June, but she was ignored. The older woman is June's mother, Elaine. Cap explains that June lied about her mother being dead because she wishes for her to be dead. Her mother covered up the sexual abuse June suffered from her father and didn't do anything to help. Elaine appears to be the killer.Benson and Stabler talk to Elaine, and Elaine is surprised to hear that June claimed that she was dead. Elaine remarried after leaving June's father, but says that her second husband was as useless as her first. The detectives then say that Elaine killed Marnie, then enlisted June's help with the body.Suddenly a young woman enters, Elaine's daughter by her second husband, Katie. Katie is Elaine's alibi, saying that she dropped her mother off at a bridge tournament during the time of Marnie's disappearance. When Katie denies having done anything wrong, Elaine verbally abuses her, which causes Katie to run off and hide in a closet. Stabler and Cap go back to June, and they tell her that they know she didn't kill Marnie. Katie comes in, demanding to know why June betrayed them by telling everything to the police, but June didn't say a thing. June is sorry that she left Katie alone with her mother.Katie recounts the day Marnie was taken and killed. Katie wanted to go over to June's house, and so June cancelled her piano lessons for that day, but Marnie, who didn't get the message about the cancellation, was there waiting for June. Katie took Marnie, drugged her and molested her. June then came home and helped to get rid of the body. Benson explains to June that Katie will most likely go to a psychiatric facility, but that their mother will have to go to court to address the crimes she committed against her two daughters. June feels like she can't forgive herself for what happened to Marnie, but Cap thinks that he can help her."
    },
    {
      "episode_title": "Bombshell",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/bombshell-1377274/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "A man is the victim of a knife attack, with the knife still protruding from the man's groin. The victim is identified as Jerry Bullard, who works for an aviation company which does government contract work in Afghanistan. The detectives first suspect that Jerry was attacked because of his connections to the current conflict in the Middle East. Jane, his wife, says that he could have done nothing to raise anyone's ire. He's only worked on the actual nuts and bolts of spyplanes. It turns out that Jerry and Jane were frequent visitors to a swingers' club, so Benson and Stabler go undercover at the club as a couple. They meet Cassandra, a young woman whom Jerry was infatuated with. Cassandra has had trouble with her jealous ex-boyfriend, Doug. He's threatened Jerry in the past. Jerry wakes from his coma and immediately accuses Jane of stabbing him. He claims that she was jealous of how close he was getting to Cassandra. He was also taking their daughter's college fund and spending it all on Cassandra. It turns out that Cassandra and Doug work together to con men out of money. Meanwhile, the detectives uncover evidence from a case that Cassandra and Doug were involved in, where their DNA was sampled. The duo are actually brother and sister. The pair are arrested, but Cassandra isn't worried, as Jerry has already paid for Cassandra's lawyer, but not for Doug. Jerry is completely smitten with Cassandra, as evidenced by his final gift to her. He bailed Doug out, only to stab him in the chest so that he and Cassandra could be together without Doug's interference."
    },
    {
      "episode_title": "Bully",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/bully-1372458/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "When blood is found spattered on a white canvas in an artist's apartment, the detectives are called in to investigate. The apartment above the artist's gallery houses the body of Ellen Sazelin, the CEO of a wine seller named Luscious Grape. She bled to death from a cut on her neck caused by a glass shard. Indication of forced entry in her anus and a high blood alcohol level suggest that she was raped while drunk.Benson and Stabler interview Ellen's neighbors, who describe her as quiet. One neighbor accuses the artist (Andreas) of being the culprit, but he ends up having an alibi. Out of leads, the detectives head for Ellen's company in order to interview the people who worked for her.Luscious Grape seems a fantastic place to work, according to the employees. Annette Charbonneau is Ellen's business partner and the public face of the company and she considered herself a close friend of Ellen. Annette claims that Ellen kept to herself most of the time, but she was also close with Bruce Clarkson, who is the company's head of advertising.When interviewed, Bruce reveals that he's gay, so he had no romantic interest in Ellen. Still, Ellen joined Bruce and his circle of friends, and Bruce convinced her to go to AA with him when she came drunk to work. She'd been sober for 5 years, which is why Bruce was shocked to hear that there was alcohol found in Ellen's bloodstream.Fin checks on Ellen's phone records, discovering that she received many calls from a single number. The calls came from a number associated with My Leather Fantasy, a store which specializes in selling Italian leather goods. Stabler and Fin track down the owner, Juan Alvarez, but he flees before they can nab him. Juan ends up getting shot in the gut by a man named Dennis, who accuses Juan of killing his wife.Fin finds out that Dennis's wife had Alzheimer's and mistakenly ordered $5000 worth of goods from Juan's store. Juan refused to take the purchases back, and also began to call her day and night demanding that she pay. She became terrified of the phone and one day her heart gave out and she died. Still, Juan could not have killed Ellen because he was harrassing another customer.Warner suggests that Ellen's wounds may be accidental or self-inflicted. Ellen also suffered from the impulsive need to pull out her hair, trichotillomania, which suggests that she was under a lot of stress. The detectives go back to Luscious Grape to talk with the employees again. Bruce claims to not know why Ellen was stressed. Corrine, the receptionist, didn't interact much with Ellen. Justin, from sales, also claimed to not know Ellen very well. And wine expert David claims that he loves working for the company and doesn't know about anything bad that might have been happening with Ellen.Morales uncovers several files which depict Annette verbally and physically abusing her employees. She even grabs Ellen at one point and drags her into her office. The detectives realize that no one wants to say a bad word about Annette because they're afraid of her. Benson and Stabler show Annette the video, but she's unmoved, insisting that the footage was somehow doctored. When given proof that the footage is real, Annette then says that she was driven to do what she did because of Ellen. Unfortunately, since there are no charges being put on Annette at the moment, she is free to leave.As the detectives do more digging, it's clear that Annette has been giving her employees gifts and bonuses to keep quiet. Huang even suggests that they have a version Stockholm Syndrome, where they must create an emotional bond with their abuser so that they can survive. Benson suggests that her employees are just greedy. Stabler finds out from a contact in the SEC that Luscious Grape is about to be bought by a multi-national corporation. Fin discovers that one of Ellen's videos is being aired on the news. Apparently she'd sent them the footage as well.Annette ends up being yelled at wherever she goes, but when she turns to the detectives for help, they're hesitant. Annette should suffer a little of the bullying that Ellen and the rest of the employees survived through. The news reports that the buyout of Luscious Grape has been canceled. Annette calls a press conference, where she verbally abuses everyone and then shoots herself in the head, claiming that they drove her to do it.Word comes to the detectives that Bruce was the victim of a hit and run. At the hospital, he claims he didn't know who hit him, but surveillance footage shows that he was talking to someone in the car before it hit him, and that someone was Corrine, the receptionist.The detectives separate Bruce and Corrine before questioning them, with Corrine claiming that Bruce ruined their plan by killing Ellen. Bruce claims that Ellen was dead when he found her. The employees confess that they had a plan to accept Annette's bribes and keep quiet about her abuse until after the buyout, when they'd all get huge bonuses. They worried about Ellen because she'd already started to become unhinged from stress, and Ellen wanted to show the world what Annette was really like. This would screw up the buyout, so the rest of the employees put together a plan to stop Ellen.Warner finds out that Ellen didn't have any alcohol in her stomach, which was strange since her blood alcohol level was well above the legal limit. On the lip of the broken bottle are cells which are only found in the anus. Warner says that alcoholics use this method to bypass the stomach and allow the alcohol to get absorbed by the bloodstream quicker, which gets them drunk faster. The detectives go back to wine expert Justin, who says that he did go to Ellen's apartment to try and seduce her. He ended up shoving her, which caused her to trip and fall, and drove the shard of glass into her neck. He made her drunk to suggest that what happened to her was an accident. Annette wasn't directly responsible for Ellen's death, but she did make everyone else as much of a bully as she was."
    },
    {
      "episode_title": "Pursuit",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/pursuit-1372456/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "\"Neighborhood Predator\", a popular TV show, follows a married predator who tries to get into sexual contact with a young woman. SVU has decided that they must work with the show to solve the case. Alisha Harding, the writer, gets a gift from the stalker and it's her sister's scarf, covered in blood. The team also discovers some more bloody evidence in Harding's home, including the police files from her death. Her sister has been missing for years and the case never solved. The stalker is obviously using the evidence to get to Alisha.The first subject they go over ends up being a guy who was going to a young girl's apartment to try and help her and keep her from sending e-mails to older men. The show decides to edit the footage together to make him look like a predator and they think Alisha might be setting the guys up.They take the first suspect in for questioning and he had decided to send the chat conversation to the police before he found the girl's address and went to find her. Alisha gives the team her house keys and ends up admitting that she had sent Laskey to jail for the wrong reasons.The producer of the show, Donny Spencer, tells the team that Alisha asked him to change the footage and tells them that Alisha had received some scary emails and that she brought in a photo of a dead woman in the snow.  Alisha tells them that Vanessa, her sister, was last seen at the spot where the photo was taken.Benson makes the decision to focus on Alisha in order to find the stalker. They try to focus on finding the men that come to the production office where she works. A co-worker tells them that Alisha made a video about the guy that is stalking her and that he should get what he deserves. They try to stop it but she has already published it to the internet. They end up thinking that Sonja, one of their fellow detectives, may be working with Alisha to solve her sister's murder. They find Sonja at an AA meeting with her neck slit on the bathroom floor. Right as she is about to die, she tells them that she got him. They swab her body for signs of the murderer.The detectives find the dead body in the picture and end up finding a total of five bodies in the same area. They are all mid-teens to mid-twenties and have been there anywhere from 3 months to 2 years.  David Adams is the only guy that comes up with a match. They find Rachel Grey who has been the \"ghost\" using that name and tells them that David is her boyfriend. He always calls her and she doesn't have an address for him. The wait for him to call and he calls from a burn phone in Riverside. They find him right before is about to attack Alisha. He holds her hostage bt Benson tasers him before he can make any moves.Adam Grafton is their guy. When brought to Riker's Island, he admits that imagined Alisha every time he raped his victims. Alisha questions where he found the women he killed but he won't answer any questions unless he is filmed. He finally admits that he has killed one girl for every year he's been alive...a total of 44."
    },
    {
      "episode_title": "Spectacle",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/spectacle-1372455/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "The detectives are called in to investigate the internet streaming of a rape to a college campus. They find it suspicious that no one who watched the stream attempted to call the police. When they track down the room where the rape took place, they find it abandoned.The rapist has a tattoo on his arm, which allows SVU to ID him. He's a student named Carl Cooper, who was expelled from the university for sexual misconduct. Carl is arrested, and he explains that the tattoo is because he was a part of a fraternity. They decide to question the rest of the frat brothers.The victim is identified as Lizzie Harmon, who goes to Julliard and who has gone missing. Lizzie's mother has no idea where her daughter is. There is video surveillance footage of the outside of her apartment, and one of the students who visited her is IDed as Greg Engels. Greg was spotted at the same frat party Lizzie attended.Another live online stream is released, and on it, Lizzie is seen asking for help. The detectives are one step behind, however, because when they trace the broadcast, they find an abandoned brownstone. Huang notes that the brownstone is where Greg and his little brother Jason stayed with their foster parents. Not long afterward their parents' deaths, Jason was abducted and never found. Huang suggests that Greg may be acting out in order to gain some control over his life. Greg then texts Stabler saying that they should meet, in order to hand over Lizzie.Greg tells Stabler that he won't hand over Lizzie until Stabler helps find his brother Jason. If the detective doesn't help, then Lizzie will be killed. Stabler doesn't like giving in to blackmail, but he agrees to work on Jason's case. As Greg and Stabler speak, Cragen sends in a team of police, which causes Greg to panic. Greg tells Stabler that Lizzie is as good as dead now.Greg is arrested, but Stabler knows that he doesn't have the heart to kill Lizzie. There's something else at work here. Meanwhile, SVU is working on Jason's kidnapping case. They find witness testimony saying that they all saw a boy being pushed into the back seat of a car. However the witnesses all assumed that someone else would call 911, so none of the witnesses came forward. One witness saw neighbor Miriam Penner on her porch on the day Jason was taken, but she was never mentioned in the original investigation back in 2003. Greg says that he used to babysit Miriam's son, Daniel, but he died from leukemia. It may mean that Miriam was the kidnapper, who stole Jason to raise him as her own son after she lost Daniel. The detectives track Miriam down, even as she's trying to drive off with a sedated Jason in the back seat. Greg reveals that the rape livestream was just a set up in order to get the police's attention so that they'd find Jason. Before Greg is carted off to prison, he gets a chance to speak with his brother."
    },
    {
      "episode_title": "Flight",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/flight-1372454/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "The detectives are called to investigate when a French teen named Dominique claims to have been raped by a man who'd flown her from France to New York. The accused is well-connected billionaire Jordan Hayes, so the SVU realizes that he won't go down without a fight. Dominique refuses to leave France to testify but she does mention that there was another girl with her on the flight, Nicole.The detectives note that sometimes a third woman flies with Jordan on these trans-Atlantic trips, his girlfriend Dahlia. However she wasn't around for this last trip. Upon questioning, Dahlia admits that she and Jordan aren't together anymore, but she did tend to Dominique and Nicole during one of Jordan's whirlwind parties.Jordan's private doctor, Ari Nathan, was called upon to treat Dominique after the assault, but before the detectives can talk to him, Jordan and his lawyers show up at SVU, claiming that it was Dominique who forced herself onto him. She told Jordan that if he didn't have sex with her, she'd start claiming that he'd raped her. Munch and Fin track down Ari Nathan, ready to arrest the man for not reporting that his patient had been sexually assaulted. However Ari claims to have not treated the girl. Stabler and Benson then speak to Dahlia just after she attempted suicide. French police contact the SVU and say that they have Nicole in custody. Nicole's claims seem to corroborate Jordan's story, that it was Dominique's idea to sleep with Jordan because he was rich. The detectives suspect that Jordan paid Nicole off. Benson and Stabler visit Jordan's mansion, noting that he tends to videotape his massage sessions. The team wishes to get a warrant for those tapes but are blocked by the judge. Munch sets up a blog which is purportedly Dominique's, detailing what happened while she was with Jordan. Dahlia had brought in young girls, on the pretense of being a masseuse, but in reality she was just a pimp for Jordan. The blog goes viral and other girls step forward, sharing their own stories of being chosen by Dahlia and then getting raped by Jordan. All the girls were paid to keep quiet.This is enough for the detectives to get a warrant for Jordan's arrest. Cragen and Stabler study the videotape footage of Jordan's massages. Jordan is taunted by his cellmate while he's in custody, and is so enraged that he attacks the other man, sending him to the hospital.Dahlia is brought in, and she's wondering why Jordan's lawyer isn't working for her as well. Federal agents take over the case, thinking that they have grounds to charge Jordan with child pornography. Jordan meets Dahlia, and says that he's taking care of everything.The detectives realize that Jordan will be staying in a nice white-collar prison and will probably not serve any actual prison time. Meanwhile, Dahlia still has to go through with her case, and unlike Jordan, she won't get off scot-free."
    },
    {
      "episode_title": "Dirty",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/dirty-1368297/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "ADA Page Ferguson is found dead after plummeting off the roof of a parking garage. Her body displays signs of rape trauma, as well as a large number of cuts on her skin. Page's detective colleague, Saliyah \"Sunny\" Qadri wants to help Benson investigate. Sunny initially suspects Angel Rivera, gang leader for the Latin Kings, whom Page put in prison. However, Benson thinks the murder feels more personal than just simple vengeance.After performing the autopsy, Warner tells Benson that the cuts all over the victim's body look self-inflicted, and none of them seem defensive. Sunny doesn't believe that Page would have committed suicide. The detectives speak with the last person to see Page alive. Page's boss admits to Benson that Page and Sunny may be responsible for the disappearance of drug money being stored in evidence. Fin uncovers surveillance footage of Page, who seemed to be in a great hurry. Benson suspects evidence tampering and finds out that Sunny stole some of surveillance footage. She then arrests Sunny for obstruction of justice. Sunny confesses to stealing the tapes but only because she wanted to make sure that none of her coworkers at the Brooklyn DA's office were involved in the murder. The detectives more suspects in Lakeisha Watkins and her boyfriend Damian. Both were involved as informants to a case Page was working on. Benson believes that their stories don't add up. The detectives track the pair down, only to discover the both of them shot dead. A young boy tells Fin that he saw the murderer dump his gun in a garbage can. A new suspect emerges, this time one of Page's coworkers, who may have killed Page to get at the drug money. Riggs and Page were involved in a relationship but he claims to have never hurt her. Rivera's girlfriend, Gita, visited him moments before Damian and Kakeisha were murdered, which gives the detectives enough evidence to charge Rivera and Gita with conspiracy to commit murder. The detectives want to strike a deal with Rivera. If he cooperates, then they'll set Gita free. Rivera agrees, saying that it was Sunny who gave him Page's location. Sunny confesses to stealing the drug money, and she killed Page because Page was going to uncover what really happened to the money. Sunny is arrested and taken into custody."
    },
    {
      "episode_title": "Mask",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/mask-1368397/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "The detectives are called in to investigate the rape of a woman named Debbie as well as the physical attack on Debbie's domestic partner, Ann, which left her unconscious. Benson wishes to talk to Debbie to have a rape kit done, but it turns out Debbie is a surgeon and is operating on Ann. She doesn't have the time to consent to the kit.Ann's father, Captain Jackson, is visiting her in the hospital. Debbie provides details about the attack, and how the rapist had worn a mask and told her that he'd \"cure her of Falmouth.\" Jackson is surprised at that statement and the detectives think he knows more about the case than he is revealing.The same mask has been spotted being used by a serial rapist in Virginia, and Jackson admits he may know the attacker's identity because he is a psychiatrist who treats sex addicts, but he can't tell the detectives who it is because it would break doctor/patient confidentiality. Stabler says that sex addicts can't be cured, but Jackson disagrees and tells him that he was a sex addict himself and believes he is cured.Jackson says he and Ann grew estranged after an incident in Falmouth. He can't remember what actually happened, but he was drunk and had sex. After that, Ann refused to speak with him anymore. Stabler accuses Jackson of raping his daughter. Huang figures out the mask the rapist wears is the Hindu God of Love and Redemption. He seems to want to \"cure\" women who'd been raped by raping them again. The rapist strikes again, but his victim manages to stab him in the forearm with a knife. The knife is taken as evidence and DNA analysis. Stabler goes undercover at Jackson's sex rehabilitation clinic in order to track down the rapist, who is probably one of Jackson's patients. Stabler hopes to find the one patient with an injured arm. Jackson confesses to Benson about that night in Falmouth. He honestly believes that he had raped his daughter, but also says the masked rapist deserves to be saved and not caged. Stabler meets with other sex addicts and finds that one of them does have a bandaged arm.Stabler meets Courtney in the group, and she starts flirting shamelessly with him. When she catches him talking on his phone, she grabs it away from him and says she'll have sex with him in exchange for the phone. When Stabler refuses, she takes his phone anyway. The therapy session proceeds, but Jackson enters the room and is shocked to see Stabler seated in the circle.Stabler believes the rapist is a patient named Clay who has bandages on his arm. Meanwhile, Linda, one of Ann's old friends, goes to visit her in the hospital. Jackson confronts her and asks if she remembers what happened at Falmouth. Linda confesses that Jackson was drunk and had seduced her, but the sex was consensual. He did not rape his daughter that night. When Linda had revealed to Ann what happened with Jackson, she stopped speaking to her father.Stabler and Jackson are surprised when Clay's bandage reveals a freshly inked tattoo. If the rapist isn't among the patients, then he has to be among the staff. Brett, one of the other therapists, has an injury to his arm and would have access to all of the confidential information on their patients. Stabler calls his phone, which is still in Courtney's possession. She appears to be waiting for someone. Brett suddenly shows up, wearing the mask, and the phone call is disconnected.Stabler and Jackson rush to the bar and stop Brett before he can attack Courtney. Brett explains that by having sex with them, he's curing the women. Stabler arrests him.Ann is still in a coma, and Jackson tells the detectives that his clinic will be shut down because he broke confidentiality and a detective had been working undercover there. He sits by his daughter's hospital bed and waits for her to wake up."
    },
    {
      "episode_title": "Possessed",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/possessed-1368396/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "A young man breaks into an apartment where he finds his girlfriend, Larissa Welsh, in pigtails and tied to a chair, and wearing just her underwear with the name \"Brandy\" written on it. Her attacker, Eldon Balogh, enters the room naked and wearing a mask. Balogh attacks the boyfriend.Detectives Olivia Benson and Elliot Stabler talk to the doctors at the hospital where Larissa and her boyfriend are receiving treatment and find out the details of the crime. Apparently, Balogh had shaved Larissa's body from the neck down. The detectives then interview Larissa's boyfriend, who talks about Larissa's fear of romantic intimacy and dislike of the name \"Brandy.\"As part of her investigation, Detective Stabler meets with other young women who knew Balogh. All claim he had abused them and had filmed the scene.Later, Stabler searches Balogh's apartment and finds child pornography videos and photos on the premises. He also recognizes the secret trading symbols of pedophile rings, of which Balogh is apparently a member.When Larissa goes missing from the hospital, Benson and Stabler search for Eldon Balogh. The two are found in a room where Balogh is once again abusing Larissa. Stabler fights the attacker off Larissa. It isn't until after this incident that detectives review videos that feature Larissa as \"Brandy\" being raped when she was a child. Larissa admits she's the one in the video and that she has been plagued by fans of these rape tapes before and suspects Balogh is one of those fans.In police custody, Balogh admits he had been searching for Brandy for years and reveals that a man named Orville Underwood had led him to Larissa. Benson and Stabler visit Underwood's home, where they find him old and out of breath. They find a pillowcase in Underwood's home that matches the one in the child porn videos and photos found at Balogh's. Underwood's dried semen is found on one of the photos. Underwood, who was tried for statutory rape of Brandy, was not convicted and the detectives still don't have enough evidence to charge Underwood with a crime.Meanwhile, Balogh is murdered in jail after bragging about having sex with Brandy.Larissa claims she's certain that Underwood was her childhood rapist in a subsequent interview with Stabler. Benson and Stabler decide to investigate Daniel Brooks, who appears in one of the Brandy videos. Larissa positively identifies him in one of the videos. Larissa recalls Daniel, who she knew as a child, had buried jars in the backyard with notes to his parents in them. Larissa tells the detectives about burying a wristband from Daniel in her foster parents' backyard with a wish that Daniel would find her. The detectives dig up the wristband, and test it for DNA evidence. Using the DNA, they learn Daniel was reported missing in 1995 when he was 12 years old. Since then, he has been arrested for shoplifting and prostitution. He also lives in an abandoned factory in lower Manhattan. The detectives go to the factory and find Daniel filming child porn. They subsequently arrest him.At the police station, Daniel tells Stabler and Benson he is not a victim anymore. A psychologist explains that Daniel's abusive acts are a way for him to take control in the wake of his own childhood abuse. After detectives find books that involve sexual abuse of children hidden under Underwood's house, they charge him with conspiracy to commit rape. Underwood represents himself in the case. His defense centers on his first amendment rights and that it is not illegal to write about having sex with children. The prosecution argues that Larissa was hurt after Balogh followed Underwood's instructions for raping young girls, and notes that Balogh highlighted sentences from Underwood's books. However, without Balogh's testimony, this is not enough to convict Underwood and the judge dismisses the case.Larissa decides to get Daniel to testify, so she visits him in prison. The next day Underwood calls 9-1-1 and claims he is being attacked by a woman named Brandy. When police arrive on the scene, they hear a gun shot from inside. They find Larissa holding a gun and Underwood dead on his bed.It turns out Larissa couldn't control herself because Daniel had told her that Underwood is still raping young girls. When she got to Underwood's house, she caught him in the act of raping another young girl.Benson and Stabler charge Larissa with using deadly force to stop Underwood."
    },
    {
      "episode_title": "Pop",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/pop-1368296/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Rescue",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/rescue-1364944/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "Calvin is growing more and more attached to Benson, even going so far as to draw a picture for her and signing it \"Calvin Benson\". The detectives are assigned to investigate the death of a young woman named Caitlin, who received massive head trauma at a party. Caitlin was taken to the hospital and later died. Warner discovers that the victim had sex, but she can't tell whether it was consensual or not.Caitlin kept a list of all the men she'd slept with, and one of her partner's is the boyfriend of the woman who threw the party. Jill admits that she invited Caitlin to her party in order to get revenge, and she attacked Caitlin, shoving her against a mirror.Warner notices blue gel inside Caitlin, which turns out to be residue from a defibrillator machine. Warner thinks that the paramedics might have attacked Caitlin the ambulance. The detectives speak with the two drivers, eventually figuring out that one of the men would rob the patients and the other would rape them. Stabler believes that the two men would give each other up if questioned separately, and one of the paramedics, Mike, caves in, confessing that he would steal from patients before his partner, Tinta raped them. Mike is wired up and sent to speak with Tinta, hoping to get him to admit to the crime. Tinta suspects something is up and runs towards the ambulance. He injects something into his jugular and loses consciousness.Stabler tells Benson that there's evidence that Vivian may be linked to the robberies, but Benson initially doesn't want to track Vivian down, claiming that they might run into a dead end. Stabler accuses Benson of not wanting to follow up on Vivian because she's reluctant to give up Calvin. Stabler also says that he knows Benson didn't send the DNA sample to the lab, to find out the identity of Calvin's father.Cragen takes Benson off the case since Vivian's involvement and Benson's guardianship of Calvin could mean a conflict of interest. Benson tracks Vivian on her own, and she finds her, once again high. Vivian asks Benson to leave her alone. If Benson leaves, Vivian promises to give Calvin completely over to Benson. Instead, Benson arrests Vivian. Vivian confesses to killing Burlock, the rapist who attacked her mother and fathered her. Cragen chews out Benson and Stabler for disobeying him and finding Vivian. Suddenly, Vivian's friend Sarah comes into the station and claims that she killed Burlock.Vivian says she was trying to protect Sarah by claiming she killed Burlock. Sarah is arrested and charged with murder, while Vivian is expected to be sent to rehab via court order. Benson realizes that once Vivian makes bail for herself and Sarah, she'd just go back to the drugs.After Sarah and Vivian are released on bail, Vivian speaks with Benson, demanding that she be allowed to see Calvin. However, Benson thinks that seeing his mother may traumatize the boy. Gunshots are heard. Benson orders Vivian to stay put and then goes to investigate. Sarah has been shot dead, and Vivian blames Benson.Warner finds DNA evidence on Sarah's body which is a match to Calvin, meaning that the murderer was Calvin's father. The DNA belongs to Vivian's ex-boyfriend, David. He confesses to the crime, saying he killed Sarah for taking Vivian and his son away from him.Later at SVU, Stabler is with Benson and Calvin when Child Protective Services arrives to deliver papers to Benson, terminating her guardianship of Calvin. Vivian shows up and hugs Calvin. The CPS agent explains that Calvin will be put in the custody of his father's family as Vivian goes into rehab. Calvin clearly doesn't want to leave Benson's side, but Vivian grabs him and drags him away."
    },
    {
      "episode_title": "Gray",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/gray-1361680/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "Stabler is attending a Take Back the Night Rally at Kathleen's university, when a female student (Bethany) accuses a male student (Chuck) of raping her. Months ago, she'd gotten drunk and passed out, and when she came to, she awoke to find Chuck in the middle of the act. Chuck claims that Bethany simply wanted more than a single hook-up, but when Chuck refused to see her again, she began claiming he raped her. Only Benson believes that Bethany is telling the truth.ADA Paxton returns to SVU to help rebuild her career after her suspension for being publicly intoxicated in court. When she finds out that there doesn't seem to be a case against Chuck, she orders the detectives to either find more evidence against him, or else they have to let him go.The university has a buddy system for drinking, to assure that drunk students don't get themselves in trouble. On the night of the incident, Kathleen was Bethany's sober buddy, but she left Bethany's side for a couple of minutes, which was enough time for Chuck to leave with Bethany.Stabler receives the university disciplinary file from Kathleen, though he's wondering whether the information would be admissible. Kathleen assures her father that as long as Kathleen gave the information willingly and Stabler did not ask for it, the file should be okay. Chuck's current girlfriend, Carla, explains that she was pregnant with his baby, but she miscarried after they had sex while using a special lubricant Chuck suggested. The lubricant contained ulcer medication which was shown to cause harm to the fetus in pregnant women. Chuck took the medication for erectile disfunction, but his lawyer claims that he didn't deliberately harm the baby.Paxton finds out about Stabler getting Chuck's file and is furious, but Stabler reminds Paxton of the loophole concerning the file. Paxton says that she has to subpoena Kathleen and get her on the witness stand. But her testimony, as she confesses to stealing Chuck's file, could get her expelled from college. Stabler pleads with Paxton not to allow Kathleen on the witness stand. Paxton agrees, and she'll tell the court that Kathleen was an informant.Chuck's lawyer manages to get the case's judge to step down, claiming inability to be impartial to Chuck's case based on an incident which happened in the judge's past. Judge Quinn refuses to go into detail about the incident, but the replacement judge is the one who ordered Paxton to rehab. When Paxton tries to request another judge, she's denied.Paxton worries that in light of the new judge, the case will be lost, but Judge Quinn promises that she'd help bring Chuck to justice. The judge goes to talk to Carla, to try to convince her to testify against Chuck. She tells Carla about when she was gang raped in college, but the culprits were never convicted. She tells Carla that this is her time to make sure Chuck gets thrown in jail.Carla doesn't show up in court, and the judge tells Paxton that if the woman isn't on the stand in 30 minutes, then the case would be dismissed. Benson finds Carla in her dorm room, unconscious. She dies, and when Warner does an autopsy, it's discovered that she died from toxic shock syndrome caused by the lubricant Chuck used to make her lose the baby. The detectives and Paxton trace Chuck down to a bar and arrest him for murder."
    },
    {
      "episode_title": "Penetration",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/penetration-1361679/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "Benson is still trying to adjust to life with Calvin, when her friend, FBI Agent Dana Lewis arrives at her apartment. Lewis has a rape kit that she wants Benson to run, and it turns out that the supposed rape happened to Lewis. Lewis wants Benson to keep the rape secret, since she doesn't want her cover blown in an anti-government militia she's investigating.Benson tells Stabler about the case and they both meet with Lewis, and they convince her to bring them to the crime scene: Lewis's home. She explains that she was injected with something that caused paralysis, so she wasn't able to move or fight back during the incident. As the detectives keep an eye on Lewis, she ends up getting grabbed and taken into the back of a van. The detectives follow and eventually find the van set on fire, and the driver dead. Worse, Lewis is missing.The detectives get in touch with Lewis's boss, who informs them that Lewis quit the FBI a year ago and hadn't been checking in with him. Meanwhile, the detectives try to track down the identities of the kidnappers. They find Lewis, who tells Benson and Stabler that she's still with the bureau. Her boss only said she quit to keep her cover.SVU discovers that there is another rape case similar to Lewis's, someone had injected the victim with a paralyzing drug, but this time, the victim was murdered. Lewis takes a look at the known details of the other case, and how her attacker told her that it was lucky she didn't piss him off. The other victim, Jennifer, was a participant in a prison pen pal program, and one of the people she corresponded with is a man named Seth Coleman, a sex offender who was recently released. Lewis IDs Coleman as the rapist.Benson and Stabler go to question Coleman but Coleman bolts when Lewis arrives. She tracks Coleman down and there is a standoff, with Lewis training her gun on Coleman while Coleman has a nail gun on her. When the detectives arrive, Lewis panics and fires her weapon. The bullet ricochets and hits Stabler in the shoulder.Later at the hospital, Lewis goes to apologize to Stabler. Stabler tells her that Coleman admits to raping and killing Jennifer, but he won't own up to raping her. Benson urges Lewis to confront her attacker, which she does reluctantly. He continues to deny raping her. In court, Lewis's character is called into question by Coleman's lawyer, and he suggests that Lewis wasn't even assaulted in the first place. Lewis goes on the stand to recount the incident.Details of the rape lead Benson to a possible culprit. The rapist called Lewis \"Star\", which was Lewis's code name when she was working on an investigation which nabbed Brian Ackerman. During the case, Lewis killed Ackerman's son, and Ackerman and Coleman were cellmates for a while in prison. Coleman was sent by Ackerman to get Lewis. Lewis confronts Ackerman in prison, and while he gloats about what happened to her, Lewis hopes he enjoys his solitary confinement."
    },
    {
      "episode_title": "Trophy",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/trophy-1361481/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "A woman is found murdered at an industrial plant. Further examination of the body reveals she also had been sexually assaulted. The woman is an environmentalist who was at the plant to protest. The owner of the plant has an alibi during the time of the murder, but security footage leads the detectives to a man named Jason Gambel. As Benson and Stabler confront Gambel, he locks himself in his apartment and shoots at the detectives through his locked door. The detectives take Gambel in for attempted murder of a police officer.A search in Gambel's apartment reveals a box filled with personal objects leading the detectives to believe Gambel might be a serial killer who keeps trophies of his victims. Gambel panics. He has been in prison before and doesn't want to go back. He also claims he didn't commit the crime. The detectives discover a padlocked room in Gambel's apartment that appears to be a torture chamber. Meanwhile, Gambel still claims he didn't know about the room.The detectives track down the owners of the trophies in the box. A ring belongs to a woman named Joan Arliss, but she was raped in 1970 before Gambel was even born. Joan had given birth to her daughter nine months after she was raped. Benson speaks to the daughter (Vivian) rather than Joan because Joan has Alzheimer's Disease and is already near death.Vivian seems to have made a mess of her life, and relies on pills and alcohol. Benson sympathizes with her, and she reveals that her mother was raped as well. Benson also tells Vivian that her mother turned to alcohol to relieve her pain, but she ended up drinking herself to death. Benson later talks to Wong and wonders whether Vivian might be her half-sister. Their mothers were raped around the same time and they were in the same area. There is a handkerchief in the trophy box that Benson thinks might be from her mother. Wong thinks that Benson is projecting her own problems onto Vivian, but Benson is adamant to get Vivian's DNA tested and grabs Vivian's beer can to be sent to the lab.While in prison, Gambel's cellmate Walter Burlock, had systematically traumatized him, which explains why Gambel is so reluctant to return. Burlock was apparently living in the locked room in Gambel's apartment. Gambel confesses that Burlock raped the environmental protester. Gambel's lawyer says his client is a victim who fears Burlock.ADA Hardwicke discovers that technically the detectives had searched Gambel's apartment illegally, which means any evidence found during that search cannot be submitted in court. Later, Vivian arrives at the station looking for Benson and wanting to know the true identity of her father. Joan has since passed away, and Benson wants Vivian to go to rehab and into therapy. Vivian also spots Burlock at the station, who says he's innocent and claims that it's Benson's fault for not apprehending the real culprit. It turns out that Vivian and Olivia are not half-sisters.Later, Burlock's dead body is found in Gambel's apartment, and Stabler suspects that Vivian was the murderer. Vivian's son arrives at the station with a letter from Vivian for Benson that gives Benson legal rights over her son."
    },
    {
      "episode_title": "Branded",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/branded-1358283/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Wet",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/wet-1358277/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "SUV is called in when a woman's body (Lindsay) is found drowned in a park fountain. Evidence of semen is found on the body, and some of her hair has been snipped off. Fin points out that there's been a rash of attacks on women in the park, all with their hair cut off, and the detectives find the suspect to bring him in. He admits to taking her hair but he didn't have sex with her, and his alibi checks out.The DNA evidence leads Benson and Stabler to the man who had sex with Lindsay. There is video which confirms that they had consensual sex, and that he did nothing criminally wrong. However, Lindsay's husband, Greg, informs Stabler that someone had emailed him the video of the tryst. Munch interrogates Greg, and the man says that his wife worked for a soda company called Colanow, as the head of Public Relations. Lindsay apparently was addicted to cocaine at some point in her life but she was trying to get her life back together. Greg doesn't know who sent the email, but he thinks it might be someone involved with Colanow.Huang discovers that Lindsay had ingested poisonous mushrooms from South America before she died. The mushrooms would have impaired her mental state and aroused her, making her very susceptible to wanting to have sex with a complete stranger. The night of her death, Lindsay had attended a charity function for the Wishing Time Foundation. The detectives head over to the charity office, where Benson discovers a picture of Lindsay eating mushrooms from a salad.There was a party crasher at the charity dinner, a college professor and activist named Vincent, who claims that Colanow privatized the water rights in Bolivia. At Vincent's home, there is a pot of mushrooms boiling in a pot of water on the stove. Benson checks the pot, but Vincent warns her to keep away from it. Later in the interrogation, Benson suddenly passes out while talking to Vincent.Benson wakes in the hospital with Huang at her side. Stabler is still questioning Vincent, who is making a huge speech about water, while still claiming that he didn't kill Lindsay. New ADA Mika Vaughn wants to keep Vincent in jail until he can go to trial, but the judge lets him go. Vincent goes to the media to talk about his pet cause. Vincent's mushrooms did in fact kill Lindsay, and so Vincent's lawyer wants to go into a plea deal.Vincent refuses, fires his lawyer and hires a younger, less experienced one to take his place. Vincent begins to confess to the crime, but Stabler interrupts, saying that Vincent could not have been the culprit. A recess is called which allows the detectives to track down the true murderer. Meanwhile, Mika gives Vincent's lawyer a vacation which takes him out of the courtroom, and she's fired when the DA discovered what she's done.The detectives speak to Vincent again, asking him why he confessed if he didn't do the crime. It was all for the free publicity which would give his cause more exposure. Who else had access to Vincent's mushrooms? All signs point to Lindsay's best friend, Emma.Both Vincent and Emma are arrested for Lindsay's murder, but Vincent refuses to say whether Emma was involved. Emma explains that Lindsay was considered perfect in the eyes of Emma's grandmother, who runs The Wishing Well Foundation, while Emma was always considered the screw-up. Stable thinks that Emma killed Lindsay because she was jealous of her.Emma confesses to the murder after seeing Vincent watch her interrogation. The pair are in love, but Emma couldn't bear to see Vincent take the blame for her actions. Vincent enters into the room, accusing Emma of killing out of jealousy and not because of the cause. Meanwhile, Emma eats the evidence bag of mushrooms and has to be taken to the hospital.Emma's grandmother visits her in the hospital, and says that Emma won't be given any inheritance because of what she'd done. Vincent then arrives in the hospital room, bringing flowers for Emma and saying he forgives her."
    },
    {
      "episode_title": "Merchandise",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/merchandise-1357573/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": "When a teenaged girl is struck and killed by a car at a farmers market, Benson and Stabler investigate the case. ME Warner believes it was homicide  the girl had been abused and starved, and had recently given birth. Cragen asks the detectives why they want to challenge M.E. Warner's ruling. They don't believe it was abuse that killed the girl; it was the car.The detectives review footage of the girl before she was killed and see another child running behind her, and both look as if they were running away from something. They learn the other girl, Carly Holbart, works on the farm. Fin argues with the manager of the market about the abuse of kids working on the farm. Fin finds Carly's address and goes to her house, and learns she had been evicted. Back at the precinct, they find out that parents Patrick and Madeline had been evicted from their apartment because of hospital charges from Madeline's failed fight with cancer. They also find out that Patrick and his other three children are now living in his car in the alley behind the church and others live there as well. The detectives tell Patrick what happened to Carly.Back at the precinct, Patrick Holbart tells the detectives he had sent Carly and Micah to work on the farm to make more money. He had not seen her in a year, and was shocked to hear about Carly's abuse and pregnancy. He thinks Micah could be in trouble too. Cragen tells the detectives that Mission Farms does not exist. Fin says what actually happened was Micah had pushed Carly into traffic and Micah had been arrested for prostitution and was being punished by being forced into the sex trade. Fin talks to Detective Cruz, and later the pimps are brought in. One of the men tells him that he knows who runs Micah. Fin orders that Micah to be delivered to him by the next day.Stabler and Benson get a phone call that Fin has Micah. As Stabler approaches, Micah attempts to run, but they catch him and Jasmine as well. Micah begs to be released and is terrified he will be punished. They bring Micah to the hospital and have him sedated. They bring in attorney Goldberg who says that he cannot help Micah because he is a suspect for killing his sister.Cragen asks Dr. Huang to talk to Micah. Micah reluctantly speaks with the psychiatrist. Micah tells the doctor they have been locked up on a farm and abused, and had been forced to have sex for money. Any babies are normally taken away, but Carly wanted to keep hers. Micah thought Carly was running away to be selfish and trying to escape while knowing the others would be beaten. He did not realize that Carly was trying to save him.The detectives meet with Assistant Attorney Chris Danielson, who says she can protect Micah's friends, but she is not sure about Micah. During interrogation, Reyes tells Chris she had sold the children to Liam and Julie Ryan, the ersatz farmers. Benson, Stabler and Chris look for the Ryans, and kick open the door to their house. They don't find the Ryans at home, but they find a room full of children. A brief car chase ensues and the Ryans are subsequently caught.Patrick is with Micah at the hospital as he recovers. He asks Micah for forgiveness for not protecting him. Stabler tells them Micah will not be charged, but he has to go through counseling. Stabler sets them up in a trailer and they are thankful for his help."
    },
    {
      "episode_title": "Behave",
      "nth_episode": 22,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/behave-1352379/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Bullseye",
      "nth_episode": 23,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/bullseye-1352377/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Locum",
      "nth_episode": 24,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/locum-1352344/recap",
      "nth_season": 12,
      "source": "http://www.tv.com",
      "corpus": ""
    }
  ]
}