{
  "episode_recaps": [
    {
      "episode_title": "Scourge",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/scourge-45608/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Pique",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/pique-45607/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Parasites",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/parasites-41839/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Manhunt",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/manhunt-35061/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": "After another evening work shift, diner waitress Annie Tassler and cook Butch McGee talk briefly on the sidewalk before parting ways to go home. Moments later McGee hears muffled screaming, and looks back to see a man forcing Tassler into a green 4x4. McGee runs up to them, but is forced to back off when the man points a gun in his face. When the man turns his attention back to Tassler, McGee grabs him and is joined by a bystander named Marty Potter. The man knocks both of them aside, jumps into the vehicle and speeds off with Tassler.Munch and Fin are called to the scene because the kidnapper dropped a chloroform-soaked cloth, the mark of the Bowery Stalker. The previous summer he kidnapped four women and drove away with them in a green 4x4. He raped, tortured and killed them in an abandoned warehouse in the city. The police raided the place and found the women's mutilated bodies after another victim, Sarah Kimmel, managed to escape from the warehouse after two days in captivity. They found partial fingerprints and some DNA, but couldn't match any of it to anyone in the system. The Stalker never returned there afterward, and SVU hadn't seen him again until now. He must have found a new safe house.When the gun was in his face, McGee saw a cat-shaped tattoo on the kidnapper's forearm. A parolee named Frank Taggart, who was convicted of assault, has that tattoo. He tells Munch and Fin where he had it done, and says he was at a bar when Tassler was kidnapped. Although Taggart left the bar in plenty of time to reach the scene, he doesn't own a 4x4. So Cragen has all the witnesses, including Sarah Kimmel, brought in for a line-up. Since her ordeal, Kimmel has been living on disability because she's too traumatized to leave home without falling apart. She keeps the lights on all the time, because in the darkness she'd see her tormentor's face again. At the line-up, McGee can't positively identify anyone. Potter identifies NYPD Officer Peters. Kimmel says her attacker isn't in the line-up. Taggart's not their man.Munch and Fin visit the tattoo shop that did Taggart's cat tattoo. The design was an original, brought in by another customer the previous summer. That customer said the cat was a platoon name in the service. He left the sketch behind, and the tattoo artist lets the detectives have it.The lab finds two sets of fingerprints on the paper, one belonging to the tattoo artist and the other to a \"John Doe.\" The technician checked Doe's prints against other databases and identified Doe as Darryl Kern, a U.S. Army veteran. Kern was dishonorably discharged the previous year, at about the time the Stalker's attacks began. Motor Vehicle records show that he owns a green 4x4, and provide a home address.The police raid Kern's apartment. He's not there, but they find a Fort Dix military banner with a bobcat mascot, and his New York toll road E-Z Pass statements. The statements show road trips beginning at the same time as the Stalker's attacks. Kern traveled the same route each time, from the city to the small town of Walden Falls in upstate New York. Seven women went missing within a day of each trip.Munch and Fin make the long drive to Walden Falls. Local police chief Walker has never heard of Kern, so if he's there he's keeping a low profile. Officer Cheryl Baxter is assigned to help the detectives with their investigation. They begin with a visit to the local gas station, a regular stop on Kern's previous trips. The station owner recognizes Kern, and says that he spent a lot of time at the local gun shop. The gun shop owner identifies Kern as Arnold Cokely. He tells Munch and Fin that \"Cokely\" has a cabin somewhere north of town, well-stocked with provisions, guns and ammo. In fact, the real Arnold Cokely and his wife Amanda went missing in the city five months ago. Since Cokely's identification was used in a fraudulent firearms transaction, the Bureau of Alcohol, Tobacco and Firearms (ATF) joins the case.Meanwhile, back in the city SVU goes through Kern's possessions and finds blueprints for a bomb shelter drawn by a contractor in Walden Falls. Munch asks Officer Baxter to have the contractor, McCartney, meet them at the police station. They arrive to find Chief Walker locking horns with ATF agent Gus Stone, arguing over who's in charge of going after Kern. Stone has a federal warrant for Kern's arrest. McCartney confirms he built a fortified underground bunker for Kern on some land about 10 miles north of town. The land already had a small cabin on it.The combined law enforcement forces raid Kern's cabin, and find it empty. Somebody must have tipped him off. Annie Tassler's mutilated body is in the bunker, and several other bodies are buried on the property. In the cabin is a pseudo-military operations manual of some sort, apparently forgotten by Kern in his haste to clear out. His last entry, dated the previous day, indicates he has an accomplice whom he's meeting back in the city.On the theory that Kern's accomplice is an Army buddy, Cragen arranges for Munch and Fin to visit Fort Dix. Colonel Marsden tells them that Kern had been a problem soldier who was under the delusion that the Army enjoyed killing. He spent so much time on kitchen duty, he was assigned there permanently. After he threatened someone with a kitchen knife, he was put in the brig. He was eventually diagnosed with antisocial personality disorder and pronounced unfit for duty, resulting in his discharge. Kern had had one friend at Fort Dix, a man who made regular deliveries to the fort's mess hall. That man no longer delivers there, but Sergeant Pierre remembers the name of the company.The company owner identifies Kern's friend as Marvin Posey, who's currently out on National Guard reserve duty. He gives the detectives Posey's home address, but adds that Posey isn't there because he's in the wilderness practicing survival skills. Munch, Fin and a SWAT team go to Posey's house, where his elderly Aunt Mary readily answers the door. She tells them he'd been called away from home that morning.Aunt Mary, who's as overly trusting as she is kindhearted, assumes that Munch and Fin are friends of Posey's and invites them inside. She tells them her nephew is with the Green Berets, and shows them his scrapbook. In the book is a photo of Posey with Darryl Kern. Marvin Posey is Marty Potter, the good Samaritan at the Tassler kidnapping. Posey hadn't been trying to stop Kern; he'd been trying to get into the vehicle. No wonder he identified the wrong person in the line-up. And he must have tipped off Kern about the police.As Munch and Fin leave Posey's home, they receive word that Kern abandoned his 4x4 that morning in a shopping center outside Walden Falls. He carjacked a woman and child, and is now heading north toward Canada in their car. Back at SVU, the detectives determine that Kern and Posey have been exchanging cell phone calls at regular intervals since Tassler's kidnapping. The cell service provider determines that Posey eventually met up with Kern in Fisher's Landing, just inside the U.S. border. Munch and Fin join the New York state police and ATF in Fisher's Landing, where the carjacked vehicle and Posey's car were found parked in the driveway of a farmhouse. They raid the farm to find Posey dead, and the farmer's truck gone. Then they receive good news: Kern was arrested for shoplifting from an auto parts store in Ontario, after the farmer's truck broke down. The woman and child are safe, and the Ontario Provincial Police are holding Kern until Munch and Fin get there.Alex Cabot greets the detectives at the OPP station where Kern is being held. She has an extradition warrant for Kern, which of course he's fighting. Because a confession from Kern would strengthen New York's argument at the extradition hearing, Munch talks to Kern alone and tries to get one. Kern just laughs, because Canada won't extradite him for a capital crime unless New York waives the death penalty. Cabot confirms that's true, as of a Canadian Supreme Court decision the previous year.At the extradition hearing Canadian attorney Picard argues against extraditing Kern, based on the Canadian Supreme Court's unanimous decision regarding people facing death penalty charges. Cabot replies that the State of New York has amended its petition for extradition. The original petition sought to extradite Kern for murder with special circumstances attached and kidnapping, the former carrying the death penalty in New York. The amended petition reflects only one, lesser offense: possession of stolen property, the farmer's truck which Kern drove into Canada. Possession of stolen property valued at more than $5,000 is an extraditable offense under Canadian law. Since the amended petition requests Kern's extradition on a non-death penalty charge, the Canadian judge grants it.After Kern is returned to New York, Munch visits Sarah Kimmel. When she answers the door, he says, \"I just wanted to tell you. You can turn your lights out tonight.\""
    },
    {
      "episode_title": "Folly",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/folly-35058/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Runaway",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/runaway-26581/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Countdown",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/countdown-26198/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Paranoia",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/paranoia-26197/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Victims",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/victims-26196/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Secrets",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/secrets-17471/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Abuse",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/abuse-17470/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Consent",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/consent-15014/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Pixies",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/pixies-15013/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Taken",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/taken-12355/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Asunder",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/asunder-12354/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": "While a neighbor, Cyrus Parker,  is trying to watch television, he hears Sgt. Lloyd Andrews and his wife, Patricia, yelling. He approaches his window in time to see Patricia throw a skillet at Sgt. Andrews as he is walking away. Sgt. Andrews returns to her and grabs her hair ushering her back into the building with her screaming.In the squad room, Munch tries to explain to Patricia that according to procedure they must go to the hospital for her exam before taking her statement in order to preserve as much evidence as possible. She believes her husband will get away with raping her. Munch attempts to allow her to speak with a female detective, but she tells him she would like to speak with anyone with a brain. He asks her not to try to go through all of the five stages of grief at once. She explains she does not need him to explain procedure and refuses a rape kit. He explains it does not matter if she has had or is still in a relationship with the man causing her to tell him it was her husband. He motions to Tutuola as he asks her for an address in order to find him. She tells them he is at Manhattan South. He is Sgt. Lloyd Andrews of Homicide.After everyone else has entered Cragen's office for a meeting, he asks Jefferies if she is going to join them. She declines stating she has reports to file and coffee to make. He approaches her stating that he wants her on his team as long as she wants to be. She tells him the files are not going to file themselves before walking off. He joins the group in his office.Tutuola begins stating Patricia claims her husband raped her, but a sprained wrist is the only sign of physical abuse. Benson points out she does not need to be abused to prove rape. Munch adds the man accused is in Homicide at Manhattan South. Tutuola explains he did not mention it because it is not important to him. Stabler adds Sgt. Andrews is a 20-year vet with citations and a high closure rate. Benson reminds him that even though the guy makes the Brass happy, he is still a rapist. Munch corrects her saying he is an alleged rapist. Benson asks if he has ever heard of the word no. Munch asks if she has heard of contractual abandonment saying the only reason to get married is so you do not have to hear the word no. Stabler explains he has been married 16 years and he hears it all the time. Benson reminds them the concept of a wife being property went out in 1984 when the law realized a wife has the right to say no. Cragen intervenes asking if they were able to get Patricia's statement with her signature. Tutuola answers saying it is being typed. Cragen wants Patricia to know the score before she signs it. Tutuola questions if he doubts what happened or her commitment. Cragen reminds him that since the suspect is a cop Internal Affairs will be involved. When Tutuola comments he does not think his badge should cushion the blow, Cragen asks if he has ever rubbed IAB the wrong way. When he denies having had the pleasure, Cragen tells him to do it his way. Cragen sends Benson and Stabler to canvass the neighbors for background on the couple. He tells Munch and Tutuola talk to Patricia before stating he will inform the \"powers that be.\" Stabler reminds Cragen that if the rape occurred and they did not follow procedure then they will get buried. Cragen informs him that will happen either way.Munch and Tutuola join a smoking Patricia in the interview room. Munch immediately tells her smoking is prohibited in government buildings. After blowing a puff of smoke in his face, she puts the cigarette out on the sole of her shoe. Tutuola gives her the typed statement telling her to read and sign it before asking where Sgt. Andrews is now. She explains he plays pick-up ball every afternoon before his shift with some friends. Munch tells her to repeat her story in her own words before she signs the statement explaining she is going to have to get used to telling her story. She ignores him asking Tutuola if he is married. When he denies it, she tells Munch she knows he is not married because no one would have him. He asks if she is always this pleasant causing her to ask if he thought she deserved to be raped. Tutuola steps in saying he does not believe anyone deserves it. She explains they have been married for five years. They fight, then make love. She can hardly believe it happened. Munch asks if they could have been making up. She explains she does call a choke hold foreplay. He reminds her she threw the pot to his head causing her to doubt if anything will be done to him. As she tries to leave, Munch explains that if her story holds up he is going to have to arrest him, cuff him, process him, and stick him in a cage. She returns to the table to sign her statement. When Benson and Stabler attempt to speak with Cyrus Parker about the Andrews, Parker reminds them that people barely look at each other and rarely introduce themselves. He calls them the Springers because their fights are better than the show. He explains they fight every day. Sometimes the police come, but they leave after Andrews talks to them briefly. He tells them what he saw earlier in the day denying seeing Andrews strike Patricia. Detectives Santiago and Howard of Internal Affairs visit with Cragen. When Howard tries to shake his hand, Cragen stares at it before asking if the case stays at SVU. Howard explains IAB is not equipped to handle sex crimes causing Cragen to tell them to \"Have a nice day,\" in an effort to have them leave. Howard informs Cragen they know IAB used him to bring down his mentor, but assures him those were the old days. They ask him to take the case slow and easy with finesse and kid gloves. They explain that Andrews is not on the take. They do not understand how a wife can be raped. Benson walks out of the store carrying two cups of coffee while Stabler is on the phone. When he hangs up, he explains uniforms were dispatched four times to the Andrews residence for domestic disputes. Clarkson and Powell always responded, but handled it at the scene with no arrests. They are on tour, but just signed out for a break. Benson and Stabler walk up to Clarkson and Powell at the end of an old joke which Benson finishes for them. As they join them in the booth, Stabler explains they want to discuss the Andrews DIRs. They explain they handled them at the scene each time, but on the last call they told Andrews if it happened again they would have no choice. Stabler tells them four calls in three too many because you take action the first time. They claim they did it because Andrews is a fellow cop who asked a favor. Benson reminds them looking the other way should not have been an option. She explains that since they did not do their job, they caught the case. They tell them Andrews and Patricia fight loud and hard calling each other names he would not call anyone. Patricia is the violent one throwing whatever is handy when she gets ticked off. Stabler explains to Cragen that Patricia is the violent one and Andrews seems to be handling it. When Stabler comments he is not a fly on their bedroom wall, Cragen wonders what Andrews's response will be when they ask if he raped his wife. Stabler wants to let the ADA decide. Cragen informs him that for the first time IAB wants to flush it so either they have another reason or the case is going to come back to bite them. Stabler wants to interview Andrews, but Cragen believe an SBA lawyer will shut him up. When Cragen asks if he has another idea, Stabler reminds him that unless it is official it will not hold up in court. Cragen tells him he just wants a read on the guy. Stabler joins Andrews, Cesar Vasques of Vice, and Danny Tatum of Homicide in a game of basketball. After he introduces himself, Tatum acknowledges SVU is a tough gig. Andrews hears they rotate the detectives out every two years in SVU. Stabler plays it off saying Homicide is tough as well, but Andrews tells him bodies do not care if you close cases unlike live victims. While playing, Tatum shoves Stabler causing him to wonder what his problem is. Tatum tells him there are no fouls on the blacktop and asks if he can take it. When they try again, Tatum hits Stabler with his elbow causing him to bleed from his nose. Stabler asks what he missed. Andrews tells him Tatum was trying to send him a message, but he denies he works that way. He promises to answer all of his questions after the game. In Cragen's office, Stabler tells the team Andrews may have just been telling him what he wanted to hear, but he believes he was being genuine. Benson asks him if it was before or after Tatum beat him because she believes Andrews knew they were looking at him. Munch believes Tatum just got over zealous in protecting his partner reminding him Andrews stepped in and saved the other eye and hopes Tutuola would do the same for him. Tutuola tells him they need some history first. Cragen recounts that they have an abusive women claiming she was raped. Tutuola believes she may lie because she wants a divorce and it will be easier to get what she wants if he is in jail. Benson tells them there have not been any papers filed. Munch tells them she may want them to take care of him first before filing. Cragen answers the phone and informs the team a unit was dispatched to the Andrews residence for assault with a deadly weapon after Parker called it in. When Benson and Stabler arrive at the scene, Patricia is being held back by an officer. She  tells Andrews, who is sitting in the back of an ambulance, she will cut his heart out if he touches her again. She threatens to wait until he is asleep and set him on fire. Andrews tells her she had better kill him or he will do her without leaving a mark. She grabs the officer's baton and throws it at him. When another officer tries to take her in, Benson tells him not to and takes control of Patricia ushering her to a patrol car. Stabler approaches Andrews and tells him they need him to come to the station to answer questions. Andrews tells him he thinks he needs a lawyer. Stabler agrees. In Cragen's office, Santiago tells Cragen he is getting calls from the Brass asking if he is working an undercover operation with SVU with the press knowing. When he ask what kind of Mickey Mouse Club he is running, Cragen tells him he prefers Dick Tracy because of the decoder ring and a watch. Howard asks ADA Cabot if she is going to say anything. Santiago clarifies asking if she is going to charge Andrews, if she is going to reign in her squad, and if she will keep them updated on the case. She informs him that charging Andrews prior to a formal statement is premature. She is not going to sweep this case under the rug like they want. She warns them to stop interfering in the unit's investigation or she will charge them as co-conspirators. Santiago tells her they are only there to supervise, but is told not any more. She tells them they may consider themselves officially updated causing Cragen to smile behind her. After Stabler and Benson escort him into the interview room, Andrews announces he will not talk to them without his lawyer. They tell him they are done and turn to walk out, but are called back by him saying he wants to get it over with so they can all get back to work. When Benson tells him they have his wife's side of the story so they need his, he questions what she told them. Stabler informs him she claims he raped her before telling him to explain what happened instead of denying it. Andrews tells them he works midnights. When he got home she started on him concerned he was having an affair. He admits to the affair, but claims she is accusing him of rape because she is angry. He explains she is always upset about something. He smothers her or he does not love her. He wants them to figure it out because she is driving him nuts. Stabler suggests divorce is better than rape causing Andrews to shout his denial.Patricia tells Munch and Tutuola that her husband came home as if nothing happened. She did not want to leave him because she does not have anywhere else to go. She claims the home belongs to her and her things are there. Munch reminds her she cut Andrews with a knife and threw the baton into the crowd. She claims she was scared when he walked in expecting him to be in jail. Tutuola asks if she has anyone she can stay with for a while. She wonders why they did not arrest him.Andrews explains he tried to walk away from her because tempers were getting out of hand. She nailed him with a pot in the back of the head. Stabler reminds him he did not keep walking, but went after her. Benson asks if that was when her raped Patricia. He told her nice try. He started packing her bags. He explains the lease is in his name and she is not going to run him out of the house screaming and threatening him with kitchen utensils. He claims she came after him with a knife and he disarmed her with a standard academy move. He informs them Patricia has not been right since learning she cannot have kids. Patricia claims she did not divorce him because she loves Andrews. She wants to try counseling, but he refuses to go. She believes the court will make him go to counseling after the trial. Tutuola tells her they will if he is convicted. Munch informs her they may not be able to charge him causing her to question who makes that decision. Munch tells her that would be Cabot. She thinks Cabot will understand since she is a woman. When Andrews claims they made love, Stabler asks if he held her down or used a choke-hold on her. He denies he ever uses holds on Patricia because he knows he could hurt her. He wonders why they are asking him questions like that when he is the one with the marks. Benson reminds him he told Patricia at the scene that he could do her without leaving a mark. After viewing the interview with Andrews from his office, Cragen tells Cabot it is her call if they charge him or not. She wants to cut him loose. He reminds her if they do not charge him , then they are sending the message to every wife that if she gets raped she had better get beat up as well. He wants Andrews booked so a jury can decide if he is guilty, but Cabot does not believe they have enough evidence to get past the grand jury. She tells him to walk him before leaving. He follows her out of his office to find Tatum and other detectives standing in the squad room. Tatum asks him if Andrews is getting pinched. When Cragen tells him it does not concern him, Tatum explains Homicide looks out for each other before questioning if he has been at a desk too long. Cragen tells him he enforces the law riding any hump that breaks it. When Benson and Stabler join them in the squad room, Tatum asks if he is feeling wood for Andrews. Stabler responds telling him he is now calling him a cheap shot. Cragen tells Tatum to get out of his squad before he complains to his Lieutenant causing Tatum to explain that was who sent them. He asks again if Andrews is free to go. Cragen tells everyone he is. Stabler turns around telling Andrews he can go. As Andrews walks out, Munch and Tutuola escort Patricia into the squad room. Andrews informs them he wants her charged with Assault. Cragen tells Munch and Tutuola to do it. Patricia questions how he could charge her. Munch tells her he will ask him as they escort her away. Andrews tells the crew from Homicide to leave.Patricia enters the visitation room where Munch is waiting asking if he minds if she smokes. When she cannot find a light, she tells him she told Andrews she would quit so she might as well do it now. Munch informs her some habits are worse than others adding his wife has some pretty foul ones. He explains she will be his ex-wife soon. The only contact he has with her is when she is wanting money or for updates on status of the divorce. Patricia wonders if he hates his wife. He tells her that would make it too easy explaining that they still fight, but he is not around for the tantrums. She believes he treated her the way he did because of his wife. He corrects her saying he does not like her. When he asks how she is holding up, she informs him she is worried about Andrews. Munch is in awe at the generosity of women. She explains Andrews works midnights so he will not have to sleep. Once she saw Andrews scrubbing his bullets in the sink with his gun laid out on the counter on a towel. She asks him to check on Andrews for her when the guard returns to take her back to her cell.In court, Patricia's lawyer enters a plea of not guilty to the charge of Assault in the First Degree. Cabot asks for her to be released ROR. The judge believes her to be too generous even if she is feeling compassionate citing the fact Patricia threw a baton into a crowd of police officers and other city personnel. The judge orders a $10,000 bond. At One Police Plaza, Cragen is informed Jefferies has filed a discrimination lawsuit against the department. The papers were delivered earlier in the day. Legal is checking it for merit. When he is requested to speak with her unofficially, he explains he knew she was angry but did not know to what extent until now. When it is explained the suit does not name him but she wants back in the field, Cragen explains he has a problem with putting her back in the field. He is told to talk to her as a friend and if that does not work he is to make it go away.Munch walks into Cabot's office to inform her Andrews paid Patricia's bail so he believes she will recant. Cabot cannot wait to get Andrews on the stand. Munch thought she was dropping it, but is told she can sell it now. He had her arrested and bailed her out. That is suspicious. Munch tells her he did not know women got into whizzing contests. Cabot wants to speak with Patricia to clear the air.Cabot asks Patricia if anyone threatened her. She denies it saying she just does not want to go through with it anymore. She claims she does not want Andrews to go to jail over a petty marital spat. Munch reminds her she cried rape to anyone that would listen. She claims she was mad. Cabot asks if it has anything to do with Andrews dropping the Assault charge. Patricia tells her Andrews is a good guy when Cabot asks who paid her bail. When Munch reminds her Andrews raped her, she tells them he apologized. This was the first time he ever apologized. Cabot asks her to repeat what he said exactly. After she tells her what she wanted, Patricia explains she believes this is a fresh start for them. He is trying to feel her pain. Munch tells her she is psycho for counteracting his admission by dropping the charges. She refuses to lose Andrews because Munch decides to believe her now. After she leaves, Cabot informs Munch she can charge Patricia for Filing a False Report, but she wants to charge her for Felony Assault. Munch wonders if she just wants to put someone in jail. Cabot explains she wants to force Patricia's hand a little. Munch does not believe Andrews will re-file just to make her day. Cabot reminds him they will not need Andrews is there is another witness to the attack. Parker informs Munch he heard the Andrews fighting, but denies seeing anything. Munch reminds him the dispatcher was told it was assault with a deadly weapon so he had to have seen it. Parker verifies Andrews will not be told it was him before telling him he saw her cut Andrews with a knife. Patricia's lawyer believes Cabot is reaching by charging Patricia with Assault Two. Cabot informs him she has a witness, her prints, and the knife. She believes Patricia will get 3 years at Bedford Hills. Cabot informs them her compassion ended when the rape charge was dropped. She agrees to drop it to Assault Three if Patricia will testify in front of the Grand Jury so she can get an indicted on Andrews for First Degree Rape. When Patricia claims it is blackmail, Cabot corrects her saying it is the law.Benson and Stabler interrupt Tatum and Andrews at Manhattan South's Homicide unit. Stabler discreetly informs Andrews he has a warrant fo his arrest in his pocket. Stabler asks that he not force him to Mirandize and cuff him in front of his squad. Andrews removes his badge and weapon handing them to Tatum to hold. Tatum tries to stop them stating he thought it was over as he stands in their way. Benson asks him to move out of their way after telling him it is not settled. Benson and Stabler escort Andrews out of his precinct.As Cabot enters the courtroom, she notices the gallery is full of cops. Andrews is charged with Rape in the First Degree, Sexual Misconduct, and Sexual Abuse. When he pleads not guilty, Cabot asks for bail to be set at $50,000 causing the crowd to express their disapproval. Andrews's lawyer believes his client's reputation is being smeared. He reminds the court Andrews is a member of the NYPD and wants his day in court before requesting he be released ROR. Cabot believes if he is released ROR it will send a message that cops get a free ride. Cabot is told to save it for trial before he is released ROR. Her request for an order of protection for Patricia and for him to surrender all weapons is granted before court is dismissed. Cabot asks to speak with his lawyer. Cabot offers Sex Abuse One, a Class D Felony. She is turned down being told she would not give in if she thought she would win. When she claims she is trying to save time, she is reminded Patricia's recant will go on the record if she takes the stand as well as her physical attacks on Andrews. Cabot informs his lawyer that Andrews confessed a few days prior to his wife adding he does not deserve his freedom or a badge. She is told Spousal Privilege will stop the confession from getting into court. This trial will not be in front of a jury. The judge will render a verdict. Andrews's lawyer asks her to drop the charges and send the Andrews to counseling, but she refuses. When he tries to hand her a handkerchief for the egg on her face, she walks away.In court, Munch tells the court Patricia wanted to drop the rape charges against her husband, but never recanted her statement. He continues stating Patricia stated Andrews apologized for raping her for the first time in their marriage. When the defense objects claiming \"double hearsay,\" Cabot claims exception questioning why he would admit to guilt if he did not do it. The defense tries stating it falls under Spousal Privilege. Judge Beck informs them Privilege was voided by telling it to a third party. Patricia clarifies the pot she threw was from the stove, but it was no longer hot stating she did not want to hurt him. After hitting him with the pot, he grabbed her by the back of the head and dragged her into the house. They fought some more. She claims she would hit him and he would push her away. When she claims she does not know if she was raped, Cabot reminds her she stated he slammed her against the wall, put his arm around her neck, and squeezed causing her to almost lose consciousness. He pulled her pants down, removed her panties, and raped her. Patricia tells her she supposes she told that to the police before admitting that she did. The defense gets her to admit she went to the police to recant. She admits she was facing Assault charges and was offered a deal for her testimony. Cabot clarifies Patricia wanted to drop the charges only after Andrews dropped the charges against her. With the judge's help, Cabot gets her to admit she had a change of heart after having a long conversation with her husband. Andrews tells the court they have been married five years and have been mostly happy until recently. The police have been called four times to their home because his wife loses control. He claims he loves her and could not stand to see her locked up over something that is his fault due to his cheating and not coming home. He denies raping her or using excessive force on her. He believes she filed the charges because he failed to break up a year long affair as promised. He claims he apologized because his wife would not have let it go unless he did. He repeats that he loves her. Cabot asks if he told Patricia he could do her without leaving a mark. When he tries to deny he meant it the way it sounded, Cabot reminds him city personnel heard him. He explains the \"heifer\" threatened to torch him causing Cabot to question if he really loves the \"heifer.\"  As Cabot is eating her lunch, Andrews's lawyer offers a plea to Sexual Misconduct and Andrews agrees to give up his badge. Cabot scoffs stating she may not have won yet, but she must have evened the odds considering he is trying to plead out. Andrews's lawyer asks her to make a deal with him and agree the two parties should never be married, especially to each other. He commends her on bringing up Andrews's statement in the heat of an argument. He wonders what people would say about his arguments with his wife. When he admits he wants to kill her sometimes, Cabot informs him that if she dies he will have a problem. She reminds him her offer of a D Felony with a sentence of 3 years is still on the table. He reminds her that with the charge Andrews will be tagged a sex offender for the rest of his life. Jefferies arrives at Cragen's office at his request. He asks her to sit down, but is told she would rather stand considering she doubts she will like what she is about to hear. He informs her he is talking to her unofficially so she sits down as requested. When Cragen states he knows the previous few months have been hard on her, she realizes the conversation is about her lawsuit. He wonders if she has thought about the politics and how hard the Department is going to make it for her. She does not believe her private life is any of the Department's business. Cragen reminds her SVU has different rules. She tells him she knows he ducked when it hit the fan. He informs her she is an integral part of his squad and although he did not agree with their conclusion, he did agree that she needs help. When she asks what her personal life has to do with the way she does her job or her ability to do it, he explains it is the equivalent of her eating her gun and he cannot allow that to happen. She concludes the meeting stating they do not have anything left to talk about before walking out.In court, Judge Beck states a wife has the right to the same protection against her husband as she would anyone else. He wonders how the law can determine if a rape occurred within a relationship defined by sexual intimacy. He does not believe it can absent any injuries. He finds Lloyd David Andrews not guilty of all three charges. As the court room is emptying, Andrews and Patricia hug. Munch approaches Cabot stating the case was a waste of time. Cabot does not agree reminding him she is the only ADA to get a case of Spousal Rape past the Grand Jury paving the way for someone else to get a conviction. Cragen walks into his office and sees a gun and badge laying on his desk with Tutuola occupying a chair next to it. Cragen assumes it is his and tells him he thought he would make it at least 60 days. Tutuola informs him Jefferies did not want to leave her gun unattended before apologizing and leaving. Alone in his office Cragen quietly says he is sorry as well."
    },
    {
      "episode_title": "Noncompliance",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/noncompliance-12353/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Baby Killer",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/baby-killer-12352/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Legacy",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/legacy-12351/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Closure Part 2",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/closure-part-2-12350/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Honor",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/honor-12349/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": "An unidentified young woman is found in a city park, having been raped, stabbed and beaten with rocks, then left for dead. A bloody rock is found nearby. Elliot and Olivia initially theorize that the woman was the victim of a \"wilding\" attack. The hospital determines that the victim had been a virgin.Pressured from the Chief of Detectives for action on the case, Captain Cragen tells Elliot and Olivia to talk to the captain of the park precinct. He cautions them that Captain Walson is \"a jerk times ten.\" Walson lives up to that billing, so Elliot and Olivia also talk to one of his patrol officers. The officer tells them of  several recent incidents in which a group of young, upscale gangster wannabes had been terrorizing people in the park. Captain \"Not-In-My-Park\" Walson hadn't mentioned it because he'd noticed the pattern only the day before. Now he's worried about facing the Morris Commission. Just the previous week the officer had arrested one of the group's leaders, a smart-mouthed teenager named Chris Lyons.Lyons, his father and their attorney meet with Elliot and Olivia at the attorney's office. The teen admits that he and his friends had snatched some purses here, and leered at women there. However, he denies that they attacked the present victim. The lab finds the DNA of only one man on the victim, which eliminates the \"wilding\" theory. She had lost almost half her total blood volume, but the CSU technicians didn't find nearly that amount in the park. The assault was a dump job, and the attack followed the rape by about 8 hours. The victim had been wearing a Hanford University T-shirt when she was found.The university identifies the victim as Nafeesa Amir, a journalism major from Afghanistan. Her school record lists a post office box address, and her emergency contact as Daoud Tarzi. Munch and Fin go to Tarzi's address and talk with a man who identifies himself as David Hamoud. He says Tarzi no longer lives there, and that he doesn't know Nafeesa Amir. After dodging several other questions, including one about his bandaged forehead, he apologizes that he's late for a meeting and leaves.A Hanford journalism professor tells Elliot and Olivia that Nafeesa had faithfully attended all her classes, until that morning. Nafeesa had been amazed at the freedom of the press in the United States. Unless she sneaked out of Afghanistan, her parents must be in the States too. Nafeesa had been very close friends with another student, Annette Fleming.Fleming tells Elliot and Olivia that Nafeesa had been loving life, free from the stifling repression of women in her homeland. Hanford professor Husseini, a Mideast specialist, had been helping Nafeesa assimilate into American life. She had a boyfriend whom she never discussed, apparently to protect him. Nafeesa's father is an Afghan diplomat -- and a control freak -- who may have been looking for his daughter. In Nafeesa's campus locker, Elliot and Olivia find a photo of a man who may be the boyfriend, and her parents' home address.The detectives visit the Amirs. While his wife Aziza sits silently in the background, Saleh Amir acknowledges that Nafeesa is their daughter. Ignoring Olivia, he tells Elliot that Nafeesa did not know her place. She had chosen a man's work, and turned her back on her traditions and her family. In the family's eyes, she's dead because she slept with a man who wasn't her husband. The Amirs also have a son, Jaleel, who isn't home at the moment. Saleh asks them to leave him and his wife to their grief that their daughter chose a Western lifestyle.Munch recognizes the man in Nafeesa's photo as Daoud Tarzi, aka David Hamoud. After SVU arrests Tarzi, he tells them that he loved Nafessa. They'd argued about her father and his controlling ways. Saleh Amir didn't want to become known for letting his women do as they pleased. Tarzi wanted Nafeesa \"to stop acting like she's from some primitive tribe.\" He'd dared her to leave him, never thinking she'd actually do it.A search of Tarzi's apartment turns up a bed sheet with a blood stain. The blood is Nafeesa's, and semen   on the sheet is Tarzi's. The bloody fingerprint on the rock from the park isn't hers or his, nor does it match anyone in the system. However, the lab got an odd reading from the blood on the rock, so they're re-testing it.At arraignment, Tarzi is held without bail. Saleh and Aziza Amir, who supposedly no longer care about their daughter, are in the courtroom.To find out why Nafessa's and Tarzi's romance was such a secret, Elliot and Olivia talk to Professor Husseini. He tells them that all the Afghan diplomats at the United Nations, including the Amirs, are holdovers from the pre-Taliban government. While the previous government had allowed Afghan women a sizable amount of freedom, the Taliban put women under virtual house arrest. Therefore, trying to return home would be very dangerous for the Amirs. However, that doesn't mean Saleh Amir isn't a Taliban supporter. Nafeesa wanted to live as a modern woman, and had to leave her parents' home to do it. In Afghanistan women have been killed for much, much less.Alex Cabot talks to Tarzi and his attorney at Rikers. Tarzi tells Cabot that Nafeesa was her family's ticket back to Afghanistan. Saleh Amir had promised her to the son of a Taliban government minister. Earlier the night Nafeesa was assaulted, Tarzi had given her an engagement ring, which she accepted. They then had consensual sex, after which she had a change of heart and left him. Tarzi hadn't revealed any of this earlier because his forehead injury was inflicted by a police officer, sent by Saleh Amir to find Nafeesa.Munch and Fin find the officer, Ross Campo. He's illegally moonlighting as a private investigator. To keep Internal Affairs from learning of his sideline, Campo reveals that Saleh Amir hired his second employer to find Nafeesa. The family was returning to their home country, and wanted her to go with them. Campo tracked Nafeesa as far as Tarzi, who denied knowing her and refused to reveal anything about her even after Campo conked him. The lab's re-test of the blood on the rock reveals two types of DNA: one Nafeesa's, the other not Tarzi's. The second DNA type is similar to Nafeesa's, meaning it belongs to a relative. The hospital informs SVU that Nafeesa is dead. Cabot asks about Jaleel Amir, who recently graduated from New York University and celebrated his 21st birthday. Since he's not currently enrolled in school, his diplomatic immunity expired on his birthday.Elliot and Olivia talk to the doorman at the Amirs' apartment building. He remembers seeing a sobbing Nafeesa there, at about 7:00 the night she was attacked. An hour later Jaleel called him, wanting him to bring up the big shopping cart. Already resentful of Jaleel's treating him like a personal slave, the doorman had refused, saying he couldn't leave the desk. If Jaleel did fetch the cart himself, he must have exited through the building garage because he didn't come through the front door.Realizing that Nafeesa's death was definitely an honor killing, Elliot and Olivia visit the Amirs again and demand to know where Jaleel is. This time Olivia doesn't let Saleh Amir ignore her. He belligerently tells her his daughter was a whore, just like Olivia (an unmarried woman with a job, and working alongside men to boot). Aziza Amir speaks up, and tells them that Jaleel is on his way back to Afghanistan.Munch and Fin go to the airport and board the Kabul-bound plane, which hasn't left yet. They find and arrest Jaleel Amir. Without any prompting, Jaleel smiles broadly and says, \"I'm proud I killed her. She deserved to die.\"When Jaleel's defense attorney can't get the confession thrown out, he changes his client's plea to not guilty by reason of mental disease or defect. Honor killings are so ingrained in Jaleel's native culture, Jaleel didn't know that killing his sister was wrong.The judge orders a psychiatric examination, which is conducted by Dr. Emil Skoda. Jaleel now acts like a basket case, and constantly fingers a strand of traditional Afghan beads. As a boy in Afghanistan, Jaleel had been forced to watch his aunt's honor killing by his grandfather. Jaleel has had nightmares about the experience ever since. Cabot realizes that a jury might be just as confused as Jaleel seems to be. Skoda tells Cabot she has to find a jury who can see past the confusion.The trial begins. In the courtroom Jaleel is still fingering the beads, and now also wears a traditional Afghan cap. Munch testifies that Jaleel had been wearing Western clothing on the plane, and freely admitted to killing Nafeesa before Munch and Fin could read him his rights. Jaleel insists he killed his sister to restore his family's honor.Cabot becomes concerned that the jury is buying Jaleel's mental-disease-or-defect defense. The prosecution is out of people to say otherwise. Olivia points out that they still have one more ally: Aziza Amir. Cragen and Fin both object, with Fin pointing out that if Aziza testifies, she'll be condemning herself to death. Olivia replies that Aziza wants justice for Nafeesa's memory, as evidenced by her defying her husband to reveal that Jaleel was returning to Afghanistan. If they reach out to her again, she might help them. Fin says that if they ask Aziza to do this, they have to be ready to protect her. Cragen says they're ready. Aziza tearfully says she doesn't want their protection; she wants her daughter.On the witness stand, Aziza Amir tearfully but resolutely testifies that after leaving Tarzi, Nafeesa came home to rejoin her family. Saleh asked if she was still a virgin. She wasn't. Saleh hit Nafeesa, knocking her down. When Jaleel tried to help her, Saleh said, \"Let her lie there like she lies with her American boyfriend.\" Saleh then gave a kitchen knife to a terrified and unwilling Jaleel, and told him to kill Nafeesa to restore their family's honor and prove his own manhood. Reluctantly, Jaleel stabbed his sister. Then he and his father took her away.The jury convicts Jaleel Amir of murder. Cabot calls Cragen with the news, then comments that after attending every day of the trial, Saleh Amir had not been in the courtroom for the verdict. Elliot and Olivia go to the Amirs' apartment building. Saleh Amir had left the night before, without his wife but with a ton of luggage that suggested he wasn't returning. Olivia tells the doorman to let them into the Amirs' apartment immediately. Inside, they find that the price of justice for Nafeesa has been paid. Aziza Amir lies dead in the bedroom, covered in blood from a slashed throat."
    },
    {
      "episode_title": "Wrong Is Right",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/wrong-is-right-12348/recap",
      "nth_season": 2,
      "source": "http://www.tv.com",
      "corpus": "While Maureen dances in her bikini top and her jacket tied around her waist on the beach with Ryan Witherspoon, she notices Stabler approaching. She quickly puts on her jacket and goes to meet him inquiring as to why he is there instead of Kathy. He explains Kathy took the twins to a birthday party before giving her a hard time about Ryan. Before they leave, he tells her he guesses he is cute.As they drive home, Maureen decides to change the radio station. Stabler notices a tattoo on her wrist. Instead of immediately telling him it is henna so it will wash off, she reminds him he has tattoos causing him to remind her he was eighteen and in the military. When she tells him he is acting too much like a cop, he tells her to wait until she has kids being sure to tease her saying they will be Ryan's. Stabler notices a patrol car pulled over fighting a fire on the beach. He pulls over to help telling Maureen to stay there, roll up the windows, and lock the doors. He retrieves a fire extinguisher from the back of the minivan and runs to the officers being sure to identify himself. One of the officers warns him someone is on fire. When the flames are out, he tells them to call it in while he removes the cloth covering from the victim's face. He hears a gasp behind him causing him to look towards the sound. He approaches Maureen and turns her away from the scene telling her not to look at it and it will be alright.The Morris Commission asks Cragen what kind of unit he is running. As he is handed two files, he is told one detective picked up a suspect while out bar hopping and slept with him and the other one fanta about killing suspects. After he claims the files were suppose to be kept confidential, he is told Jeffries and Stabler will undergo further evaluation and must submit written explanations to them. Cragen is told ADA Cabot has been assigned to SVU and he needs to brief her on their cases ASAP. Before he can say anything else, the Robbery unit is called. As he walks out of the room, ADA Alex Cabot attempts to stop him. When it does not work, she follows him telling him her assignment to SVU preceded his unit's behavior problems. He asks her if she is sleeping with someone before he asks if she has yet to encounter someone she would like to skip due process with. Before walking away, he tells her he will apprise her of the cases tomorrow because of his behavioral issues. She agrees to meet him for breakfast. As Munch and Jeffries arrive for work, Jeffries tells him of two uniforms and a detective being reassigned to Public Affairs. They question the reasoning behind reevaluating when the crime stats are better than they have been in 30 years. Munch believes the public fears tough cops. As they arrive at their desks, Cragen comes through ordering Jeffries to his office. She shares a questioning look with Munch before complying. Once inside Cragen's office, Cragen questions her telling the psychologist about sleeping with a suspect. When she denies saying it, he tells her he is limiting her field time so she can prepare a formal response for the Morris Commission. When she angrily tells him she will not explain her sex life to them, he reminds her this is not coming from him. When Stabler arrives, Munch notices his beach bum look and asks if Jimmy Buffet is in town. Stabler explains he helped put out a fire set to a victim's crotch who had already been shot in the head. He was on his way home from picking Maureen up at the beach so she sees it. He explains Kathy had to pick her up from the scene so he could work it since it was a dump job from Manhattan. As Stabler is about to head back out, Cragen opens his door allowing Jeffries out and ordering Stabler to join him. Cragen inquires about Stabler telling the psychologist about his fantasies of killing suspects. Stabler clarifies he said preps. Cragen informs him the Morris Commission is investigating. Stabler reminds him they are suppose to be ridding the department of rogue cops before asking if his job is in jeopardy. Cragen confirms it. At the victim's residence, Benson informs Stabler and Munch the victim is 42-year-old Andrew Croft. She tells them a Lexus, which is missing, is registered to the address and it may be the dump vehicle. She explains Croft was transferred to New York City a month prior by Radial Velocity. Munch questions what Croft does for a defense contractor. Benson continues saying Croft has a 16-year-old son named Michael who he argued with a lot. When they see blood splattered all over the bedroom and the mirrored wall. Munch asks if anyone heard the argument. She tells him the neighbors were all out before explaining books from MacArthur High were found, but they do not have Michael Croft as a student. She adds the books are bar coded. Munch tells her that he will take Radial Velocity with Jeffries if Cragen will let her out of the office. When he leaves, Benson asks Stabler what is going on. He explains that during psych evaluations he said he felt like killing child molesters. Benson believes the Morris Commission should understand considering they are all cops. Stabler reminds her they have not been to a crime scene recently.At MacArthur High, Benson and Stabler are told the book belongs to Michael Goren so they should speak with Mrs. Scheider, his counselor. When Mrs. Scheider tells them she needs a release from Michael's guardian to show them his file, they explain Croft was murdered so they cannot get one. She explains Michael was born in Belgium and could be a straight A student, but he is not because of some possible turmoil that causes him to hang out with troublemakers like Jason Sloane.Benson and Stabler locate Sloane playing an arcade game at the beach. When Sloane comments about Stabler's outfit, Stabler claims it is casual Monday. Sloane claims he has not seen Michael since he stayed over the previous Saturday so he does not know where he is. Sloane explains they are not close but Michael hates going home to Croft. When he responds positively to the news Croft is dead, Sloane explains he saw Croft slap Michael around. After he tells them some girl calls Michael from somewhere, he adds he is a teenager and will not do their jobs for them.When Munch and Jeffries arrive at Radial Velocity, they are greeted by Craig Prince and Ralph Noble bringing them everything from Croft's office that is not fied. Prince informs them he was a Guidance Systems Analyst. They refuse to tell them who Croft's emergency notification was and are unconcerned as to who will care for Michael. Munch asks if they will need a court order causing Prince to tell him to try. Prince calmly asks them to leave the dolly in the garage when they are done before walking away.In the squad room, Munch notices most of the papers from Radial Velocity are blacked out. Cragen arrives causing Munch to voice his complaint. As he joins Munch in looking over the papers, Cragen reminds him they are talking about national security. Munch continues his rant as he places a call believing something else is going on. He tells the person he called he wants to see him immediately.Munch is told Prince is being investigated because he is living beyond his paycheck. He disperses fied money. Noble is head of security. He is a Vietnam vet. He was awarded the medal of honor, the purple heart, and a silver star. The only thing known about Croft is he is a guidance systems analyst. The only people who would erase a past is the Department of Defense or the National Security Agency because he can guide a missile 600 miles in 20 minutes into a house without touching the doorframe. Munch informs him Croft is dead and Michael is missing. When asked how it happened, he answers, \"Bullet to the head. Bunsen to the crotch.\"As Stabler wipes off his face after shaving, he hears Maureen scream. He rushes to her asking what is wrong. As she cries, she repeats, \"He's on fire.\" He hugs her as he tries to soothe her.During breakfast, Cragen tells Cabot he does not care for city politics. When he questions if he can trust her, she informs him she intends to stand on his shoulders to reach a broader constituency so she would not do anything to shorten her grasp. Before he begins telling her about the open cases, he tells her this may be the beginning of a beautiful friendship. Jefferies informs the team Croft was killed by a .38 slug behind the left ear at point blank range making the burning postmortem. She adds they do not have the murder weapon, but Croft owned a .38. When Cragen asks about Michael, Benson tells him he is still missing and so is the Lexus. Munch suggests Michael is dead because Croft may have found evidence of kickbacks against Prince. Stabler reminds him it looks like a sexual homicide. When Munch suggests it may have been staged that way to throw them off track, Benson is amused at his inability to let go of a theory. When the discussion looks to be escalating, Cragen steps in telling them the connection between Croft and Prince needs further investigation, but the boy is still missing. He sends Benson and Stabler to find Michael and the car. He tells Munch and Jeffries to see if Cabot is good enough to get a search warrant for Radial Velocity.Cabot clarifies that Munch and Jeffries want her to get a search warrant for a defense contractor so they can search for evidence in a sexually motivated homicide while dialing the phone. After Munch asks if she has a problem with that, she asks for Judge Harriman and identifies herself to the person on the phone. When she greets Judge Harriman as Uncle Bill, Munch and Jeffries exchange a look of disbelief.Munch and Jeffries return to Radial Velocity with other officers to serve the search warrant. When Prince tries to stop them, Munch threatens to have him restrained.Benson gets off the phone and informs the team the missing Lexus was located by the state police in Millbrook where the local police are watching it until they arrive. Benson and Stabler leave with Cragen's order to find something.As Benson and Stabler look around the car one officer verifies the Sadler family if not home. They are told Richard and Darlene Sadler live there with their daughter Denise. When Stabler locates blood on the trunk, he tells the other uniform to open it. They find a bloody newspaper in the trunk along with a gun.At Adams High School, Benson and Stabler inform the principal they need Denise to help them find Michael. He tells them Michael is in their mentoring program before taking them to him. Once outside, they see Michael showing children with Downs Syndrome how to play soccer. When the principal calls him, Michael verifies the police are there about Croft. They take their conversation to an unused oom. After Benson makes certain he understands his rights, Michael tells them he wants to talk. He admits to killing Croft saying Croft hit him so he hit him back for the first time. Croft got the gun threatening to kill him. They fought over the gun until there was a pop resulting in Croft's death. He wrapped him in sheets and put him in the car. Michael claims the next thing he remembers is driving to Millbrook. As Benson and Stabler escort Michael to their car in handcuffs, the hallway is crowded with people trying to figure out what happened. They show him support as Benson asks them to move.When Cragen, Benson, and Stabler arrive, Munch is still sorting through papers. Cragen informs him the papers can be returned since they have a confession. Munch explains the case was too neat. When Benson comments on Munch's inability to let go of a theory, Munch reminds them of the blank pages from Radial Velocity causing Benson to join his search. Cragen reminds Stabler of his appointment with Skoda. Stabler tries to get out of it claiming it will take too long to get there. Cragen tells him he has to go, but Skoda is at Christ's Church so he will have to go there to see him. Stabler jerks the paper Cragen is handing him out of his hand and leaves.At the church, Stabler tells Skoda he will not talk to him. He may lose his job because Jackson did not keep his confidence. Skoda explains she must have felt he was a danger to himself or others. Stabler reminds him he has never hurt anyone causing Skoda to ask why she would think he would. Skoda asks him to trust him. Stabler admits he has not been sleeping lately because he is afraid he will lose his job before adding he is angry. He admits he not only fanta about killing the perp but this time he fed him the gun and pulled the trigger until he caught him. He explains this perp is a good kid that tutors Downs Syndrome children, star athlete, and Millbrook's favorite son. He does not understand him committing cold-blooded murder. Skoda reminds him that in 14 years on the force no murder has made sense even though some could be understood before inquiring as to why this one bothers him so much. Stabler tells him his daughter saw this one.Stabler returns to the squad room telling Benson he talked to much again. After Munch and Benson tell him Jefferies is with Skoda, they inform him they ran Croft's prints through NCIC and came up with nothing prior to 1991 when he began working at Radial Velocity. After searching the papers received during the search warrant, they find a passport issued ten years prior in San Diego so they had the police there run the prints. The prints belong to George Kazinski, a convicted sexual predator of small boys.Munch and Jeffries inform the team Croft had eleven arrests, five aliases, and four convictions. They ran the search backwards through the arrests and convictions. When Cragen mentions only the Feds can erase your past, Munch reminds him Radial Velocity is the Feds. Cragen asks him if he has a motive behind the federal government sanctioning child sexual abuse. MMunch returns to Radial Velocity with Stabler. Munch shows Prince proof of Croft's arrests claiming the source is fied. When Munch sarcastically claims Croft's abilities took precedence over his criminal history, Stabler inquires as to whether it was okay even if a child was hurt. Munch sarcastically replies it is not their concern. Prince claims if he knew Croft was a pedophile he would not have hired him. Munch believes if that was true then there were no Nazis in NASA. Prince has Noble show them out. As they approach the elevator, Munch tells Noble there must not be much of a fight left in him. After Noble tells him not to question his patriotism, Munch pulls out a handkerchief telling Noble to take some of the tarnish off his medal of honor. Stabler steps in, grabs the handkerchief, and tells Noble they can see their own way out while ushering Munch into the elevator. Once the elevator doors close, Stabler returns the handkerchief to Munch asking why he is provoking Noble. Munch explains that as a war hero Noble fought for principles and he believes this mess is eating away at him. Stabler suggests Noble may not have principles anymore. Munch tells him principles die hard in people and he wants a shot at Noble's. As they leave the elevator, Stabler suggests catching Noble at lunch.At Rikers, Michael explains to Benson and Stabler that his parents died in a car wreck when he was eight and his grandmother's health was failing so Croft offered to take care of him. He tells them Croft went to his soccer practices. His father was a janitor at NATO while Croft worked there. Croft paid for sailing and tennis lessons for him. Once his parents died they moved from Belgium to Bosnia to Israel to Millbrook where he finally made friends and obtained a girlfriend. After Michael denies knowing Croft sexually assaulted an 11-year-old boy in 1990, Stabler asks when Croft began assaulting him explaining pedophiles do not stop. Michael continues to deny Croft touched him even after Stabler reminds him he is safe. As they are leaving, Michael's attorney thanks Stabler for the heads up on an EED defense. Stabler reminds him Michael has to admit it first before he and Benson walk away. Benson asks him if they are working for the defense. Stabler explains he believes Michael is hiding something because you do not volunteer to do hard time out of embarrassment. They guess it is an accomplice, someone who scares him more than Croft.As Noble leaves for lunch, Munch is waiting. When Munch claims money got in the way of his courage and integrity, Noble reminds him of the crappy military pay. Noble tells him Croft's abilities were crucial in the Gulf War. He explains Croft's convictions were never erased. A firewall was built around him so he would not be delayed at the border during the war. The wall should have come down once the war was over and he does not know why it did not. Munch tells him that because of the wall Croft was allowed to obtain guardianship of an 8-year-old. Noble apologizes before walking away.Cragen and Stabler update the case with Cabot. When she has her receptionist to call Justice, Cragen tells her they did not intend for this to become a federal case. Stabler reminds her of Michael's abuse causing her to remind him of Michael's denial. When she tells them that without Michael's admission, they are asking her to soft pedal premeditated murder. When Stabler accuses her of protecting her win-loss ratio, Cragen warns him. Cabot believes Stabler's judgment is impaired because of the Morris Commission and Michael fulfilled his fantasy. Cragen tells her he stands behind Stabler on this. Cabot questions Michael's future choices if they let him off on this case before agreeing to their request stating he must admit to the abuse or she will go ahead with Murder Two.Michael repeats his denial of the abuse even though he is told it was not his fault. When Stabler tells him he is a victim, Michael knocks everything off the table saying he is not. While observing outside, Cabot tells Cragen Michael is returning his own indictment of Murder Two. She apologizes before leaving.As Stabler begins to fix himself something to eat, Maureen makes herself known at the bottom of the stairs. She tells him she cannot sleep. When he asks if she is having nightmares, she reminds him that would require sleep. While she fixes him a sandwich, she asks about Michael. He explains Michael had enough of the man molesting and hitting him. When he questions why kids will not tell them the truth, Maureen tells him talking to adults is hard because they are always judge kids so they talk to their friends instead. When he questions who they talk to when they do not have friends, she tells him everyone has friends. He asks if she talks to Ryan. She tells him she talks to him more than he talks to Kathy.While Cabot questions the ME in front of the grand jury, he informs them Croft could not have been fighting over the gun when it went off because the shot was fired three to four feet away to the back of his head. Stabler informs them Croft was bleeding from a head wound and his crotch was on fire when he was found. Benson tells them the blood pattern in the bedroom shows Croft was in bed when he was shot. There was no sign of a struggle or forced entry. The victim's missing car was found in Millbrook with the murder weapon in the trunk by the state police. Michael Goren had the keys to the car. When Benson comes out of the room, she tells Stabler Michael is toast. He asks her if she is up for a ride.Denise tells Benson and Stabler she has been seeing Michael for about three months. She is reluctant to talk about Croft, but tells them he and Michael did not get along. She explains Michael would stay in their spare bedroom whenever Croft went out of town. He began lying about Croft being out of town, but Croft did not do anything about it especially since Danny Burrell and Michael stopped being best friends.Benson and Stabler have Danny pulled from wrestling practice to go on the baseball field and talk. After Danny tells them he and Michael are no longer friends because he is weird, Stabler asks if Croft attacked him. He tells them Michael swore he would not say anything before adding he cannot talk in front of Benson. She excuses herself to the bleachers. Danny explains Michael told him Croft was not home one day after practice so he decided to take a shower. When he got out, Croft was standing there naked touching himself while offering to dry him off. Croft grabbed him. He fought him off while yelling for Michael. When he opens the door, Michael is standing there so he ran. After that he told Michael to leave him alone. He believes Michael liked what Croft was doing because he could have fought him off. Stabler tells him Croft started abusing Michael when he was eight and could not fight him off before asking where a 16-year-old would turn when his best friend turns his back on him.When Cabot questions Michael in front of the grand jury, she tells him the evidence says his version of events is impossible when he sticks to his story. He denies Croft attacked Danny at first, but admits it when she tells him Danny will testify that he did. This time he admits his own abuse, but denies shooting Croft to stop it saying he was use to it. He informs her he shot him because he would not stop bringing his friend over. He met the friend on one of the friend's trips to Millbrook when Croft made him be with him. He believed it was over when they moved, but they moved across the street from him. When he refuses to name him, Cabot tells him a child molester only has power as long as his secret is kept. He informs her Croft and Prince killed a boy in Belgium when he was eight. He does not believe Cabot can protect him from Prince. Stabler and Munch interrupt Prince during a meeting to inform him Michael is charged with Manslaughter Two and the DA is willing to make him a deal. When Prince questions the relevance to him, Munch informs him he is under arrest for sexual abuse, sodomy, assault, and endangering the welfare of a child while Stabler cuffs him. When Prince claims Stabler is hurting him, Munch tells him it is not their concern. As they escort him out of the room, Stabler reads him his rights.Cragen shows the Morris Commission pictures of three victims explaining their most significant injuries. He tells them he stands by Stabler and others who see what they do and manage to keep their impulses in check.While Kathy sends Maureen to yell for the other kids for supper, the phone rings. Stabler answers and after a few brief responses thanks Cragen for his support. He turns around to Maureen standing there and Kathy asking for the results. He announces the Morris Commission cleared him.In the squad room, Detective Odafin Tutuola approaches Cragen as he is leaving to attempt to give him his file. Jeffries approaches asking if she can help. He introduces himself stating he has been reassigned. She informs him he is there for her job. When he tells her it is awkward, she reminds him she is the one being replaced."
    }
  ]
}