{
  "episode_recaps": [
    {
      "episode_title": "Cold",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/cold-1198193/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Trade",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/trade-1198192/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Authority",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/authority-1189487/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Closet",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/closet-1165942/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Undercover",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/undercover-1163582/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": "It all starts out with a girl being raped. She tells detectives that she was getting weed for her mother in prison because one of the CO's makes her. They investigate into the rape and figure it was the CO. They go to collect the rape kit and the CO had stolen it. Olivia tells the captain that the only way to stop this is to go under cover.  She poses as a woman addicted to pain killers and other drugs who is beat up by her husband etc. Fin is posing as a correction officer to try and keep her safe. It turns dangerous when there is an out break and the prison is sealed off.  No one can get in or out.  Benson and the other inmates want answers, and when they aren't given Olivia starts a sort of riot.  One of the CO's takes Liv to the \"Hall\" but is actually taken to a basement with a bed.  Olivia instantly knows what is about to happen. The CO beats her up and tries to rape her.  Fin gets there seconds before Olivia is raped."
    },
    {
      "episode_title": "Inconceivable",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/inconceivable-1165946/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Unorthodox",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/unorthodox-1165949/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Signature",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/signature-1163605/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Streetwise",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/streetwise-1163601/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Snitch",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/snitch-1154732/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Paternity",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/paternity-1147829/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": "The episode begins with a child running down a street, covered in blood and a man in hot pursuit. He runs into a woman's arms and when she sees the state that he is in the man says that he only wants to help him. Next the kid gets passed into the hands of an official who checks him out and discovers that he isn't hurt just splattered with blood. Elliot asks the kid his name and he says \"Tommy\" when asked for his last name he claims he doesnt know. he says his moms name is \"mommy\" then jumps into Elliot's arms and says he wants his daddy.He refuses to let go of Elliot and no-one could find out who he belongs to. He is brodcasted live over the news as the kid with one name and soon people come in to get him. Meanwhile Elliot takes him home and gives him a bath and fresh clothes. When a legit person comes claiming Tommy Elliot checks with Tommy first to see if its his dad. tommy responds by leaping out of Elliots arms and runs to the guy screaming daddy.When asked if he called his wife the man answered he tried but he couldnt get through. The detectives and the man then go out and search for Leah at the house. At the house they dicover a dead body. The man relieved says that it wasnt Leah it was their maid, Jodi. Jodi was raped then beaten to death. The detectives continue their search for Leah and tracks her down to a motel thinking she was being raped only to find her getting laid by her boyfriend. Benson and Stabler take her into questioning and finds out that Jodi was a  Morman nanny and got the names of her two nanny friends. When they question the nanny friends they find that she had a boyfriend whom she met on a site named faceunion.com. When they search the computer they get three hits and they explore each one. finally they get lucky with the third hit a guy named Raphael gardener. After some great detective work they get a confession and book him. Then some disturbing news surfaces, Jake keegan isnt Tommy's biological father. while arguing whether or not they should tell Jake benson and Stabler realise that he is in the room.Stabler and Keegan talk about it for a while and the conversion ends with Keegan's groundbreaking statement; how would you feel if you found out that one of your children wasnt yours.At home Stabler is worried that the child Katharine is carrying may not be his. He partially confronts her about her actions during their separation and she is outraged. While talking to his wife Stabler gets a call from olivia about a fight in the keegan house between the husband and the boyfriend, matt. matt showed up and wanted to see Tommy so jake attacked him. Stabler arrests them both.it only gets worse as Stabler finds out that Jake is irrevocably connected to Tomy by law meaning that even though he isnt the biological father he still would have to pay child support and alimony.Matt filed for custody of tommy and jake brings tommy but sends him up with another detective and leaves. Tommy says that his daddy went away and his mommy went away too just like jodi. Stabler and benson go out looking for them when they arrive at the house they find leah dead and no sign of Jake. Stabler presumes he went out by his lakehouse in north forks to kill himself and tells the officers there to hold him and benson offers to take kathy for her check-up. At north forks Stabler gets jake and they talk then he calls to check up on his wife and benson. After the call their car is struck by a black car and olivia isnt badly injured but kathy is hurt. Olivia calls for the ambluance and fire department then jumps out of the car.When help reaches at first olivia is asked to get medical attention but then when they realise they need someone to stabilise her neck Olivia jumps back in and assists by putting on a brace. Katharine's water breaks and Olivia is instucted on how to insert fluids into her. The firemen cut off the roof and then they go for the front and her contractions start to come on strong. When they finally get her out she is hoisted into an ambluance and an emergency delivery is performed. She holds her baby then passes out. Olivia takes it from her. At the hospital Eliiot rushes in and holds his baby and talks to kathy. He goes out and thanks Olivia and hugs her. He says kathy wants to name the baby after him and olivia comments that, that is just what the world needs another Elliot Stabler."
    },
    {
      "episode_title": "Fight",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/fight-1147229/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Blinded",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/blinded-1141685/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": "The episode begins with an elderly woman talking to a young patrolman, Officer Tim, about hearing a voice coming from a car parked in the bus stop. She heard the words, \"Help me, and then a name. Savannah, Samantha…\" Officer Tim suggests Sabrina and the woman says that was the name. He approaches Sanjay, the corner hotdog vendor who knows his name and anticipates his order, but Officer Tim shakes his head and instead shows the man a picture of a young girl and asks if Sanjay has seen her today.  Sanjay says no, and the officer asks about a car parked at the bus stop about two hours ago. Sanjay says it was towed.  Officer Tim calls in a \"Possible sighting on kidnap victim Sabrina Farmer. Notify SVU that she might be in the trunk of an impounded car.\"In the next scene, we see the SVU squad smashing windows and popping trunks on cars in a police impound lot.  They don't know which car it is because the traffic division's computer system is down, but when Cragen questions how they know it's in Queens, Olivia tells him that \"Pier 76 is full and this is where Manhattan is sending their overflow.\"  When Cragen asks if anyone is checking the paperwork to identify the vehicle, Elliot assures him that the tow-truck drivers have been notified that they are looking for a missing child.  A siren is heard as Cragen asks where the infrared camera is, and Olivia tells him Emergency Services is on the way.  O'Halloran arrives with an infrared camera and a moment later, ESU joins them with another.  Cragen deploys them, and a moment later, O'Halloran finds something in a gray Impala. Fin breaks the window and pops the trunk, and Elliot opens the trunk to find Sabrina Farmer, bloody and barely breathing. Cragen calls for oxygen, but Lake informs him that EMS is stuck in traffic. Olivia says, \"We'll take her,\" and Elliot lifts Sabrina out of the trunk.  The scene ends with him running through the lot with Sabrina in his arms.The next scene begins with the doctor leaving Sabrina's room to speak with Benson and Stabler in the hall. \"Sabrina's CAT scan didn't show any bleeding, but she does have a serious concussion.\"  Sabrina's parents can be seen through the window over the doctor's shoulder as she tells the detectives that Sabrina was most likely hit in the head with a rock- there was dirt in the wound. Benson asks when she will wake up, and the doctor has no idea. When Elliot asks is she was raped, the doctor confirms it. There were no fluids, but they did find several hairs and extensive bruising.  The doctor comments that Sabrina is only eleven, and Olivia tells her, \"Don't ask why. It will just make you crazy.\"  The doctor leaves saying she will call the detectives when Sabrina is conscious.As they walk down the hall planning their next move, Elliot says they can go back to the security cameras, but Olivia reminds him that they will only see what they saw before: Sabrina leaving a bookstore alone and nobody following her.  As they turn the corner, Lake meets them and informs them that they have information on the Impala in which they found Sabrina.  The driver's name is Saul Picard from Mandeville, Louisiana; he picked it up from Escape Rent-a-Car three days ago.  Elliot fears that if he is a tourist, he is gone from the city, but Lake tells him that Picard signed a month-long lease an executive apartment.Benson and Stabler go to Picard's apartment. The room is sparsely decorated and messy with Picard's things scattered about.  Picard appears disheveled and his hair is messed up. As he examines their identification, Olivia tells him they're there about his rental car. \"The one I returned yesterday?\" Elliot informs him that the rental agency has on record of its return. Olivia asks to use the bathroom, and after telling her where it is, Picard produces a receipt for Elliot and tells him the clerk's name was Mickey.  When Picard asks, Elliot tells him the car was stolen. Picard says he can't be held responsible for anything that happened after he dropped it off.When Elliot asks where he's been, Picard says he was in the apartment working and he went to the deli on the corner a few times for coffee and burgers. Seeing something on the table, Elliot comments, \"You're an artist.\" Picard acknowledges, \"That's not what my critics say.\" Elliot crosses the room and picks up a drawing of an elephant and asks Picard, \"Have we met before?\" Picard says it's doubtful. He's in New York every few months on business, but he lives in Louisiana. Elliot asks if he lives near New Orleans. Picard says he lives on the north shore of Lake Ponchartrain, but he is looking to relocate because Katrina destroyed his house two years ago and it's not the same anymore. Elliot says he wouldn't blame Picard for trying to get away. Olivia returns from the bathroom and Picard asks to see their credentials again.  They show their IDs, he thanks them for indulging him, and Elliot thanks him for his time. Down at the deli, Elliot is wrapping up a phone conversation as Olivia comes out with a couple of cups of coffee. Elliot explains that he has found out that Picard's story about the car checks out. When he returned it, Mickey, the clerk, didn't have enough room for it in the garage, so he left it on the street with the keys in it. When someone stole it, he was afraid he would lose his job, so he went back into the computer and changed the records to make it look like Picard hadn't returned it yet. Olivia tells Elliot that the clerk in the deli recognized Picard and that he had been in a couple of dozen times over the past couple of days. She calls him a \"caffeine freak,\" and Elliot adds, \"Not to mention a paranoid freak, asking for our IDs twice? Bad case of OCD.\" (obsessive compulsive disorder) \"Not to mention BO,\" Olivia adds. She tells Elliot the shower was dry as if it had never been used and the bedroom was messy but there was no sign that Sabrina had been there. Elliot comments that all they have left is the car.At the crime lab, O'Halloran informs them that the only trace evidence they have been able to find is some pollen from a Louisiana flat sedge, which could only have been transferred by close physical contact like sitting in the seat where it was found…or raping Sabrina while she was sitting there. Elliot asks if that grows anywhere near Lake Ponchartrain and O'Halloran answers, \"Around the bayous on the north shore. How'd you know?\" Benson and Stabler return to Picard's apartment and kick in the door, but the place has been cleared out completely. They and realize that Picard is the one who saw the keys in the car when he left the rental agency and stole the car right back. Elliot states the obvious: \"Oh, we screwed up.\"Back in the squad room, Cragen orders, \"No press, but I want every cop on the street looking for this guy.\" Elliot suggests that with an eighteen-hour head start, if he were Picard, he would be fleeing to Brazil (which has no extradition treaty with the U.S.). Fin reports that his DNA is not in the system and the FBI has nothing on him. Lake says Sabrina could be his first victim, but Fin argues that serial rapists usually start out closer to home.  Cragen asks if they checked with the Louisiana police and Olivia says Picard only has two unpaid speeding tickets.  Munch arrives with information that Picard rented a blue Ford Explorer from the same agency where he got the Impala the previous afternoon- right after Elliot and Olivia visited him, and just before they put the alert out on him. Munch also reports that Picard did not check out of his apartment or purchase any airline tickets to flee. Fin is surprised that Picard is \"sticking around.\" Cragen orders for the description of the Explorer to be circulated. Olivia, tapping on her keyboard, tells him it's already done,  then takes a call. Lake asks if they should stake out Picard's apartment, but Elliot doubts he'll go back. Olivia hangs up and tells them Sabrina is awake.At Mercy General Hospital, Olivia interviews Sabrina while Elliot keeps his distance. Sabrina says she was looking at some books when Picard told her she was in danger and her mom was waiting for her outside. He went \"out through the coffee place\" which Olivia says \"explains why he wasn't on the surveillance camera.\" Sabrina says her mom wasn't outside, but Picard said her mother was hurt and he would take her home if she told him where she lived. She got into his car, but he went the wrong way. She tried to get out but the doors were locked. At Olivia's prompting, Sabrina remembers that he said he was taking her \"someplace safe\", that he talked \"funny,\" and he said \"hearken to the ark.\" She admits she didn't understand most of what Picard said. While Olivia shows Sabrina a photo array, Elliot's cell phone rings and he goes out into the hall to take the call. Sabrina easily identifies Picard and tells Olivia that \"He said his name was William,\" and he took her to a park. She tried to run away, but he said, \"Stop, Francine.\" Before Sabrina can continue, Elliot opens the door and urgently gestures Olivia to join him, so she leaves Sabrina to rest.As they leave the hospital, Olivia asks hopefully if they caught Picard, but Elliot tells her another girl has been taken. At the library, Lake tells Stabler it fits Picard's MO as Fin shows an assistant a picture and asks if he knows the girl. The assistant confirms that she was sitting at a nearby table picking out some books.  Elliot picks up a book and reads the cover: \"Button's Quest, by William S Falstaff.\" \"I read this to my kids,\" he comments. \"You and a million other parents,\" the assistant tells him.  Olivia arrives telling them that Picard was seen on the surveillance tape leading Eve Holland out forty-five minutes ago. Elliot curses and when Fin asks, he tells the group that he knew he recognized Picard. Opening the book to reveal the picture on the back flap, he tells them that Picard is Falstaff.  Fin holds up a book titled, \"Secret of the Arch,\" and comments on the pen name. Elliot and Olivia recall what Sabrina said about \"hearkening the ark,\" and then discuss where he might have taken her in the city. There's not enough cover at the Arch in Washington Square Park, but ultimately, they settle on the Arch at Grand Army Plaza in Central Park.Benson and Stabler arrive at the park to find a uniformed lieutenant, Lieutenant Shea, already organizing a manhunt. They identify themselves and Olivia asks if anyone has spotted them yet. He says no, but he has a chopper up and they're calling in some more manpower. She says the girl was snatched less than two hours ago so if they work fast they might find her before she gets hurt. Shea says they'll do their best, but it's a big park. Another officer who has been on the radio while they were talking interrupts to tell them that the chopper spotted something in the trees on Lookout Hill. Shea orders his men to mount up, and Elliot suggests that Picard might hurt Eve if \"all the troops\" spook him. Shea agrees to let Benson and Stabler go in first.They rescue Eve, who has been drugged to make her sleep, and apprehend Picard, who is also sleeping in the driver's seat, without incident. As they are taking him back to the waiting officers, he rants about various things- including Alice in Wonderland, the car that was towed, his lawyer who is an expert on pralines, and G.W. Bush's determination to keep the U.S. troops in Iraq. As they arrive at Grand Army Plaza, Picard sees a rolling billboard that says, \"Winter's coming…Time to escape.\" He mutters, \"Oh, OK.\" Elliot asks, \"OK, what?\" but Picard is non responsive, asking instead, \"Do I have to do it now? It's going to be really hard.\" He starts insisting, \"I gotta get away.\" He struggles a little, and when Elliot tries to restrain him, he head butts Elliot with such force that Elliot falls backwards into the side of the car and shatters the window with his head. Olivia runs to his aid and orders the other officers call a bus and get Picard. She crouches beside Elliot, cradling his head in her arms and telling him he's OK and a bus is on the way.Elliot wakes in the hospital and asks, \"What's going on?\" Kathy gasps and tells Olivia and the nurse that he's awake.  A relieved Olivia comes over to stand near the bed and says \"Welcome back, El.\" He asks again what's going on, and Olivia tells him, \"You're in the hospital.  You're OK.\" \"I'm not OK. Where are you?\" he says. His vision has been affected by his injury.  All he can see are blurry shadows. He calls his wife's name, and Kathy takes his hand.Out in the hall, the doctor explains his injury and that his brain bounced off the front and the back of his skull. Temporary blindness is not uncommon, but it's a good thing that he can see bright colors, light, and shadows. Fin arrives to report that there is trouble in Picard's room and Cragen leaves. Olivia tries to get the doctor to give a definite time when Elliot's vision will return, but the doctor only tells her, \"His MRI showed some swelling in the optic nerve. We'll know more in a few days.\"In Picard's room, Cragen finds that the FBI has come to take him away. Cragen tells Special Agent Wayne Nelson that the Feds don't have jurisdiction because Picard didn't cross state lines. Nelson informs him that he kidnapped a nine-year-old girl in Mississippi and took her to Louisiana where he raped her and left her to die.Back in the squad room, Munch tells them about Tiffany Lemarsh, who was kidnapped from a bookstore in a shopping mall in Gulfport, Mississippi. She was raped by Picard and left in his house for four days without food and water. She was found barely alive when the neighbor's dog got her scent and led them to her.Casey arrives wanting to know who notified the Feds. When asked if she did, she says no. Lake says they just picked him up that morning and didn't even get him into the system before the Feds showed up. Olivia asks if she can do anything about it, but Casey informs her that the State of New York doesn't even get an extradition hearing. Munch says the indictment is a crock. Picard kidnapped Tiffany in Mississippi, but they indicted him in Louisiana. Olivia tells him he raped her in Louisiana. That makes it part of the same crime and they can try him in either state. Munch says once the FBI gets Picard, they are going to drop the kidnapping charges and let Louisiana try him for the rape. Casey explains that raping a child under the age of twelve in Louisiana is a capital crime.Casey goes to Barry Moredock, who can't understand why she is upset about the situation. The FBI is saving her a lot of work. She explains, \"The Feds are pushing their own agenda,\" by taking Picard to Louisiana because they have the death penalty for Picard's crime and New York doesn't. She says, \"I'm not going to let them abuse their power and emasculate the authority of my office.\" She asks Moredock to take Picard's case, pro bono, because she doesn't have any legal standing to request a hearing. The Feds are trying to get Picard \"under the table\" which is \"a violation of due process.\" Since Moredock is a Constitutional lawyer, he gleefully accepts. As they part, she explains that Picard \"has some psychiatric issues\" and gets Moredock's permission to have Huang evaluate him.Picard explains to Huang that the sign in the park that said, \"It's time to escape\" was a message to him. Another one on a billboard said, \"You really need to get away,\" and that's when he abandoned the car with Sabrina in the trunk at the bus stop. He tells Huang that Francine, his sister, is sending the messages \"because those boys raped her.\" As the interview progresses, Picard starts hearing voices. Huang learns that when Picard was seventeen and Francine was eleven, he arrived home from school to find several boys taking turns with his sister. He froze and couldn't do anything to help her. The stress of that moment triggered his first psychotic break. His first medication, Haldol, worked for many years until Francine died but then it quit. The only thing that worked after that was Risperidone, but that left him feeling like he was \"swimming through wet cement\" so he quit taking it.That's when the messages started. Picard goes on to describe a hallucination in which he saw Francine and the boys who raped her at the bookstore in Gulfport. The boys were gathered around her and \"she was in terrible danger.\" So he took her some place safe, but the boys found them. Two of them held him down and the other raped Francine. Then he set a trap. He took Francine to New York and lured the boys to the Arch (Arc) where he beat them with rocks when they came to rape her.When Huang and Novak discuss the case, Huang tells her Picard is not a pedophile, he's a schizophrenic and he kidnapped those girls because he thought they were his sister and he was saving them. Casey asks if he will remember what he did, and Huang says it's possible once his medicine takes effect, if it takes effect. He explains that it's possible nothing will help him in times of great stress. Casey asks if that means he might not make it through a trial and Huang is surprised that she is thinking of putting him through one. He insists that Picard is sick and putting him in prison is \"no less cruel and unusual than the Feds trying to execute him.\" Casey says she will take his opinion under advisement, and at that moment gets a text message that Moredock has won the hearing and the Feds can't take Picard.As she is walking in the courthouse hall,  after her meeting with Huang she is approached by the press. She tells them that she expects Louisiana to file for extradition, but Picard is in New York and they are going to keep him. When asked about her beliefs on capital punishment, she says what she believes is irrelevant. It is not the law in New York, but if it becomes New York law, she will enforce it to the best of her ability. As she is watching herself on the press conference in her office, Barry Moredock appears and says, \"I hope you mean that,\" meaning that she isn't letting Picard go back to Louisiana. She says she plans to try him in New York, and Moredock gives her a motion for extradition and tells her Picard wants to talk to her. In the Rikers Island Mental Health Wing, Picard's medication is working now, and he knows what he has done. Picard invites Casey to call him Saul and asks her to tell the victims he is sorry and requests to be sent back to Louisiana. He wants to face the death penalty because he thinks he doesn't deserve to live saying, \"If the state thinks that killing me will stop one pervert from doing what I did to those poor little girls, then it's worth it.\" Out in the hall, she and Moredock debate Picard's sanity. She tells him to file for a 730 hearing to have Picard declared incompetent, but Picard won't let him. He asks Casey to file for the hearing, because if he's declared incompetent he can't waive extradition. However, he can't be tried in New York, either. Moredock suggests she make a deal, he pleads guilty and she sends him to a mental institution, but Casey argues that Jack McCoy won't allow that. Moredock accuses her of being \"a team player instead of doing the right thing.\"Back in the squad room, the detectives debate the wisdom of forcing the mentally ill to take medication.  Lake is against it, saying he didn't know when he went off his meds that he would \"turn into Godzilla.\" Olivia argues that he was lucid when he made the decision to stop, that makes him responsible. Fin agrees with Liv saying there should be a special law for people like Picard: \"Take your meds or we're gonna force feed 'em to you.\" Casey offers no opinion until Olivia asks if she can prove he knew he hurt someone. Casey is confident that she can get a conviction with Sabrina Farmer's testimony. Then Lake asks if he goes back to Louisiana to face the death penalty. She says yes, if they let him, and Lake says, \"Don't let him, Casey.\" Lake, Fin, and Olivia argue briefly about executing child molesters. Lake says, \"It's a no-brainer. The death penalty's never been a deterrent for murder.\" Fin points out that murderers usually strike once, child rapists repeat. Lake points out that if you threaten to kill them, they have no reason not to kill their victims to silence them. Olivia tells them, \"But execute them and they'll never hurt another child.\"Casey requests Olivia's paperwork on the case, and Olivia asks when she will be needed in court. Casey says she won't need Liv. She's going to use just Sabrina and Elliot. Olivia tells Casey she doesn't need Elliot, \"I saw everything that Picard did.\" Casey says she didn't hear what Picard said and she needs Elliot there to show the jury the kind of damage Picard can inflict. Olivia argues that \"the police surgeon said Elliot can't leave his house until his vision's back.\" \"Unless he has to appear in court,\" Casey reminds her. Olivia implies that the stress could hinder his recovery. Both women get rather testy, and Casey decides that Elliot should make the decision for himself and leaves the squad room.Casey goes to Elliot's house. He still has two black eyes from his injury and he tells her his vision is still blurry. She asks if he feels up to testifying against Picard. He talks about how he's going to be a father again soon and how frightened he was that he might never see that child. \"So Picard? Bring him on.\"In court, Elliot testifies about how Picard head butted him and he was injured. He tells the jury he was temporarily blinded, and when asked to identify Picard, he puts on a pair of strong glasses and points him out. Casey asks if he would consider Picard dangerous, and Elliot says he is extremely dangerous. Then Casey asks Picard was saying anything when he attacked Elliot, and Elliot says he was saying over and over, \"It's time to escape.\" Casey begins to get a little more assertive as she tells Elliot about the sign that Picard thought was a message for him and asks if Elliot saw it. Elliot begins to seem slightly confused about where Casey's questions are going, but he says he did. She asks if Picard was distraught and he says yes. She asks if Picard qualifies as an EDP. Barry Moredock looks surprised. Elliot begins to look as if he has figured out what Casey is doing, and he doesn't like it, but he answers honestly, \"Yes,\" and at Casey's direction tells the jury that an EDP is an emotionally disturbed person.Casey becomes increasingly aggressive, asking, \"In other words, he's crazy?\" The judge interrupts saying Elliot is not qualified to answer that question. She asks if Picard mentioned Francine to Elliot and if he told him about seeing his sister being gang raped and doing nothing about it. Both times Elliot answers no. Elliot says, \"He never mentioned anything about his sister in my presence.\" Picard, now distraught, asks, \"Why? Why should I? Why should I trust God?\" It is unclear whether he thinks Elliot is God. He goes into a rant, believing that Casey is Francine and she is 'testing' him, and has he to be removed from the courtroom. The judge tells Moredock to save his breath, that he is declaring a mistrial and ordering the 730 hearing.As the courtroom clears, Elliot leaves the witness stand and calls to Casey. She hurriedly tries to gather her things and leave, but Elliot confronts her about her questioning. He says she never wanted to try Picard, but she insists she tried this case to the best of her ability. He tells her, \"Cut the crap. You wanted Picard in the loony bin and you used me to put him there.\" He turns to storm off, but stumbles over something he didn't see. Olivia steadies him, but he brushes her off, insisting feebly, \"I'm fine.\"In her office, Casey says into the phone, \"Yes, sir. I'll be right up.\" Olivia barges in angrily asking if she is proud of herself. She tells Olivia she doesn't need a lecture. Olivia says she knows why Casey \"sandbagged Elliot in court,\" and she goes to Casey's desk to take out a picture of Casey with a young man. It is a picture Olivia has seen before when Casey confided in her about her former fiance, Charlie, who was diagnosed with schizophrenia. Olivia asks if he is locked up now, and says he's the reason Casey \"tanked the Picard case.\" She insists that Picard deserves to be punished for what he did. Casey asks if she means what he did to the girls or to Elliot. Olivia accuses her of manipulating the detectives to satisfy her own agenda, and Casey confronts her about informing the FBI that they had Picard in custody asking if she went straight to the FBI or if she went through the Louisiana authorities. Olivia wanted Picard dead and this way her hands were clean. Olivia says the girls were entitled to some justice, but Casey says that what Olivia tried to do isn't justice, but revenge. Olivia says, \"He's my partner, Casey.\" Casey says, \"And it's my case. And how I handle it is none of your d--- business because I don't answer to you.\" As she leaves, Olivia says quietly, \"We'll see.\"In Jack McCoy's office, Casey gets a lecture about how she handled the case and McCoy shows her a police incident report from her past. She explains that Charlie was off his meds and hurt her. When the police came, she identified herself as an ADA and asked them not to charge him. She thought she could help him, but she couldn't. McCoy accuses her of abusing her authority then and abusing it again now. They argue again about how she handled the case and why and he orders her to stay on the case through the 730 hearing and \"behave\" herself. If she doesn't do as she is told, he will not only fire her but have the bar pull her license. Casey goes to the squad room and asks Olivia why she informed McCoy about her past. Olivia says it was because she threw the case. Casey says she had no choice after Olivia informed the feds that Picard was in custody. Olivia stops the argument by saying that she is as guilty as Casey of acting on personal motives and admits she was seeking revenge. Casey asks about Elliot and Olivia says he'll be back to work next week. Olivia asks about Picard. Casey says the judge ruled him incompetent and she couldn't legally touch him now. Olivia asks if she thinks Picard will ever get better, and Casey says she doesn't know. \"I thought Charlie would get better.\" When Olivia asks what happened, Casey explains that about six months ago, the morgue called her about a John Doe with her business card in his pocket who had been hit and killed by a taxicab. It was Charlie. She expresses her guilt that maybe Charlie would be alive if she hadn't made him leave and Olivia assures her that she had to take care of herself. Before the conversation can continue, Casey gets a text message. While he was in lockup, Picard made his shirt into a noose and tried to hang himself.In the final scene, Casey goes to visit Picard. This time she invites him to call her Casey. He tells her he isn't crazy; he wants to die. He gets a little better every day and the better he gets, the worse he'll feel about what he did. She suggests that someday he might be able to forgive himself when he realizes it wasn't his fault.\"Wasn't it?\" he asks."
    },
    {
      "episode_title": "Svengali",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/svengali-1141682/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Harm",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/harm-1141681/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Savant",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/savant-1141680/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": "The only witness to a young woman's horrific beating is her mentally challenged daughter.  A taxi driver is talking to his fare, Ben Nicholson, who irritably asks him to be quiet because he's \"really tired.\"  The cabbie complains that he's tired too, tired of circling the block and asks why he doesn't just get out.  Nicholson tosses two one hundred dollar bills on the front seat and says he'll tell the cabbie when he's ready to get out.  The cabbie glances down at the money and then back up to the street where, just in time, he sees a young girl come running out into the street dressed in nothing but a blood-soaked nightgown and carrying a phone.    Nicholson screams out her name, \"Katie!\" and bolts from the cab to go to her.  He takes the phone from her and hears a 911 operator asking if the call is a prank.  He responds, \"My daughter is covered in blood.  Does that sound like a prank to you?\" and goes into the building.  Inside his apartment, Nicholson finds his wife on the bedroom floor bleeding profusely from a head wound.  At the hospital, a nurse tells Benson and Stabler that it will be a while before they can talk to the victim, Corinne Nicholson.  Elliot asks her to bag Corrine's clothes and start a rape kit.  From behind him, he hears a child's voice asking, \"What's a rape kit, Dad?\"  Elliot turns to see Katie Nicholson come running toward him.  She introduces herself and tells him, \"You look upset and need a hug.  Can I?\"  With Olivia looking over his shoulder, he accepts the hug and then looks up at Ben Nicholson who calls his daughter back over to him.  In the squad room, Katie goes from detective to detective chatting with them and asking for hugs.  She tells Munch, \"Some people think I'm an elf.  I'm not, see?\" She shows him her ears and says, \"Only one pointy ear.\"  Then she introduces herself and asks for a hug.  Munch refuses and tells her, \"I'm a stranger.  You shouldn't even be talking to me.\"  Katie responds cheerfully with, \"Ok, bye,\" and a wave and a smile.  She proceeds to Fin's desk where she plays with his pony tail.  He asks gruffly, \"Is there something I can do for you?\"  Katie looks a little hurt and asks if he is mad at her.  Fin says sternly, \"Didn't Sergeant Munch just tell you not to talk to strangers?\"  When she nods, he gives her a smile and she grins back, knowing that everything is ok.  In Cragen's office, Olivia explains to the captain the Katie \"has a rare form of mental retardation called Williams Syndrome.\"  Elliot explains that they don't know if she can tell them what happened because \"she's \"anxious one minute overly friendly the next.  She seems to have a limited attention span.\"  At Cragen's suggestion, they involve Katie's father in getting her statement.    The interview takes place in the children's interview room.  After some encouragement from her dad and reassurance that she \"did all the right things\" from Olivia, she is able to give a detailed account of what happened.    Katie acts out the events as she describes them.  First she says there was shouting that was so loud it made her cover her ears and hide under the bed.  Next she softly tells them it got quiet.  She says she heard footsteps, then she went to find her mom.  When she saw her mother was bleeding, she took the phone, \"even though I'm not allowed to, because it was an emergency.\"  Finally she tells them her dad came home.  \"He was gone a long time.  The end.\"  When Elliot asks, Ben explains that his job requires him to travel.  With a smile Katie says, \"We always drive Dad to the airport.\"  Ben chuckles, tells her it's his turn to talk, and sends he off to explore the room.  When Olivia questions Ben about the large amount of money he gave the cabbie, Ben confesses that his relationship with Corinne was strained and he was circling the block putting off going home to face \"the inevitable fight\" with his wife.  When Elliot asks if anyone would have a grudge against Corinne and want to hurt her, Ben says no at first and explains that Katie recently had major heart surgery so they mostly socialize with parents of children with medical and developmental problems like hers.  Then he seems to suddenly recall that there had been some tension among the parents in their therapy group lately.  When Elliot asks why, Ben explains that he and Corinne had filed a \"wrongful birth\" suit against Gerald Morgan, a high-risk obstetrician who was popular among other parents in the group.  If they won, he would lose his insurance and have to quit practicing medicine and \"they didn't like that.\"  Out in the hall, Cragen asks Benson and Stabler if they like Gerald Morgan as a suspect.  When they summarize their interview with Nicholson, Elliot emphasizes the facts that seem to indicate he is guilty while Olivia points out that \"couples fight, and he was out of town.\"  Cragen says he will have Munch check to see when Ben's plane landed and Elliot suggests that they talk with the other couples from the therapy group.  Cragen asks why he thinks any of them will talk, and he explains that \"if they were unpopular someone's going to want to vent.\"  At the Busken Group Counseling Center, the scene opens with a mother instructing her teenage son to pick up his brother from music camp and to come straight back to the center and not pick up his friends.  The teen answers that he heard her \"the first 1,000 times and Andrew likes my friends.\"  Turning from her son, she spots Elliot and Olivia and greets them with, \"Hi.  I'm Tina Parven.  You must be new to our group.\"  Seeming a little uncomfortable, Elliot tells her, \"Not exactly.\"  Elliot interviews Paul and Ursula Wei, parents of a child with Down's syndrome.  When Elliot asks about the suit, Paul says \"They're litigious and I told them so.\"  Ursula explains that Paul is a surgeon and he took the lawsuit personally.  Elliot asks if the Weis can tell him about their relationship and the scene cuts to Tina and Joel Parven who are talking with Olivia.  Tina says they were having troubles, and Joel tells Olivia there is more to their son Andrew than just Williams Syndrome but that it takes its toll on their marriage and his brother.  Tina then admits that she and Joel had separated twice and informs Olivia that Ben and Corinne had just gotten back together.  When Tina asks if Corinne can have visitors, Olivia tells her she'll have to talk to Ben about that.  Olivia asks how long the Nicholson's were separated, and the scene cuts to Elliot interviewing Jordana Weitz who says they had been separated for a couple of months.  Then she tells him that her husband couldn't take the stress and left her.  She tells Elliot that her daughter has Canavan Disease, and when he says he's not familiar with it, she goes on to explain that it causes progressive brain damage.  Her daughter wasn't supposed to survive long, but she's ten now.  Elliot asks if she was upset by the Nicholsons' wrongful birth suit.  She tells him she loves her daughter, but she lost her own lawsuit because Canavan's wasn't a standard test in the Ashkenazi Panel when she was pregnant, but it is now.  As they leave the counseling center, Olivia complains that the facts don't make sense.  She doesn't understand why, if the Nicholsons have just reconciled, Ben won't go into the house because he wants to avoid a fight.  When Elliot doesn't respond, she turns to him and asks awkwardly, \"How's Kathy?\"  He responds, \"Over forty and having a baby.\"  He admits to worrying about all the bad things that can happen, but when Olivia suggests they talk to a doctor, he tells her, \"We're Catholic.  Maybe it's better not to know.\"  As Fin and Lake are seated in the waiting room of Dr. Gerald Morgan waiting to speak to him about the Nicholson's lawsuit, an expectant mother asks then if the doctor has told them whether \"it's a boy or a girl.\"  Puzzled, Fin says politely, \"Excuse me?' and the woman begins talking about how she thinks it is wrong that they make it so hard for gay couples that they have to hire a surrogate.  She doesn't think it's right that they leave kids in the system rather than place them in a gay home and tells Lake and Fin, \"You seem like a nice couple to me.\"  With a grin, Lake places his hand on Fin's thigh and rubs it affectionately.  Fin appears shocked and doesn't seem to know how to react until the receptionist calls, \"Detectives, you can go in now.\"  Then he lightly bats Lake's hand away as he gets out of his seat.  The doctor is irritable but mostly cooperative as the detectives explain the reason for their visit.  He is offended that they think he might have raped and beaten Corrine Nicholson and explains that he was home alone because that it what he prefers after spending his day soothing terrified expectant parents.  When asked why his insurance company settled so often, he says sometimes it is cheaper to settle than to fight.  When Fin suggests it might be that he withheld details about unhealthy babies, he tells them the Nicholsons' lawsuit has no grounds because Corinne didn't have amniocentesis until it was too late for a legal abortion.  Then Fin asks for a DNA sample, and he offers on the spot to have his nurse come in and collect a buccal (cheek) swab.  Back at the station, Elliot tells Fin that Olivia and Lake are busy with trial prep, so it's just the two of them.  Fin finishes a call with the lab and Elliot guesses correctly that there were no hits on the doctor's DNA.  Elliot says that he still likes Ben Nicholson for the crime and supports his opinion with the fact that the Nicholson's \"insurance doesn't cover all of Katie's medical bills and they're drowning in debt.\"  When Fin asks if the wife had life insurance, Munch enters the room saying she had a $500,000 policy and no record of Ben leaving on any flight.  Elliot observes that they now have motive and opportunity.  Munch pulls up video of Ben saying goodbye to Katie and his wife at the airport and then leaving the terminal to catch a cab.  Elliot and Fin bring Ben Nicholson in for interrogation.  He keeps insisting he can't answer their questions.  Elliot tells him their theory of the crime: that he \"went on a bogus business trip,\" and came home and beat up his wife the day he was supposed to return.  Ben insists that it did not happen that way, and tells them that since he's not under arrest he's going back to the hospital.  Elliot asks why he won't cooperate if someone else really hurt his wife.  Ben says he is cooperating as much as he can.  Just as he is about to walk out, Cragen comes in with FBI Agent Dean Porter and tells them the interview is over.  Porter tells Nicholson to wait outside and then he tells Fin and Elliot \"this is a homeland security issue\" and they are not to talk to Ben again without clearing it through his office.  Elliot grumbles that Nicholson is \"into something and now we can't touch him.\"  Cragen reminds him that \"The Patriot Act trumps rape and attempted murder every time.\"  In the meantime, Munch has done some research on Ben Nicholson's career as an aerosols engineer.  When he mentions \"anthrax and smallpox and aerosol cans with timers,\" Fin suspects that he's about to spin another conspiracy theory.  Munch tells them that Nicholson has spent a lot of time at Fort Dietrich, Maryland where they do research on biological weapons and that he with think tanks run by CEOs who are making money off the war.  Elliot says it still doesn't explain why the FBI needs him so badly.  Fin suggests that he is either a whistleblower or \"went rogue and they flipped him\" to use as an informant.  In the hall, Casey approaches Elliot and Fin with a warrant for Nicholson's DNA.  She tells them to \"take it publicly; just don't ask him any questions.\"  Elliot wants to know when they can interview him again, and all she can tell him is that she is working on it.  In the meantime, the detectives can talk to everyone else in his life, friends, family, and neighbors in an effort to pressure him into coming to them.  At the hospital, Elliot and Fin find Tina and Joel Parven arguing about visiting Corinne Nicholson.  Tina says they are being supportive, but Joel feels they are intruding and says he has to get to work.  Elliot asks if Corinne is up for visitors and Tina tells him the nurse is checking and that Ben is with her now.  Then she asks Joel if he can stay for a little while and talk to Ben, but he refuses and leaves.  Elliot and Fin go into Corinne's hospital room to collect Ben's DNA and Agent Porter warns them that they are going to force him to file a formal complaint.  Fin tells him, \"Where you shove that is up to you,\" and presents him with the warrant.  Back out in the hallway, Porter insists that the police have the wrong guy and Elliot asks if Porter would \"vouch for someone just to save your investigation.\"  Tina Parven is there to witness the DNA collection and she asks why they are treating Ben the way they are.  Fin tells her he might have been the one who attacked his wife because he wasn't out of town like he claimed to be.  She doesn't believe them and asks if they can \"just do this.\"  Ben just shrugs.  Then the doctor shows up to tell Ben that his wife's condition is serious.  She is in a coma.  Elliot asks if she will come out of it and the doctor says they will just have to wait and see.  She further explains that they weren't able to save the baby she was carrying and she needs his consent to do a D & C to remove the fetus.  Ben is stunned to learn that she was pregnant as is Tina Parven.  Ben signs the consent forms and walks away in shock.  Fin and Elliot approach Tina to see if she has something to tell them.  She says she doesn't and Elliot says that even if she suspects something she needs to speak up.  She refuses and walks away.  Then Agent Porter approaches to warn them that if they don't stay away from Ben, \"next time the request will not be coming from me.\"  Back at the squad room, Elliot and Fin discuss their frustrations over trying to interview Ben with Casey and Cragen.  Cragen asks if they have \"boxed the guy in\" and Elliot assures them that they had talked to every significant person in his life and they all know he's their prime suspect.  Casey tells them that she has \"filed an obstruction complaint and the hearing's tomorrow.\"  Munch suggests that they talk to Katie again, but Elliot tells him that the previous interview with Katie wasn't very productive.  Munch says Elliot just didn't ask the right questions and tells them he has done some research and consulted with some experts.  Cragen doesn't like \"using an impaired minor to turn the screws on her father,\" but Casey points out that they have no other choice.  Grudgingly, Cragen asks what Munch has found out.  Munch explains, \"Children with Williams Syndrome are extremely empathetic, they study faces for signs of emotional stress . . . They're sensitive, eager to please, and affectionate, some have savant-like abilities, super hearing and perfect vision.\"  As he is talking, Fin and Elliot recall behaviors they each witnessed that were indicative of the characteristics of kids like Katie.  When Elliot mentions she had to cover her ears when she heard her mother and her attacker yelling, Munch tells him, \"Which probably means she heard every word.  They confuse time, but they can tell you what was said and identify who said it.\"  Casey asks what she could expect if she used Katie as a witness, and Munch tells her, \"Anxiety, ADD, and they have trouble taking criticism.\"  Fin jokes, \"That sounds like you, Munch,\" and then asks if he really thinks she won't lie to protect her dad.  Munch informs them that she won't lie for her dad \"Because with Williams Syndrome have no guile.  They don't even know what deception is.\"  Cragen gives the order to interview Katie again, and Casey says, \"Let's go.\"  Elliot is taken aback that she proposes to go with them, and she asks him, \"Do you think he's going to let you talk to Katie without a fight?\"  Nicholson is irate to find the police outside his door.  Piano music can be heard in the background as he is talking to Elliot, Casey, and Fin.  He refuses to let them talk to Katie, but as he is about to close the door in their faces, Casey steps forward and blocks the door.  She explains how she will file a request for a hearing and get a court order allowing them to interview Katie because she is the only witness to the attack and he is their prime suspect.  Reluctantly, he lets them in.  When they enter the room where Katie is playing the piano, she enthusiastically greets Elliot and Fin.  Casey holds out her hand to shake and introduces her self in a friendly manner.  Katie ignores her hand altogether and instead gives Casey a hug and says, \"Pretty.\"  Casey's just a little surprised by the hug, but when she looks at Elliot he just shrugs.  Fin tells Katie they have some more questions for her, and Elliot explains that he doesn't want to upset her so she can tell them to stop any time she wants.  Katie agrees and asks her dad to sit with her.  Looking miserable, Ben refuses, but assures her he will be in his seat right across the room.    As before, Katie repeats what she heard verbatim.  First someone yelled, \"You're ripping our family apart.\"  When Elliot asks if she recognized the voice, she says it was her dad and that her parents \"were fighting.  They always fight.\"  Fin asks what happened next, and she says her mom yelled, \"I hate you.\"  Then she claps her hands together.  Fin looks at Nicholson and asks, \"You slapped her?\"  Ben hides his face in shame.  Fin asks, \"Was that it?\" and Katie says, \"Come here baby, you smell good,\" in an approximation of seductive voice.  Casey asks if that was her dad and she says her dad wasn't home or \"the man\" wouldn't have been there.  Elliot asks if the man has been in the house before and she nods.  He asks if she saw him and she says, \"I heard him.  I always do,\" and she repeats, \"Come here baby, you smell good,\" exactly the way she said it before.  When Elliot asks, she assures him she would recognize the man's voice because she has perfect pitch.  She tells him she told her dad about the man and, imitating her dad's voice, she tells them that he said, \"Everything is going to be all right.  We're a family and we're going to stay together no matter what.\"  Then in her own voice she finishes with, \"The end.\"  Nicholson is distraught and covers his face with his hands.  Katie crosses the room to her dad, sits in his lap, and gives him a hug.    As they leave the building, the detectives seem more convinced than ever that Ben is guilty.  Elliot is sure he was \"using that shady terrorism threat to cover his ass.\"  Fin says, \"He almost got away with it,\" and Casey warns them, \"He still may.\"  At the federal courthouse, Casey meets with Assistant U.S. Attorney Marion Springer.  After stonewalling her briefly, Springer tells Casey, \"He was with us.\"  Casey asks, \"The whole time,\" and Springer replies, \"Need to know.\"  When Casey presses for more information, Springer serves her with papers.  Casey looks at them and says, \"The Patriot Act.  This convoluted piece of legislation isn't worth the paper it's written on.\"  As she storms out of the courtroom, Springer tells her to \"save it for the judge.\"  Back at the 16th precinct, Olivia and Lake meet Cragen in the hallway near the elevator.  Olivia asks what's up and Lake informs Cragen that the DA wasn't happy because they weren't through with their trial preparations.  Cragen informs that it will have to wait because the Nicholson case is not going well and he needs them back on it.  He tells them that Tina Parven has come in to make a statement.  She is waiting in the interview room, and he needs them to get something useful out of her.  He gets in the elevator and Olivia asks where he is going.  He tells them COMMSTAT.  Tina tells Lake and Olivia that she didn't think Ben would hurt Corinne but she isn't so sure now because Corinne was cheating.  When Lake asks how she knew, she explains that Corinne was pregnant, but Ben didn't want more children.  Olivia suggests that Tina would understand Ben's reluctance to have another child \"given the circumstances,\" and Tina explains that Williams Syndrome is a mutation.  It isn't inherited unless the parent has it.  Then she explains that \"Ben didn't want to take any attention away from Katie, they argued about it, and Corinne freaked when he had a vasectomy without telling her.\" Olivia asks who she was sleeping with, and Tina says she doesn't have a clue.  Corinne is her closest friend but \"I guess she thought I wouldn't approve.\"  Then Munch walks in to tell them, \"Corinne Nicholson is awake.\"  When Lake and Olivia arrive at the hospital, Corinne is agitated and confused.  Olivia tries to explain to her that she is the hospital because she was attacked, but she continues resisting the doctors and insisting that she needs to go get Katie ready for surgery.   \"She has aortic stenosis . . . She gets so scared.\"  The doctors sedate her, and as she succumbs to the medication, Lake assures her that her family is fine.  When Olivia tells the doctor that Katie was scheduled for surgery six months ago, the doctor tells the Corinne probably has retrograde amnesia and that her memories from the surgery to the present, including the attack, may never return.  Out in the hall, Casey has joined them and the doctor informs them that Corinne thinks it is April, 2007.  When Olivia asks when she'll get her memory back, the doctor says there is cure for retrograde amnesia, and no way to know if or what she will eventually recall.  The doctor tells them Ben hasn't returned her calls, and Corinne needs family and support to recover from her injury.  The doctor apologizes that she doesn't have better news for them, and when Olivia asks, Casey says their next move is to go to court.   In Judge Trenton's chambers, Casey mentions that Nicholson was not out of town as he said he was and points out that unless the FBI can account for every minute of his time up to the attack, their assurances that he didn't assault his wife are worthless.  Marion Springer says that in order to corroborate Nicholson's story, the police have to speak to \"people of interest.  That can't happen.\"  Casey sarcastically asks, \"So your work trumps putting rapists and murderers behind bars because there's a terrorist behind every corner?\"  Springer responds, \"You have no physical evidence linking Mr. Nicholson with his wife's attack, or should we just wait while you fabricate some?\"  The judge reprimands Springer, but rules that Casey's appeal is premature without evidence.  Out in the hall, Springer tells Casey that Nicholson is bait for buyers for rogue nations trying to buy trade secrets.  Casey understands what the FBI is using him for, but \"The problem is, he nearly killed his wife and you're protecting him for a sting operation.\"  Back in the squad room, the detectives, Cragen and Casey discuss their status on the case.  Nicholson is off limits unless they find physical evidence.  With no prints on the weapon, even if the DNA from the rape kit matches, Ben can just say she consented to sex. They can't prove rape anyway, because Corinne doesn't remember the last six months, not even the rape of her pregnancy.  Lake says it's a good thing they didn't tell her why they let her husband go, and Cragen says \"unless he tried it again.\"  Munch comes in with the DNA results and tells them Ben did not rape Corinne.  Fin says that doesn't matter because he still could have attacked her for cheating on him.  Benson and Stabler question Joel Parven, and he insists that nothing happened.  He admits to being with Corinne and that she did tell him about the baby, but when Elliot suggests that he attacked her because he was angry that the baby was threatening his faltering marriage, he denies it.  He admits that he was angry, but says he had been there to break it off only to end up in bed with her.  He tells them, \"I was stupid and reckless, but I didn't hit her.  She was fine when I left her.\"  When Olivia asks, he tells them he left around eleven and went home.  Then he tells them that they're going to have to arrest him if they want to talk more, because they can't keep him without charging him.  Elliot and Olivia go into the observation room to speak with Casey and Cragen.  Olivia says they'll never get a confession, and Elliot suggests they do a voice lineup and get Katie to identify him.  Casey suggests that because of her disability the ID might be inadmissible and even if it is, if she is challenged on the stand, she might break down. Elliot says she's not stupid, but Cragen quotes him from earlier saying, \"She's developmentally challenged and an emotional rollercoaster.\"  Casey isn't even sure she could be sworn as a witness, but Olivia points out that unless Katie makes the ID, Parven will walk.  Casey nods her head indicating that they should go ahead and try.  In the lineup, a series of men repeat the line, \"Come here, baby, you smell good.\"  Ben Nicholson is in the lineup, and when a nervous Katie looks at him over her shoulder, he reassures her that it's ok.  Parven's defense attorney, Chauncey Zierko, comments that it sounds more like seduction than a rape.  When Parven speaks, she identifies him immediately.  Elliot asks if she is sure and she nods.  Casey tells Zierko that Katie identified his client and Zierko questions her credibility and implies that a trial would be a waste of everyone's time.  Then Katie begins to reenact the argument that she heard between her mother and Parven.  \"Leave me alone!  I want a baby that can grow up, be normal.  That's what I want!\" she shouts what her mother said.  Her father tries to tell her not to say anything more, but Elliot tells him they need to hear what she has to say.  \"Too damn bad,\" she says in a deeper voice for a man.  \"You're breaking up my home you selfish bitch,\" she continues, and then in her mother's voice yells, \"Ow!  You're hurting me!\"  As herself, she says, \"Then, bam!  Mom was crying.  Then bam, bam, bam!  Then breathing.\"  In the man's voice she says, \"Bitch.\"  Then she finishes with, \"Then he went away, but he used the wrong word.  That's not what it means, is it, Dad?\"  She looks at her father, he shakes his head, and she says, \"The end.\"  Elliot asks if the man who fought with her mother is the voice in the other room, and she says no.  He asks if she is sure and she explains that his voice is too low.  Zierko looks relieved; the others look shocked and defeated.  Ben kisses Katie on the forehead.  Out in the squad room, Alex Parven comes to pick up his dad.  He asks why the cops took him and if he is all right.  Joel assures his son that he is fine and tells him the police have released him.  As she is leaving the squad room with Ben, Katie overhears their conversation and drags her dad over to Joel and Alex Parven.  Alex says he knows his dad wouldn't hurt Corinne, and at that point Katie accuses Alex, \"You used the wrong word!  A bitch is a female dog.\"  Now all eyes are on Alex.  Elliot asks Katie again, \"Are you sure?\" and Katie yells, \"My mother is not a bitch.\"  Joel looks at his son and asks, \"What the hell'd you do?\"  As Elliot takes Alex away, he calls to his father, and Joel tells him, \"Don't say anything, not to anyone.  I'll get you out as soon as I can.\"  Later that night, Ben Nicholson shows up at the precinct to find Elliot still at work.  He asks if Alex confessed, and Elliot tells him he got a lawyer and hasn't said anything.  Ben confides that he was hoping Alex would confess so that Katie wouldn't have to testify.  Elliot tells him that the Parvens had separated twice before and the police think Alex was afraid the affair was going to kill their marriage so he followed his dad, waited for him to leave, and then went in and attacked Corinne.  When Ben asks if he can prove that, he says they can't and that's why they need Katie to testify.  Ben tells him he wants the case finished because he and Katie can't move on until it's over.  He tells Elliot to let him know when, and he'll bring Katie to court.  Elliot promises that he will shield Katie from as much as possible.  At the swearability hearing in Judge Petrovsky's courtroom, Zierko again suggests that the court proceedings are a waste of time because of Katie's disability.  As Elliot slips quietly into the courtroom, Casey reminds the judge that Katie \"clearly heard the attack on her mother and identified the defendant.\"  Petrovsky asks if Katie is there to be examined and Casey has to ask for a continuance because Katie is not there.  Zierko objects on the grounds that they were all made aware of the date and time for the hearing.  Casey argues that \"the minor has Williams Syndrome.  Her mother is just out of a coma.\"  Petrovsky is sympathetic but reminds Casey that it is the parent's responsibility to present her.  She asks where Ben is and Casey looks back at Elliot who just shakes his head and shrugs.  Casey says they are looking for Ben, and Petrovsky give the prosecution twenty-four hours to find her before she dismisses the case.  Elliot meets Agent Dean Porter in a restaurant and asks him where Ben is.  Porter doesn't reply.  Elliot asks, \"Do you care at all, or is this guy just a pawn to you?\"  Porter calls him a bastard.  Elliot says, \"Well, I get that a lot.\"  Porter admits he doesn't have Ben, that he's gone \"off grid,\" and that Porter's case is in trouble without him.  Porter says, \"There are people he's supposed to be talking to, and instead he's protecting his kid from you.\"  Elliot asks, \"Do you think I enjoy making Katie relive that moment?\"  Porter replies, \"I don't blame the guy.  I mean, what would you do in his place?\"  \"Hide her in the last place anybody would look,\" Elliot replies with a flash of insight and gets up to go, leaving some money on the table to pay his part of the bill.  \"You find him, you let me know,\" Porter demands.  \"You'll be my first call,\" Elliot responds insincerely.  Out on the street, Elliot finds Tina Parven.  She asks how he found her and he explains that she uses the bank card a lot in the area and that he had just followed her from the store where she had used it to buy groceries.  She asks what he wants and he tells her he needs to take Katie with him.  She claims she doesn't know what he's talking about, but he doesn't believe her.  He tells her she's the perfect caretaker because she knows all about Katie's condition.  Keeping Katie for Ben lets him protect his daughter while Tina protects Alex.  She tells Elliot he's crazy, and he tells her the charges she could be facing if she refuses to hand Katie over.  She relents and tells him where Katie is.  Back in court, Casey asks if Katie knows what a lie is.  Katie responds that it's when you say something that isn't true.  When Casey asks if she has ever told a like, Katie describes an incident where someone made her a grilled cheese sandwich with \"things in it\" but she ate it so the person who made it would think she liked it.  Then she asks Casey if that's a lie.  Casey assures her it is not, and then submits to the judge that Katie can be sworn as a witness.  Petrovsky agrees and then bangs her gavel.  Katie jumps and shouts \"Don't do that!\" and Casey explains that she has very sensitive hearing.  Petrovsky apologizes; Katie accepts the apology and asks for a hug.  Surprised, Petrovsky says, \"N-no.\"  Katie looks a little hurt and Petrovsky relents, \"Maybe later.\"  Casey asks Katie if the man who was in the bedroom with Corinne said anything other than, \"Come here baby, you smell good.\"  To the embarrassment of all the adults in the room, she begins moaning and grunting in a fair approximation of the sounds someone would make during sex.  Alex Parven looks accusingly at his dad, and Petrovsky cuts Katie off.  Then Casey asks Katie if she identified Alex Parven as the man who argued with and hurt her mother.  Katie says he did, but \"He used the wrong word.  But my dad says it's really a bad word for girls.\"  When Casey asks how she could tell the difference between the voices of Joel and Alex Parven, she explains that she studies music and their voices are different in tempo, pitch, and timber.  \"I know what I heard.  The end.\"  Outside the courtroom, Elliot is waiting for Ben Nicholson.  When he asks Ben where he's been, Ben replies, \"Doing what I do best, looking out for my daughter's future.\"  Elliot asks if that's what his meeting was really about or if he was just trying to keep Katie from testifying.  Ben insisted that their priorities are different.  Elliot is trying to put someone in jail and Ben is just \"trying to make sure Katie is happy and safe.\"  Elliot tells him, \"She's not as fragile as you think she is.\"  Ben scoffs and asks if Elliot is an expert.  Elliot says, \"No, I just know a liar when I see one.\"  Ben gets defensive and asks Elliot what he means.  Elliot says he's more worried about himself than he is about his daughter.  Ben insists that Zierko attorney is going to \"rip her to shreds\" because Joel Parven has a child with Williams Syndrome and can tell Zierko about all of Katie's weaknesses.  Elliot tells him he left Katie with Tina Parven so he could take a meeting, not to protect Katie.  When Ben says Elliot knows nothing about it, Elliot elaborates, telling him he knows the FBI is looking for him, that he went \"off grid,\" and that he took the meeting without the FBI knowing about it.  Ben says that not everything he does is their business.  Elliot implies that he is into some illegal activities and tells Ben he better think of a better excuse than protecting Katie for the FBI.  Then Elliot Agent Porter arrives and thanks Elliot \"for the heads up.\"  Back in the courtroom, Zierko asks Katie what she did today.  She begins reciting a list of activities and makes a face when she mentions eating a grilled cheese sandwich.  Zierko cuts her off and asks what she did yesterday.  She can't answer and he asks impatiently, \"What about the day before that?\"  Casey objects to his badgering, but is overruled when Zierko insists that he's asking simple questions.  If she can't handle them, \"what'll it be like at trial?\"  He asks Katie what time her mother was attacked.  She recalls that she was in her nightgown and guesses it was bedtime.  Zierko tells her she was wrong, that it was much later.  He asks if she saw that attacker's face, and she said she was under the bed.  He asks if she had met Alex Parven before and she says yes.  Quickly he asks why she didn't tell anyone he had hurt her mother.  Katie tells him, \"You're upsetting me.  Go away!\"  Talking faster, Zierko asks, \"Didn't the police ask you over and over who did it?\"  Elliot has to take a deep breath as Zierko continues, insisting, \"Katie, tell the truth, it wasn't Alex, was it?  You just want to please Miss Novak, isn't that why you said he did it?\"    Casey objects as Zierko likens the case to another incident where a witness with Williams Syndrome said what the police wanted to hear simply because that is one of the characteristics of the condition.  Casey insists that Katie hasn't changed her story since the beginning, \"Despite counsel's attempt to badger and confuse her.\"  Zierko disbelievingly asks if Casey would \"have us believe that she heard it under a bed, through walls and closed doors.\"  Casey defiantly tells him, \"I can prove that she heard every single word.\"  She hands Petrovsky and Zierko each a sheet of paper and explains that she will ask Katie the three questions that appear on it.  Turning away from her, covering her mouth, and whispering, she asks the three questions.  Each of Katie's answers is consistent with her previous testimony and the evidence the police have:  Alex hurt her mother, he did it because she was hurting her family by having a baby, and her dad told her not to tell anyone about getting money from someone named Mr. Kim so he could go away.  Casey asks who Mr. Kim is.  Elliot leans forward, very interested in her answer, and Katie says, \"He brings my dad money in a briefcase.  The end.\"     Elliot meets Ben Nicholson at the hospital and tells him that Alex Parven is making a plea agreement and Katie won't have to testify.  He says Ben ought to be relieved \"since Katie won't have to reveal anymore secrets in open court.\"  Ben tells them the FBI owns him now so it doesn't matter anymore.  Elliot says he cut a deal like any thief.  Ben says he had already turned Mr. Kim in; he just kept the money without telling the FBI about it. Elliot comments that it must have been a lot of money for him to take such a risk and asks what he sold.  Ben says it was a prototype for a dispersion system that doesn't work.  Elliot asks how his wife is doing, and Ben corrects him, saying, \"My soon-to-be ex.\"  Ben tells him she is well enough to be discharged, but he doesn't know or care where she is going after she leaves the hospital.  Elliot reminds him that she doesn't remember any of it, and Ben laughs sarcastically, saying, \"Isn't that convenient?\"  Then he goes into Corinne's hospital room to tell Katie it is time to go.  She begins happily pushing her mom's wheelchair out as if they are all going home together, but Ben insists that Corinne is not going home with them.  The episode ends with Ben, tearing a hysterical Katie away from her distraught mother and forcing her into an elevator while Elliot looks on uncomfortably."
    },
    {
      "episode_title": "Impulsive",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/impulsive-1140817/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Avatar",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/avatar-1139937/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": "The episode starts with the disturbing image of a young woman being raped in bed.  She struggles with her attacker, they fall out of the bed with her on top, she smashes him in the head with a glass and runs to another room.  She blocks the door with a cabinet, finds a phone, and calls 911.  As the operator assures her that the police are on their way, the attacker is heard pounding on the door and shouting for her to open it and the girl is leaning against the cabinet struggling to keep the door shut.  As the scene closes, the 911 operator asks if the attacker is still in the apartment and she replies, \"Yes. He's my sister's boyfriend.\"At the scene, Benson and Stabler take the girl's statement.  Christie McGarrett describes a fairly normal evening where she and her sister, Rachael, and Rachel's boyfriend, Dan, had dinner, talked for a while, and went to bed around ten.  Rachel and Dan took the bedroom, and Christie slept on the couch.  Then Christie woke up with Dan on top of her.  Christie pleads with them to let her speak to her sister, but before they can respond, a CSU tech interrupts and insists that they come with her immediately.Leading them to the bedroom, she says, \"Rachel's gone.\"  Benson asks, \"Where?  You don't usually go for a walk after your sister's been raped.\"  There is blood spatter on the bed and on the floor by the window, and there are no fingerprints to be found leading to the conclusion that she has been abducted.  Looking at a photograph of a happy young couple on a tropical beach, Elliot suggests that they talk to the boyfriend.Dan is in the bathroom having his head wound treated when Benson and Stabler come to question him.  They ask where Rachel is, and he says he doesn't remember.  Stabler asks if the blow to the head gave him amnesia and Benson insists that there's no way he could forget raping his girlfriend's little sister.  Dan acts surprised, and Stabler suggests that a trip to the precinct will help him remember.  He says they wouldn't believe him if he told them what happened and then claims to have assaulted Christie in his sleep.In the interrogation room, Stabler suggests that Dan and Rachel had a fight, Dan killed her and dumped the body, and was trying to kill Christie because she was the only one who could identify him.  Dan insists that he cannot remember what happened and that he has a condition.  Elliot interrupts him saying he has a headache, at which point Dan's lawyer shows up to explain that he suffers from arousal parasomnia, a sleep disorder which causes him to have sex in his sleep.  Dan insists that Rachel knows about it and tells him it's the best sex she's ever had.While Stabler continues talking with Dan, Benson interviews Christie.  Christie tells her she met Dan for the first time the previous day, that she was in town visiting and looking at colleges, and that Rachel said she was in love with Dan.  Christie wonders how Dan could do something like this.  Back in interrogation, Stabler asks Dan why he would rape Christie if Rachel loves his 'sleep sexing' so much.  Dan explains that he must have attacked Christie in his sleep because Rachel wasn't there.  He woke up when Christie cut him with the glass, and when he went to tell Rachel what had happened, she was gone.Dan's lawyer insists that they can't charge Dan with a rape he didn't know he was committing.  In the observation room, Novak confirms the defense attorney's analysis.  Stabler says, \"If it looks like a rape and acts like a rape.\"  Novak agrees, \"It is a rape.  Unless the accused isn't conscious of what his body's doing.\"  She likens the attack to a sleeping mother who rolls over and kills her baby, her body did it, but her brain didn't know about it.  Benson points out that the sexsomnia still doesn't explain what happened to Rachel, but Huang says that it does.  He explains that a patient with sexsomnia will have sex with whoever is available.  Dan probably had sex with Christie because Rachel was already gone. Benson says it sounds like a cover-up for murdering Rachel and dumping her body.  Novak tells her there has never been a homicide linked to sexsomnia.  Stabler seconds Benson's concerns.  Huang tells him that if Rachel was in love with Dan she probably wouldn't have left on her own and he thinks Rachel was kidnapped.  As they walk through the squad room, Benson asks Christie if Rachel had mentioned any problems with anyone.  Christie says no and that her sister would have told her if there were.  Exiting the squad room, they encounter Dan and Elliot.  Dan tried to explain and says he never meant to hurt her.  Christie screams at him to shut up, nothing he can say will bring Rachel back.  Christie's father appears around the corner, and upon confirming that Dan was the guy who raped his daughter, he tackles him and punches him in the face.  Stabler pulls him off of Dan and as he helps Dan up, Benson explains that they don't think Dan was involved in the kidnapping and they can't arrest him for the rape because he was unaware of his actions.  She assures Mr. McGarrett that they are working around the clock to find Rachel, and he says, \"Good, because so far all you have done is hide behind the law.\"In the crime lab, the CSU tech shows Benson DNA results that confirm the blood on the bed and by the window was Dan's.  Benson is encouraged that at least they know Rachel wasn't hurt badly.  Unfortunately, the tech informs her that the kidnapper didn't leave a shred of forensic evidence.  Benson gets a text from Cragen to turn on channel four, and she and the tech tune into a press conference where Mr. McGarrett calls the squad incompetent for not arresting Dan and offers a $50,000 reward for information leading them to Rachel's safe return.  He urges people to call the SVU tip line and the cut to the squad fielding calls.Fin gets a call from a woman who says she saw Rachel in Times Square and wants the reward in small bills.  Cragen complains, \"A reward offer brings out all kinds of crazies.\"  Benson grumbles about, \"One bogus lead after the next,\" and sends another detective to check something out.  Lake shouts, \"Maybe not!\"  The group gathers round Lake's speaker phone and he asks the caller, Ginger Maxon, to tell them what she just told him.  Ginger says, \"I think Rachel's in another universe.\"At Ginger's loft, she explains to Lake and Benson that Another Youniverse (AY) is a virtual reality game that she and Rachel play online all the time.  When Lake asks if that is where she and Rachel met, Ginger says they know each other from art school.  Ginger introduces them to her VR avatar, Tawny Coppercuffs, and soon becomes absorbed in her game as she gives them a quick tour from her online diary.  She shows them a scene where she and Rachel, as her avatar Vixy Platinum, were hanging out at the virtual pool.  Lake comments that the avatars' names sound like a couple of hookers and she explains that they own virtual sex clubs in AY.   Benson is mystified that Rachel and Ginger would choose to be prostitutes, and Ginger explains that it is a fantasy, not a crime, and that it is safe.  They have sex for money with no risk of STDs and they aren't hurting anybody.  Ginger takes them to Rachel/Vixy's club, Vixy Platinum's Underage Wonderstage, and there are numerous male avatars standing around with signs asking \"Where's Vixy?\" shouting \"Vixy, come back.\"  Ginger explains that these are Rachel/Vixy's fans.  She performs every day at two, but she skipped her performance today and her fans miss her already.  Benson comments that Vixy looks like a kid while Rachel is in her twenties.  Ginger reminds her that in AY you can be any age you want.  Lake notes that you can also be any age your customers want.  Benson and Lake conclude that virtual sex wasn't enough for one of Vixy's customers, so he kidnapped her.Back in the squad room, Benson and Lake explain AY to Cragen.  He comments that it is \"like an online version of the Wild West,\" and Stabler approaches saying, \"With its own sheriff.\"  He hands Cragen a printout about Eric Winton, the game's designer.  Benson realizes that he would have access to all the Avatars' personal information.Benson and Stabler go to AY headquarters and Winton is eager to help them.  She shows them Vixy's club, and all the customers have already moved on.  So he calls up a screen cap from earlier, and then shows them a map of the world that shows her customers' homes all across the globe.  Benson asks how the avatars communicate, and Winton shows Vixy's blog.  The last entry, posted twelve hours before Rachel disappeared, was titled \"Stalker.\"  Vixy was afraid that she had a virtual stalker who had started coming after her in the real world, and she warned other women in the game to stay away from a male avatar named Wit Billions, who wears an executioner's mask.  Winton tells them that only one of Vixy's regular customers was not present at the vigil at her club and Benson correctly guesses that it was Wit Billions.  Winton brings up Billions's personal information and it leads them to a New York man named Tobin Willis.Fin and Lake question Willis.  Lake shows him that his name is an anagram for the avatar Wit Billions.  He denies ever playing the game, but Lake shows him the credit card records that seem to prove he is lying.  He insists someone must have stolen his card and opened an account in his name.  Fin says they'll check out his story when the computer techs search his computer.  Meanwhile, Benson and Stabler search Willis's apartment and find numerous books about executioners.  In one of them is an image of a head chopper who looks very much like Wit Billions.  Returning to the interrogation room, Benson shows him the book and tells him, \"Your sick obsession with an avatar made you kidnap its creator last night.  Willis tells them he was at Shea Stadium last night.  The game went into extra innings and it was after midnight until he got home.  He saw himself on the Jumbotron a dozen times.  The alibi checks out, and at the same time, Lake arrives to report that there was nothing on his computer.  Fin thinks he is playing the game from untraceable internet café's.  Cragen thinks he's too smart, and Benson suggests he's working with a partner.  They return to AY headquarters, and Winton helps them locate his partner by searching for all the avatars Wit Billions met with two, then three, and finally four or more times.  Vixy and a male avatar named Smarty Culottes are the only avatars Billions met with four or more times.  Smarty has to be his partner.  Winton accesses Smarty's personal information and it leads to a man named Nestor Buchanan, who works at Cooper's Rare Books, a shop that Lake frequents.  When Benson and Lake arrive at the bookstore, the owner, Julian Cooper offers him an early edition of The Sun Also Rises.  Chester says he isn't interested and flashes his badge, asking for Nestor.  Cooper takes them to the back where they find Nestor, Cooper's assistant, frantically tapping away at the keyboard.  Nestor is so engrossed in what he is doing that he refuses to stop even when Lake identifies himself as a police officer and asks him to stand up.  They have to pull the keyboard away from him.  Benson asks him where Rachel is and he denies knowing her.  Lake sees on the screen that he is playing AY.  Benson asks about Rachel again and Nestor denies knowing her, so she arrests him.When Benson and Fin show Nestor the screen caps from Smarty's encounters with Wit Billions, Nestor says he never knew his real name or location.  Fin takes him into the observation room where he can see Tobin Willis through the glass.  Nestor recognizes him from the bookstore, but says he has never talked to him about AY.  When asked who he did discuss the game with, he mentions, among others, his boss, Julian Cooper.  Fin sends Nestor back into the other interrogation room so that he and Benson can discuss the new information.  They reason that Cooper stole Willis's credit card information from the store's records to set up Wit Billion's account in Willis's name then hung out with Smarty in the game to make it look like Willis and Nestor were working together.  Lake and Benson break into the bookstore to find that the Cooper and the computer are gone but he left a key behind.  The key leads them to a storage unit where they find more books and a typed note reading, \"It's not what you think.  Leave us in peace.\"  Benson calls Novak for a warrant to search Cooper's apartment.  She and Lake find that he took the computer from there, too.  The CSU tech says she lifted some latent prints all belonging to cooper and that it doesn't look like a woman was being held there.  Benson spots a photograph on the wall of a young girl who looks just like Vixy Platinum.  On the back of the photograph, they find a to-do list that includes buying medications and transferring $5,000 in AY funds to someone named J.T.  There is a phone number beside the name, so Lake calls J.T. and reaches Jessie Taylor Realty.The realtor tells Benson and Lake that they have no record of doing business with Julian Cooper or Nestor Buchanan, but she did rent a warehouse to Tobin Willis two weeks ago.  They never met because he handled everything on the computer or over the phone and she can't ID his voice because she talks to so many people every day in her work.  He paid the rent by money order six months in advance.  She also remembers, \"He wanted something in a deserted area, like a cabin in the woods.\"She lets Benson and Lake into the warehouse where the find Rachel blindfolded, gagged, and tied to a bed, alive but barely breathing.  Benson calls for an ambulance and then helps Lake to until Rachel.  As Lake discovers suitcases and realizes that Cooper was about to move her, he hears an engine start.  He runs after the car but can't get the license number.  When he returns, Olivia tells him the drugs at still there on a tray in the corner.At Mercy General Hospital, Rachel's doctor tells them the drugs could have knocked Rachel out \"or at least kept her semiconscious depending on the combined dosage.\"  She allows them five minutes to question Rachel, but she can't identify her kidnapper because he wore a mask.  She remembers being injected in the neck and trying to scream, but he put his hand over her mouth.  She passed out, woke up tied to a bed, and he raped her.  He told her he wanted to take her to a cabin in the woods.Back at the squad room, Benson reports that the rape kit was negative for DNA and there were no prints at the warehouse.  Stabler alerted the authorities to watch for Cooper, and Cragen says he won't get far.  Lake says that \"maybe Gregory Searle will,\" and explains that Cooper's prints matched Searle's and that twenty-five years ago he was convicted of kidnapping a girl in Duchess County.  The girl's name was Lauren Mobley, and she is the girl in the photo they took from Cooper's apartment.  When Benson and Stabler meet with Novak, they learn that Lauren was never found and the Duchess County DA is convinced Cooper/Searle killed her.  They arrested him on kidnapping because they found strands of Lauren's hair in his pickup and he got twenty years with no possibility for parole.  Stabler receives a call that Cooper has been found at a bus terminal in Queens and Fin and Lake are on their way to arrest him.  Cooper is found loading his bags onto the 10:15 bus to Montreal.  They take him into custody and he says he'll be back in time to take the 2:40 bus instead.  Lake says, \"We'll see if you're so cocky after Rachel McGarrett IDs your voice.\"  They arrive at the hospital to find Rachel has gone into respiratory arrest and died.  Cooper expresses his sympathies and says he has a bus to catch.  Benson shoves him and the scene cuts to her pushing him into a chair in interrogation.Cooper insists he didn't kill Rachel and Nestor must have.  Nestor had access to the credit card records and he plays the game.  When Stabler presents him with the to-do list found in his apartment, he says Nestor has a key and must have planted it.  He also says Nestor handles the inventory for the book shop and he must have been the one to leave the note at the storage locker.  He doesn't deny kidnapping Lauren Mobley but says he paid his debt to society and changed in prison.  He found solace in books when he took over the prison library.  He changed his name and opened the book store when he got out of prison because he wanted a fresh start.In the observation room, Stabler worries that Cooper is getting away with two murders.  Novak doesn't understand why he kidnapped Rachel when it was Vixy, the avatar, which looked like Lauren, his first victim.  Huang explains that in Cooper's mind, since Rachel created Vixy, raping Lauren was the same as having sex with Vixy.  Benson reasons that Cooper found Rachel by paying a hacker to trace her IP address back to her apartment.  \"Probably's not enough to get a conviction,\" Novak reminds her and since Cooper has been through the system, he knows that.  Stabler says they have to get a confession or he walks.  Huang tells them to use Lauren to get him to talk about Rachel because the two girls are the same in his mind.  Cooper claims he rescued Lauren from an alcoholic mother and an abusive father and that they were in love.  He drove ever other day to see her, and he told her she could leave but she chose to stay with him.  He was arrested the next day.  When Stabler tries to divert the conversation to Rachel, Cooper stops talking and leaves the precinct.  Novak says if they can find Lauren's body they can charge him with her murder and they can use the crimes upstate as precedent in a case for Rachel's kidnapping and murder.  Stabler says they needed the body \"yesterday,\" and Benson realizes the cabin and the location of Lauren's body might be in the game.  Novak says if they use the AY game to find Lauren's body Cooper won't stand a chance in court.  Cragen send Benson back to AY headquarters where she works with Winton to find the cabin and has Stabler tail Cooper until they Lauren's find the body.  They find the cabin in the game, and there is an avatar sleeping on the bed.  A name plate on the headboard reads \"Lauren.\"  It is a programmable avatar Cooper bought for his own use in the game.  Winton runs a software program to compare the lake in the game with a topographical map of New York State while Cragen sends Fin and Lake Upstate to search for it.  Elliot confronts Cooper when he stops for a cup of coffee.  Cooper again denies killing either of the girls and says they won't find his cabin in the game.  The software identifies the lake as Twin Island Lake.  Benson notifies Fin who calls ahead to the authorities in Duchess County while Stabler informs them that Cooper is on the Grand Central Parkway.  Fin supposes he is headed for the International Terminal at Kennedy International Airport.They can't find any landmarks in the game to tell them exactly where on the shore of the lake they can find the real cabin because it was designed with a safety catch that makes it disappear when anyone moves up to a bird's eye-view.  Benson wonders if there is another way to determine the cabin's location, and Winton says sunlight.  The game runs on Eastern Standard Time, and when the sun rises they will know which side of the lake the cabin is on.  Benson tells him to turn on the sun, but he is reluctant to do so because it has never been done before in the game.  Fin tells Benson the lake is huge and the Duchess County cops don't know where to start their search.  She urges Winton again to turn on the sun.  Stabler reports that Cooper is arriving at the terminal and, \"It's now or never.\"Fretting that he is \"about to seriously freak out five million people,\" Winton turns on the sun.  The sun rises behind the cabin, illuminating the lake.  Benson tells Fin it's on the East shore of the lake.  The scene fades to a real world cabin identical to the one in the game.  A young woman emerges from the cabin pointing a shotgun at Fin and telling him to \"Stop right there.\"  He tells her it is Gregory Searle's cabin and asks who she is.  She identifies herself as Lauren and says she has been waiting for Gregory for twenty-five years.  Lake informs Cragen of what they have found.  Stabler asks if it is a joke, and Cragen says no, the case is over.  Without a body they have no excuse to arrest Cooper.  Then Stabler sees Cooper cross against the light and arrests him for it.Benson and Stabler interview Lauren who confirms Cooper's story about her parents and says she didn't come forward at Searle's trial because the authorities would have sent her back to her abusive home.  She got a job waiting tables at a diner in town and waited for Searle's to get out of jail and come back to her.  It was fifty miles from her hometown and no one was looking for her there, so she lived undiscovered all that time.  She doesn't believe Benson and Stabler when they tell her about what Cooper did to Rachel.  When they let her see him, she is overjoyed and crosses the room to embrace him, but he withdraws from her asking, \"What happened to you?  You got so old.\"  Her illusions shattered with the revelation that the love of her life is nothing more than a pedophile, Lauren tells him he's sick and asks what he did to Rachel.  He says he rescued her, just like he did Lauren.  Lauren says he kidnapped her because she reminded him of Lauren.  He admits that her avatar did, but Rachel didn't love him.  Lauren says she loved him, but he tells her it was too late, and she slaps him.  Stabler asked Cooper if he planned to keep Rachel chained to a desk playing AY all day, and he said, \"If that's what it took.  She'd never grow up in a computer.\""
    },
    {
      "episode_title": "Alternate",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/alternate-1130000/recap",
      "nth_season": 9,
      "source": "http://www.tv.com",
      "corpus": "As Benson gets off the elevator, Tutuola welcomes her back from her suspension before commenting on her new short hair. She explains that she had too much time on her hands before asking if Cragen is there. He tells her she needs to catch him while she can. After giving him a confused look, she approaches Cragen's door.As she watches him pack a box of personal items from his desk, Benson thanks Cragen for pulling the strings he had to for the Brass to allow her to stay at SVU after her suspension hoping it did not cost him too much. Cragen explains he has been temporarily reassigned to the Chief of Detectives office because he failed to supervise: (1) her while she aided her fugitive brother, (2) Stabler while he covered up Kathleen's DUI, and (3) Tutuola while his step-son got away with a double murder.When they join Tutuola, Munch, and Stabler in the bullpen, Stabler informs her the Brass put Munch in charge. Munch tells them he will not do it. Tutuola calls his bluff stating that Munch had taken the Sergeant's Exam without telling anyone. Munch claims he took the exam on a bar bet. Cragen drops the keys to the office on Munch's desk with a warning not to let the power go to his head. When he turns to leave, Lake comments on serving under Cragen and is reminded that Cragen is not dead yet. Stabler assures Cragen they will get him back. Cragen asks that they all try to behave themselves. Before they can spend too much time sulking, Dr. Anna Young arrives to report a possible case of child abuse. As Benson shows her to a seat on her side of the desk, Stabler gets up from his chair telling Sgt. Munch that they have it. Dr. Young explains she is Janis Donovan's psychiatrist. Janis called her while giving her daughter April a bath stating that she scrubbed as hard as she could and still could not get \"the filthy slut clean.\" She gives them Janis's address and her card with a request to call her when they know something.At Janis's apartment, Benson and Stabler search for Janis and April. Benson finds an empty crib, but Stabler finds a doll face down in a tub of water. Janis's neighbor Bev, carrying her son, interrupts their search to find out what is going on. After they introduce themselves, Bev explains Janis moved in after her son was born, but she does not do play dates. Benson finds a picture of Dr. Young and April. Bev informs her the woman in the picture is Janis, not Dr. Young.In the squad room on a speaker phone with them, Munch, Lake, and Tutuola inform Benson and Stabler the woman's license is issued to Janis Donovan. When Munch tries to claim he knew something was not right about her, Tutuola asks if superpowers came with his promotion. Munch explains \"Anna\" came from \"Anna Freud\" and \"Young\" came from \"Carl Young\". Lake notes that according to Janis's license, she does not wear glasses. Benson wonders why Janis sent them directly to her apartment. Munch dismisses it as Janis trying to get their attention and tries to close the case, but Benson reminds him about April. Stabler warns Munch they are searching the apartment, but Munch tells him not to without a warrant. Stabler reminds him there is no sign of foul play so they would not be able to get a warrant. Benson believes the fact Janis reporting herself should be enough probable cause to allow them to search the apartment. As Benson explains the only thing the neighbors know about Janis is that she is painfully shy, she remembers Janis gave her a business card. When she asks them to check it, the apartment phone rings. Lake runs the address off of the card and locates Dr. Henry Carlisle, a psychoanalyst.When Benson and Stabler ask Dr. Carlisle if Janis is a patient, he verifies it by claiming doctor-patient privilege. They explain they fear for the safety of April asking for his help in finding her. He does not feel she is a danger to herself or others so he cannot talk. Benson tells him Dr. Young told them he is treating Janis for post-partum depression. Stabler points out Janis was wearing glasses like Carlisle's when she came to the office. Carlisle dismisses her visit to their office claiming it does not make her violent. When Stabler asks about scrubbing April raw and calling her a \"filthy slut\", Dr. Carlisle states, \"That's not good.\" Benson threatens him if the baby is harmed and he does not help them. He tells them she works at a museum and he has an emergency contact of Penny Taylor.Penny informs Benson and Stabler that she was fired for unknown reasons and Janis made sure she would never get another babysitting job. Janis would drop April off at 8 and was suppose to return by 6 to pick her up, but would not show until 10 and claim she was on time and Penny was trying to play tricks on her. When Benson asks if she thinks Janis would hurt April, Penny explains Janis threw April's bottle at her when April spit up and claimed Penny fed her hot sauce.In the squad room, Tutuola is informed April's most recent babysitter never heard Janis raise her voice in the 3 weeks she had been working for her. She does not know why Janis did not show up with April that morning, but she called to check on her. A Russian woman named Petra answered claiming Janis was not there. The only place she thinks Janis would be is at work at the Museum of Natural History.At the Museum of Natural History, Benson and Stabler are informed that Janis is an arachnologist. She keeps to herself. When Benson asks about Janis's absence from work, they are told she milks spiders for the venom so she is out in the field looking for more spiders. When the explanation begins on how and why spiders are milked, Benson interrupts stating they just need to find Janis. They are given a list of Janis's hot spots.At the Prince of Peace Church, Benson and Stabler are told Janis has been coming once a week since Reverend Ferguson returned from a trip to Africa where the spiders had gotten into his suitcase. She was there the day prior. When they ask if she knows where Janis is, they are told Janis had a heated discussion with herself about it. One side stating she was running away from home and the other trying to talk her out of it. Benson excuses herself to answer her cell while Stabler is told Janis sounded like she was possessed, but she was sane when she was last seen. Benson informs Stabler Munch was on the phone to tell them Janis's car has Lojack and is heading north on the Westside Highway.When Lake and Tutuola locate the car at Inwood Hill Park, Tutuola informs Sgt. Munch. Lake notices a woman with a hoodie covering her face walking with a stroller, but Tutuola approaches her and finds it is not her. He asks Benson and Stabler if they found anything inside the park. While Benson tells him they have not, Stabler locates a cave for them to search. Inside the cave, they find several jars containing spiders sitting beside a lantern proving she has been there. As they make their way in a little farther, they see Janis sitting on the ground and a car seat close by her. Benson has her put her hands up while Stabler checks the empty car seat. After Benson asks Janis about the baby, she is told her name is not Janis and she is not big enough to have a baby.In the interrogation room, Stabler informs Janis she is not going home until she tells them April's current location. Janis claims she is 6-year-old Tammy. Benson tries to remind her if April is outside she is probably hungry, cold, and scared so she needs to Janis's help to find her. She agrees to help, but is scared Burt will hurt her if she tells, but Benson assures her she will not let anyone hurt her. Once she feels safe, she tells them Burt took April, but she does not know where. Stabler has had enough and shows her the picture of Janis and April. He believes she could not handle motherhood so she abandoned her leaving her to die, but adds if she dies Janis will go to prison for murder. Janis gets angry and slaps Stabler. Stabler reminds her she is suppose to be 6, but she does not slap like one. He holds her from the front while Benson holds her hands behind her back. Janis tells him to get out of her face and demands a lawyer in a Russian accent. As they cuff her, Stabler informs her she is being charged with assaulting a police officer. Janis tells him to grow some balls if he cannot take a slap.Watching the scene play out, Tutuola informs Munch the Russian must be Petra, the lady that answered the babysitter's phone call. Munch tells him he has to get Benson and Stabler out of the room and get Janis a lawyer. Tutuola offers to call Huang to bring the butterfly net.In the squad room, Huang believes Janis has Dissociative Identity Disorder, or multiple personalities. Stabler does not believe in the disorder. Huang informs them psychiatrists cannot agree on its existence. He believes it is over diagnosed, but the cases he has seen are the result of prolonged child sexual abuse. Stabler tells him they do not know if she was abused, but wonders if it will help find April. Huang thinks it may so he needs to know about the alternate personalities. Benson tells him they have seen a shrink, a little girl, and a tough Russian. Stabler believes she is acting. Huang explains that when a child is being repeatedly abused she can escape and believe it is happening to someone else. The personalities are formed as needed to help deal with the trauma. Stabler wants him to trick Janis into telling them where April is, but Huang explains the host personality rarely knows about the alternates or their actions. Benson tells him Tammy was about to tell her where Burt took April when Petra showed up and slapped Stabler. Stabler adds he would like 5 minutes with Burt and asks how to get to him. Huang informs them the alternates are brought out with stress so they need to find the right trigger. Munch shows up dressed in uniform stating a press conference is their last option, but Stabler corrects him stating Huang has an idea to get her to talk. Huang wants to hypnotize her, but Munch tells him he cannot talk to her. Stabler informs Munch that he is not taking orders from him even if they crown him Chief of Detectives. Munch explains they cannot talk to Janis because her lawyer is already there. Benson reminds him they can talk to the lawyer. As they walk away, Munch tells them to tune it at 11 because everyone that has ever seen April will be calling.When Benson returns to the Interrogation Room, Heshy Horowitz is advising Janis to reconsider discontinuing his service. Janis asks Benson to identify herself. After she does, Janis introduces herself as Dori and asks that she tell Horowitz that she does not need him because she did nothing wrong. Benson believes she has changed her mind, but Horowitz does not believe she is competent. When Janis tries to fire him, Horowitz explains that since she invoked her right to counsel he is her lawyer until she legally waives the right.  Benson excuses herself to obtain the proper form, Huang, and Stabler in the next room. When she signs it \"Dori Johnson,\" Horowitz tells her that she signed it with the wrong name. She insists it is her name. Stabler leans in and tells her if she wants to get rid of the lawyer she has to sign the form \"Janis Donovan\" before he winks at her. She willingly signs it. When Stabler shows Horowitz the form, he tells Janis to call him when she changes one of her minds. When Huang introduces himself, she tells him she already has a shrink before turning to ask Stabler where his gun is. Stabler tells her it is in his locker. She asks to see it, but he wants to know where April is first. She tells him that if she knew she would tell him. She turns her attention to Huang to inform him she does not know why she is in therapy. She has been hypnotized, but refuses to allow him to do so for fear that Dr. Carlisle will not like it. Stabler tries to get her to do it for him, but she refuses saying she does not want to go away because she feels safe here. Huang tells Benson to get her shrink here while he keeps trying because he would know how to reach Burt.As Benson escorts Dr. Carlisle to Janis, he claims Janis's alters are not violent. She tells him Petra slapped Stabler, but he thinks Janis felt extremely threatened since Petra is her protector. Tutuola interrupts them stating he hopes April is not out in the storm because they have come up empty. Lake informs her the choppers used infrared on the park and they have not found anything. Benson informs them they are still working on Janis and asks them to catch Munch.Tutuola and Lake join Novak in the squad room to view Munch's press conference. Munch informs the press they are looking for a one-year-old that was last seen with her mother Janis Donovan. He announces a $10,000 reward for information and asks they call a hotline number to Special Victims. While he is talking, Lake comments that he looks good earning himself a dirty look from Tutuola. As soon as Munch finishes talking, the phones start ringing. Tutuola answers the first one only to have to explain April is Caucasian. Novak announces \"The circus begins.\"In the Interrogation Room, Dr. Carlisle has hypnotized Janis with Benson and Stabler observing through the window. Dr. Carlisle raises her hand and tells her when he taps her shoulder she will be wide awake, refreshed, and perfectly calm. Janis tells him April is at the babysitters, but she does not remember taking her there. She remembers giving April a bath and then searching the cave for spiders. Stabler thinks Janis killed April. Dr. Carlisle has Janis allow them to talk to Burt. When he comes through, Janis picks up the chair and throws it at the window causing Huang to call for assistance. While Benson and Stabler cuff her, Burt tells them they will never see April again. Dr. Carlisle touches her shoulder bringing Janis back trying to figure out what is going on.In the squad room, Lake informs everyone a gas station attendant outside Philly saw Janis with April using cash that morning. Tutuola tells them a waitress at an IHOP in Reno is serving her pancakes now. Stabler tells Lake to have Philly follow up with the gas station attendant since Janis worked at Penn last year. When Munch arrives, Benson informs him Dr. Carlisle has had Janis bouncing around personalities for hours and Burt is not talking. They are interrupted when Cass Magnall walks in informing them April is fine and has been with her all day. She adds she is April's mother.In the interview room, Cass informs Lake and Stabler that she is Janis's sister. Janis had been watching April for her. They do not understand why no one knew Janis was not April's real mother or that she had a sister. Cass explains Janis moved there after April was born and she had went to prison.In the interrogation room, Janis tells Benson that she does not have a sister. When she mentions she believes it would have come up during therapy, Benson realizes she is talking to Dr. Young. When Benson tells her she needs to talk to Janis, she is told she does not know where she is.In the interview room, Cass asks to speak with Janis so she can vouch for who she is. Stabler doubts that considering Janis does not even know who she is herself. When she claims she does not know what is wrong with Janis considering she was fine that morning, Stabler asks about her incarceration. She admits she bought heroin from a narc when she was 8 months pregnant and got out the day prior. Lake implies the reward would come in handy right now causing Cass suggests he call her landlady to verify April is with her.Munch joins Benson and Janis in the interrogation room with a copy of Janis's license. After briefly searching for her glasses, she states it looks like Janis's driver's license. Benson asks her to step around the table to the mirror and asks who is there. Janis admits it is Benson and Janis, but believes they are playing tricks instead of allowing her image in the mirror. When that does not work, Munch shows her a picture of Cass. She denies knowing who it is causing him to suggest a stroll down memory lane.Stabler asks Cass if there is any truth to Huang's thought that Janis was abused as a child. Cass grabs her purse and holds it while claiming not to know anything about Janis's abuse. Janis left home when Cass was 6. She admits being abused, but denies telling Janis because she was not there to protect her. The night Janis left, her father pulled her around the house by her hair wanting to know where Janis went. When she did not know, he forced her to drink hot sauce until she threw up. Her mother was in the room watching, but did not say a word, even when he began raping her. She begged her mother to help her, but no one ever did. While watching from the window in Cragen's office, Janis tells Munch to turn off the speaker. He does and pulls the blinds. She questions how Janis could do something like that when she knew it would happen. She claims it happened to Janis stating she would never have left Cass because she would have told someone. Munch offers to get her a tissue leaving her alone.As Munch gets the tissue, Benson informs him Tutuola just called stating April was where Cass said safe and sound. Munch realizes his press conference was unnecessary so he announces the calls are no longer needed. Munch tells Benson to ask Carlisle what to do about Janis.Upon returning to the office, Munch catches Janis looking at a file. She claims she was trying to figure out where she was. Benson realizes they are talking to Janis and introduces herself again. Janis believes she is there collecting specimens. When Munch tries to correct her she points out he has a \"Daddy Long Legs\" on his file cabinet. He comments on Cragen leaving him 3 months of paperwork and spiders. Janis takes the opportunity to inform him that he is never more than 6 feet from a spider. Cass interrupts them stating they need to talk. When Cass asks if she can take Janis home, Benson informs her that she needs to check with someone first.Upstairs, Huang tells Dr. Carlisle that sending Janis home is a crap shoot. Dr. Carlisle believes she had an extremely stressful day and is not violent. When Benson reminds him he has been treating her 5 personalities for a year, Carlisle informs her they are all functional so they have no grounds to commit her. He believes she is on the road to recovery, especially since she is developing a relationship with her sister. He believes Cass can help her face the abuse and integrate her personalities. He tells them to let Janis go home with Cass.At the Stabler residence, Kathleen comes into her parents' bedroom yelling for Stabler while he is trying to sleep. When he asks her what time it is, she calls him lazy before telling him it is 9. Carrying a basket of laundry into the room, Kathy urges her to let Stabler sleep since he worked all night. Stabler notices the basket and tells her he will take care of it since she should not be lifting things. Kathleen states she should not be pregnant because she is too old and people will think it is hers. Returning to the task at hand, she informs Stabler her classmates saw her picking up trash in her orange vest. He reminds her she cannot go against the judge's orders. Kathy reminds her she could have gotten jail time. Kathleen insists she is not trying to get out of the punishment, she just wants it moved indoors so no one will see her. She is interrupted by his cell phone.Benson and Stabler arrive at the Donovan residence to Warner wondering why they were called since there is no evidence of a sex crime. Francis and Molly Donovan are the victims. They explain they met their daughters the day before. Both victims were shot in the chest and the murder weapon was left. Stabler notes Molly was killed in her sleep, but Francis woke up to see the killer before being killed. Warner informs them they have a bloody fingerprint on the door. Benson informs her the perp is Janis Donovan before telling Stabler they should have had Janis committed. They are interrupted by Stabler's phone ringing. He tells Kathy it is not a good time, but she tells him Janis is at their house with a knife. He tells her to get out of the house.At the Stabler residence, a uniform officer tells Stabler Kathy is still inside adding Dori insisted on speaking with both of them. Looking through the window, he sees Dori sitting in his living room holding a knife across from Kathy.Janis tells Kathy that it was love at first sight for she and Stabler. He knelt down, whispered to her, and winked. There was electricity. She pauses when Stabler enters. Kathy calmly greets him stating \"Dori\" was just talking about him. Stabler asks \"Dori\" what is going on. She tells him she wanted to see him again. Kathy tells him \"Dori\" was upset and wanted to hurt herself. When \"Dori\" tries to verify Kathy is his wife, Stabler asks how she found out where he lives. \"Dori\" explains she read his file when Munch left her alone in the office. Stabler calmly tells Kathy to leave. She tells \"Dori\" to take care of herself before telling Stabler to do the same and leaving. \"Dori\" comments on Kathy's weight. He tells her to put the knife down on the coffee table, but she stands up wondering why he wants it. He tells her he does not want her to hurt herself as Benson sneaks up behind her. She claims she needs it in case Burt comes after her. He assures her he will protect her, but she does not believe him. When she explains he killed Janis's parents, Benson grabs her from behind. While \"Dori\" screams for Stabler saying Burt has her, Benson and Stabler disarm her safely.At Grellman Psychiatric Hospital, Benson informs Novak she does not believe Janis is competent to stand trial. Novak reminds her that Janis confessed to killing her parents in cold blood. Stabler reminds her that Burt is the one that killed her parents. Benson adds that Dori was the one that flipped on Burt. Novak reminds them they are all the same person and she does not care how many names she goes by she is putting her body in jail. When Dr. Carlisle joins them, Benson comments on how bumpy her road to recovery got. He admits he should have spent more time drawing out Burt, but he did not believe any of her personalities were violent. He does not believe her psyche could handle a trial right now because he has never had to medicate her to bring her back. Novak does not have confidence in his professional opinion so she is ordering a 7-30 exam.In the squad room, Lake tells Tutuola that even though he saw crazies in Brooklyn, but Manhattan SVU is a cuckoo magnet. Tutuola tells him he should have been there for the case when the white supremacist shot Munch adding he still has to sit on a special pillow. Lake draws attention to Cragen approaching with his box. He verifies he is back stating it helped when Sgt. Munch released a maniac that promptly killed her parents. Tutuola informs him the judge ruled she was competent to stand trial.When Cragen enters his office he asks Munch if he missed him. Munch tells him he is glad he is back adding he does not want the job. Cragen happily informs him he is relieved of his CO duties. Munch updates him stating Stabler and Benson searched the Donovan residence and found photos confirming the abuse. Nova tried to plead her out since the jury would have sympathy on her, but Janis refused claiming she is innocent. Cragen states it is up to whatever bogus defense her lawyer can dream up.Horowitz tells The judge that Janis was not at the scene of the crime. Novak disputes this stating her bloody fingerprint was found at the scene. Horowitz clarifies that her body was there, but her mind was not. He explains that she suffers from Dissociative Identity Disorder (DID) and has 5 documented identities. She cannot be held responsible for what her alters did. The judge asks if they should swear in each identity separately. Novak argues they cannot take Janis at her word that she did not know what was going on because then everyone would claim their imaginary friend did things. Horowitz reminds them in US v. Denny-Shaffer, the Appeals Court tore the trial court a new one for not allowing the defense. The judge grants Horowitz's motion.In court, Horowitz has Dr. Carlisle testify to the fact he diagnosed Janis with DID 11 months before the crime and at no time did she know about the alters. Dr. Carlisle claims that when an alter is present, Janis is nonexistent. He claims he brought them out in deep hypnosis, which he had a vested interest in for a book he is writing. He claims the book is because of Janis and not the other way around. The only proof he has that the alters exist is that they have different voices, handwriting, and behavior. Novak claims that since the alters were created to protect Janis then they would lie to protect her for this. Novak wonders what was different that night than over the year he had been treating Janis without any signs of violence. Cass informs Novak that she told Janis about her abuse that night. Janis got a blank look on her face then left. Cass tried calling her name, but she did not respond. Janis claims she does not know Burt. She claims she did not kill her parents. Novak asks what is the last thing she remembers from the night her parents were murdered. She remembers talking to her sister that night, then waking up in the hospital. When she claims it is horrible missing chunks of time, Novak shows her the shotgun used to kill her parents with her fingerprints on it. Janis claims she remembers the gun from her childhood. When she denies remembering shooting her parents, Novak shows her the picture of their bodies lying in bed. When Novak gets in her face, Janis jumps up grabbing her by the throat saying \"leave her alone\" repeatedly causing The judge to call the court officers to get her out of there.Novak arrives at the squad room to Stabler reading the New York Ledger with the headline \"DA FLOPS KILLER WALKS\". She tells him that is one for her scrapbook. Stabler reminds her that it was not an acquittal. Novak adds that she is only in there until she convinces them she is sane. Novak notices a book in the picture as the same one she read while preparing for the case. Using a magnifying glass, she sees the book is from when Cass was in jail deducing Cass was helping Janis with her defense while she was still in jail.Benson and Stabler speak with an ex-cell mate of Cass's at Bedford Hills Correctional Facility about the book. She tells them Janis faked the whole thing and she cannot believe the courts fell for it. Cass allowed her to read all of her letters where they planned the entire thing. She adds Cass read the book Cybil like it was the Bible.At Grellman, Benson and Stabler interrupt Cass's visit with Janis to congratulate her on her performance portraying Tammy, Dr. Young, Petra, Stabler's favorite Dori, and the unforgettable Burt. When she claims she does not know what they are talking about, they inform her their techs were able to restore the research she did on her computer on multiple personalities.  She admits she was good catching them in her web. She feels she is integrated now and can be released soon. When Cass tries to shut her up, Janis reminds her double jeopardy prohibits them from coming after her again. Stabler agrees with her before placing Cass under arrest for the murders. Janis tells them she was not there, but they inform her that since they planned it together they might as well have pulled the trigger together. Janis tries blaming the abuse stating they will never recover from it. They ignore her and leave as she yells to Cass that she is suffering from Better Child Syndrome and it is not her fault."
    }
  ]
}