{
  "episode_recaps": [
    {
      "episode_title": "Shattered",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/shattered-1337937/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Wannabe",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/wannabe-1337936/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Ace",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/ace-1337935/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Torch",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/torch-1337934/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Beef",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/beef-1337950/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Conned",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/conned-1324776/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Bedtime",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/bedtime-1324775/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Disabled",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/disabled-1324774/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Witness",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/witness-1324772/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Lainie arrives at a hospital and claims she has been raped, and Benson and Stabler speak with her. She insists they get in touch with her boyfriend, Jason. When Jason is contacted, he claims he and Lainie only got together once. Stabler notes Lainie is fairly promiscuous and has had a lot of one-night stands. Lainie insists that she was raped, and the only person who stopped to help her was an African-American woman who pulled her attacker off of her.After being shown photos of the tenants in the building, she recognizes the woman who had helped her. The woman is actually a caregiver to one of the older tenants in the building. While talking with Lainie in her apartment, Stabler notices there is a man who is watching Lainie's apartment through a telescope in his window. Stabler tracks the man down. Bryce Kelton matches the man Lainie described as the rapist. He also has a black eye that he received when he was punched by the mysterious Good Samaritan. However, Bryce claims that the sex was consensual. Cabot informs Cragen they need that woman's testimony if they want to send Bryce to prison. The detectives attempt to track down the witness, who has been identified as Nardali. Nardali apparently left her job as caregiver and cannot be located.Meanwhile, Lainie collapses while in court. Cabot and Benson learn that Lainie has flesh-eating bacteria that entered her body from a wound she got during the attack. The condition is fatal and she doesn't have very long to live. Cabot tells Lainie, now in a hospital room, they have to record her testimony before her condition gets worse.Stabler locates Nardali. He learns she is an illegal immigrant from the Republic of Congo, and she fears being deported if found out. Stabler promises nothing will happen if she testifies against Bryce. Cabot tries to convince Nardali to take the witness stand for Lainie's sake. Cabot says she can offer protection for Nardali, but Nardali reveals her past and why she is so reluctant to go to court. In her home country, she and her young daughter were gang-raped by a group of militia. Her daughter had died and her husband threw Nardali out of the house because she had brought shame to his family.Cabot and Benson discuss the case and Nardali, with Cabot believing there should be more aggressive action to help women like Nardali. Nardali agrees to testify, but immigration agents take her into custody afterward. Cabot hurries to the ICE office to argue for Nardali's freedom, but is informed that Nardali's husband is a known terrorist, which means that she might be in the country to cause harm.Cabot talks with Nardali, who says she was forced into marrying her husband and there are many other women in her situation. Nardali's papers are delivered and she is told she is free to go, thanks to some quick calls from D.A. McCoy. Nardali is willing to go to the witness stand once more, but not before the jury watches Lainie's testimony that she made before she passed away.Nardali tells of how she had to drag Bryce off Lainie and she had punched him in the face. However, the defense claims Bryce and Lainie's sex had been consensual and they were enacting a rape fantasy. Despite the defense trying to defame her character by bringing up her past, Nardali sticks to her story and even tells her own story of forced marriage and rape. The jury doesn't find Bryce guilty of murder, but he is guilty of rape and will be put in prison.Benson tells Nardali she is now a permanent U.S. resident with a special visa. Nardali tells Benson she is going back to the Republic of Congo to help other women. Cabot surprises the detectives by confirming that she is taking a leave of absence to develop a task force to give aid to the Congolese women who find themselves in Nardali's condition."
    },
    {
      "episode_title": "Confidential",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/confidential-1311100/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "A woman is seen being dragged into a men's restroom via surveillance camera. SVU is called in to investigate. Richard Morgan, the building owner, arrives on the scene with his attorney, Ingrid Block. Before Cragen can call for a sweep of the building to find the woman, Ingrid stops the investigation. The woman's body is later found in a dumpster. Munch recognizes that he has seen this same MO before -- 20 years earlier with another woman, Nancy Pierce. The perpetrator in that case, Daniel Hardy, is still serving time for the crime.Benson and Stabler speak to Daniel, who claims he is innocent. The victim is identified as Renee Simmons, Richard's former secretary. Daniel claims Renee's ex-husband Matt could be a likely suspect. The detectives locate Matt, but he flees. Benson and Fin capture Matt, who has a stash of marijuana with him, and take him to the station. Matt denies killing Renee and maintains that Richard did it. When told of this, Daniel mentions that Richard was the key witness in Renee's murder trial, who had delivered all the evidence that convicted Daniel.Benson and Stabler discover that Richard had been dating both women. To buy time with the murder investigation, the detectives charge Richard with fraud and embezzlement. Stabler assures Daniel that justice will be served and Richard will be punished.Richard is suddenly gunned down by one of his former clients, who had fallen victim to his money-making scheme. Ingrid witnesses the shooting, but she doesn't say anything to Benson, who is questioning her. Ingrid says lawyer/client confidentiality is still important, and denies knowing anything about Richard's shady dealings. She breaks down and admits she knows Richard killed both women.Ingrid leads the detectives to evidence that exonerates Daniel for Nancy's murder. Daniel is angry when he learns that Ingrid knew he was innocent all along and allowed him to spend 20 years in prison. Daniel is released, but at his hearing, Stabler arrests Ingrid as an accessory to murder. He had worked on his own without approval from Benson, Cragen, or Cabot.At Ingrid's hearing, Stabler mentions how Ingrid allowed an innocent man to go to jail and the defense brings up Victor Tate. Stabler had promised to help Victor get released from prison for a crime he had not committed, but the suicide of the true culprit meant that Victor had to remain incarcerated. Stabler admits this was all his fault. Ingrid says Stabler arrested her because of the guilt over the Tate case.Ingrid takes the stand and insists she had simply honored the oath she made as Richard's attorney, but finally takes responsibility for Renee's murder. Stabler apologizes to Cabot for arresting Ingrid rashly, but Cabot points out that there's nothing else they can do. The jury will probably convict. Stabler also takes Daniel to meet Victor and explain how everyone can make mistakes. Ingrid had been caught up in circumstances she could not control, the same as Stabler in Victor's case.At Ingrid's trial, she points out that the prosecution couldn't provide a link between her and Renee's murder. Judge Donnelly rules on the trial herself and declares Ingrid is not guilty. The detectives find out later that Richard's shooter had been tipped off about his location by Ingrid."
    },
    {
      "episode_title": "Savior",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/savior-1324754/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Detectives Benson and Stabler are called in when a pair of prostitutes are found murdered, both with similar evidence surrounding them. Stabler thinks that Abby (the second victim) wasn't really a prostitute because she lived in an upscale neighborhood and could afford manicures. Abby was putting herself out on the streets to take money in for her drug habit. Her \"john\", Michael, claims that he didn't know either victim. However, Abby's body had evidence of his DNA on it. Michael's wife explains how religion helped him with his life.Michael says that he couldn't get his wife to indulge in his own sexual fantasies, so he started seeing Abby on the side. They were into role-playing, with Abby as a hooker, even going so far as to waiting on the sidewalk for him to stop by. He's vehement that he didn't kill either victim, and then a third prostitute is found with the same prayer card found on the bodies of the victims.Before Benson gets a chance to interview Gladys (the prostitute), she flees. She's found in her aunt's apartment, but doesn't want to say a word about what happened to her or who gave her the prayer card. Benson eventually gets Gladys to tell her story.The suspect, Billy Skaggs, is a religious fanatic who thinks he's saving the women that he murders. Billy is brought in a line-up, with Gladys ready to identify him, but when she spots him, she panics and runs, falling down a flight of stairs. Benson finds her unconscious on the floor, and finds out that she's pregnant. At the hospital, the doctor informs the detectives that Gladys had a concussion but the fetus is going to be fine as long as Gladys has medical supervision.Later, the judge agrees that Billy will be held without bail until his trial. Stabler and Benson tell Gladys this, and she tells them that she's going to keep her baby and change her life for the better. However, Gladys needs to officially identify Billy in a line-up of suspects, so the detectives revisit her aunt's apartment. The aunt confesses that she barred Gladys from staying there because of her risky life Benson finds out that Gladys used the computer just before she left, so the detectives trace where she went thanks to the adult ad she posted.At the address, the detectives find two men who deny seeing Gladys. In the bedroom, Gladys is found unconscious. Later at the hospital, Stabler and Benson find out that Gladys went through a seizure and the doctors had to deliver her baby 4 months premature. There's a good chance that the baby, if she survives, would have severe birth defects. The doctor suggests that they just withhold treatment and allow the baby to die.Gladys wonders whether it was a good idea to keep the baby, but Stabler argues that once the baby is born, the decision is out of Gladys' hands. Cabot tells the detectives that they have to get Gladys to testify, or else they wouldn't have a case against Billy. If Gladys doesn't testify, then she has to be charged with prostitution and arrested. Gladys, now attached to her baby daughter, doesn't want to leave the hospital for any reason, which forces Benson to arrest her.Gladys IDs Billy as the man who attacked her, but Billy's lawyer points out that Gladys never officially identified Billy in the police line up. During the trial, Billy tries to attack Gladys and he's taken back to jail. Afterward, Gladys realizes that the defense's picture of her life as a prostitute was completely true, and that she needs to turn her life around. Cragen gives a note to Benson, written by Gladys, where she says she's leaving to get her life in order and giving Olivia power of attorney over her daughter.Benson rushes to the hospital, where she finds the NICU team performing CPR. The doctor says they need permission to take her to surgery immediately to treat a brain hemorrhage. If they don't, the baby will die, but there's still a risk of brain damage even with the surgery. The screen fades to black as the doctor presses Olivia for her decision."
    },
    {
      "episode_title": "P.C.",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/p-c--1311101/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Detectives Benson and Stabler are called in to investigate a case of a young woman who was found raped and murdered. The initial suspect is the lead singer of the band Vampyre Sacrifice, who is known for \"drinking the blood\" of his groupies. The singer, Trey, has an alibi, so SVU is forced to look at other options. Warner finds out that the victim had a blood disorder which made her blood difficult to clot. This might suggest that the murder was unintentional.A group of women enter the SVU, carrying fliers which feature a picture of their Jane Doe. The group's leader, Babs Duffy, claims that the victim was named Alyssa, and that the group, LesBe Strong, is a gay advocacy group dedicated to making sure crimes against gay victims don't get swept under the rug. Stabler threatens to arrest Babs for disrupting their investigation, but Babs says that she has information about Alyssa's girlfriend, Sharon.Sharon is brought in, and she seems a very militant, violent lesbian. Alyssa's last word before she died was \"Mitch\", which was her nickname for Sharon (a shorter form of \"my bitch\"), but when Stabler attempts to call Sharon \"Mitch\", she punches his face. Benson ends up being the one to question Sharon, because she doesn't want to talk when Stabler is in the same room. The detectives discover another attack, this time on a woman named Rosemary, who was a part of Babs' group. She's distraught when she discovers that the attacker stole her Blackberry, and with it, all the personal information of the members of LesBe Strong.Now that Babs is a target, the detectives have to put her in protective custody. Benson is beyond surprised when Babs tries to kiss her, insisting that she is actually straight. Security footage is found of the attacker, who has a spider tattoo on his hand. Later, a call comes in saying that the attacker has been found and shot.The officers guarding Babs' apartment claim that they found someone with a tire iron lurking on the fire escape. However, the suspect doesn't have a tattoo on his hand. They search through his phone and discover pictures of him with Babs, looking very close and loving with each other. When Babs is told about the pictures, she confesses that she and Larry are in a relationship, and that she's actually bi. Larry was on the fire escape to help protect her, not to hurt her. Benson tells Babs that she has to tell the truth to everyone, in the hopes that this will flush out the real attacker.At a LesBe Strong rally, Babs says that the person who got shot was her boyfriend, which gets a lot of jeers and boos from the audience. Meanwhile, Stabler sees a man with the correct tattoo in the crowd and goes after him. The man, Ronnie, is the person who was printing out all of the group's fliers.Benson decides to bait Ronnie into a confession by claiming that she is a supporter of LesBe Strong and plays to all of Ronnie's fears about homosexuality. Ronnie's failed attempts at dating women must mean that something else is up. Ronnie tells Benson that she secretly would enjoy getting raped by him like the other women did.Babs thanks Benson for helping coax out a confession from Ronnie, and though her group lost a lot of members because of her own bisexuality, she'll still work on LesBe Strong as an all-inclusive advocacy group. She and Larry broke up, and she apologizes for the kiss with Benson. But to thank Stabler, she also kisses him."
    },
    {
      "episode_title": "Shadow",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/shadow-1311098/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Wealthy couple the Gillettes are found dead, the apparent victims of a murder-suicide perpetrated by the husband. Their only daughter, Anne, is understandably upset. However, Cragen discovers that the crime was a homicide. The detectives have to tread carefully, since the couple had generously donated to a police charity as well as to the mayor and to the D.A. The detectives note that the security system for the Gillettes' house was turned off, so that a break-in wouldn't be noticed.Anne seems relieved to find out that her father didn't kill her mother and then himself. She suggests that a burglar must have killed them, but because the crime was so brutal, there must be some personal vendetta against them. Anne recalls that there is a man she noticed who has been stalking her.After tracking Anne's movements through an art gallery where she bought art, and a jewelry store, the detectives discover the identity of the man following her. The man, Ashok Ramsey, is in actually a detective investigating Anne for fraud. This suggests that Anne is the true suspect. Ramsey is on a \"shadow\" operation, where his C.O. will deny that Ramsey is working this case. Anne spent through her trust fund from her parents and she has stolen millions of dollars from a charitable organization called the Prestwick Foundation. Ramsey suspects that Anne killed her parents for the money, since she is their sole heir.Ramsey explains that Anne has evaded paying taxes and has been sued various times for her work as an interior designer. She had stolen money from the Prestwick Foundation, making donations to recipients which turned out to be for her. She has an accomplice, but Ramsey hasn't been able to identify him.Nigel Prestwick and Chief of Detectives Muldrew order the Prestwick investigation closed, since the money has already been replaced, and it would be a P.R. nightmare if word of the incident got out. But the murder of the Gillettes is still an ongoing investigation, even if the Prestwick case is closed. Ramsey decides to work with Benson and Stabler in order to get Anne. They decide to keep up the story that Ramsey is Anne's stalker and bring him into the precinct. Benson informs Anne that they're finding it hard to link Ramsey to the crime scene. Anne suggests that one of her friends, Nathan Harding, can help. However, she wants to make sure Nate wants to help out and asks to get in touch with him first. The detectives suspect that Nate is Anne's accomplice.Benson and Stabler track Nate down and he confirms that he helped Anne steal the money, and that he thoroughly believed that Anne was in love with him. Cragen thinks there still isn't enough evidence to link Anne to the murders, so he tells them to get Anne on witness tampering charges for coaching Nate on what to say to the detectives. Anne is brought in during her parents' funeral. Dr. Huang says that Anne is a sociopath, so Benson should make sure she is comfortable. Muldrew then comes in and tells Cragen that they should not have brought Anne in. Huang informs Muldrew that Anne shouldn't be out wandering around because she is dangerous.Anne asks to speak with Ramsey in the interrogation room, and then tells him that she knew his mother and that they have a lot in common. Ramsey scoffs at that, because even though they both came from wealthy families, he doesn't want to murder his parents. Anne reminds Ramsey that his mother can be very seductive, which seems to affect him deeply.Ramsey wonders whether it would be worth it to press charges, since she could easily post bail. It would be easiest to get Prestwick to make his charges, since he's weak and easily manipulated. Benson tells Prestwick to get down on his knees, and when he does, Ramsey takes a picture. Backed into a corner, Prestwick agrees to go ahead with the embezzlement charges.Prosecutor from the US Attorney's office Camilla Velez is brought in. However, she is wary of taking the case since Anne's parents had been very generous donaters to many politicians. The detectives point out that if they're able to add in the murder of the Gillettes into the embezzlement case, Velez would have a very interesting case on her hands. She agrees to take the case. Stabler informs Anne that she's going to be arraigned on felony bank fraud and will be taken to Riker's Island. Anne tells Stabler that he isn't truly aware of what she's capable of doing to him and his family.Later, Cragen tells Benson that Anne has put a hit out on her and Ramsey. Cragen then tells the detectives that he's taking them off the case because it's much too dangerous for them. Benson isn't about to let Anne scare her away and wants to work with Ramsey in order to take her down. Stabler is annoyed that Benson is working with Ramsey behind his back, but Benson says that he still has to go deal with Cragen.Ramsey and Benson are at Riker's, ready to transport Anne to the federal prison before the trial. On the way, a van intercepts them and two masked men jump out of it. They shoot at Ramsey and Benson, who are both taken down. The masked men take Anne, who is delighted at this \"rescue\".However, one of the masked men is Fin, and he takes Anne somewhere so he can collect the rest of his money. Not knowing that Fin is actually with SVU, Anne trusts him implicitly. Anne calls someone as the detectives listen in, and Anne confesses that she killed her mother because she was going to remove her name from the will. She had to kill her mother to protect her inheritance. She didn't want to kill her father as well, but she ended up having to. Fin and Anne arrive at the hotel, and then Benson, Stabler and Ramsey storm into the room. Fin arrests Anne, who claims that she will find a way to kill them all."
    },
    {
      "episode_title": "Quickie",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/quickie-1311099/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Benson and Stabler are called to a crime scene by Warner. The body of a young woman has been found. Her ID says that she's 23 but Benson thinks she looks much younger than that. The victim had apparently been sexually assaulted. Neighbors say that the did hear the screaming but no one decided to help. The ID is found to be a fake, and from a list of missing persons, Fin is able to figure out the identity of the victim, Anna McWilliams, age 17. Anna's father positively identifies the body and explains that Anna seemed to have gone through a change since her mother died of cancer. She did have a boyfriend, Henry, whom she broke up with after her mom's death.The detectives head to Anna's high school in order to question Henry, who states that he was with Anna that night, but she got a text message on her phone from a website called Anonymous Quickie, which matches up strangers for one-night stands. Anna left Henry in order to go to that hook-up. From the website, the team finds out who Anna was meant to meet that night: a man named Peter. He is arrested for the rape and murder of Anna McWilliams.The team also finds out that Peter knew a woman named Rebecca, who was raped and whom SVU interviewed. Benson goes to talk to Rebecca, who says she did sleep with Peter a long time ago, but he was rough with her. A DNA test said that Peter was not responsible for her rape, however, nor was he responsible for Anna's, and he is released. Later, the detectives talk to Henry again and he says that he killed Anna.Warner tells the team that Anna was HIV positive at the time of her death, and that Peter is as well. The detectives think that Peter has been having unprotective sex with many women during his one-night stands. Peter confesses that their suspicions are correct. Later, Benson and Cabot go to talk to Rebecca, who confirms that she also has HIV, and now suspects that it was Peter who infected her. Cabot tells Rebecca that she should testify at Peter's trial, in order to stop him from spreading the virus to more women. Rebecca agrees.Benson then speaks to Peter, wanting to get to the bottom of why he wants to have so many one-night stands. She thinks it might have something to do with his mother. Peter becomes agitated at mention of his mother and says that the only person who ever cared about him was his grandfather.At the trial, Rebecca suddenly rushes toward Peter and sprays hydrochloric acid on his face. Peter's attorney informs Cabot that he wants to sue the DA office for negligence in failing to keep his client safe. He's pressed charges against Rebecca and if they drop the charges against Peter, he'll drop his against Rebecca. Cabot tells Rebecca that she should take the plea bargain but she doesn't want to. Therefore, Rebecca's case moves forward.At Rebecca's trial, she confesses that she was completely aware that she should not have had unprotected sex with a stranger, especially since a safe sex billboard can be seen outside her apartment. Peter's grandfather, Dewey, speaks to Cabot and he says that he wants to speak in Rebecca's defense during the trial. Cabot tells him that he can't testify because there's no evidence that he's linked to the case in any way. He tells her that he's the one who warned Rebecca and all of Peter's other partners.The detectives decide to speak to Dewey again, though Peter opens the door and says that his grandfather doesn't wish to talk to them. Stabler and Benson tell Peter that it was Dewey who logged into his FaceUnion page and told all his partners that he had HIV. Peter confronts Dewey, and Dewey tells him the truth about his mother. She was sent to prison for killing her abusive boyfriend and she died there. Dewey thought that telling the truth to Peter would be far too painful so he lied and told him that she abandoned him. Dewey, who has overdosed on sleeping pills, then falls and Peter catches him. Before Dewey dies, he tells his grandson to be a good human being.Peter tells Cabot that he will take the guilty plea in all counts. The charges against Rebecca have been dropped. Dewey's life savings will go not to Peter, but to the many victims whom Peter had infected with HIV."
    },
    {
      "episode_title": "Anchor",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/anchor-1301968/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Perverted",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/perverted-1304950/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Fin and Warner are called out to investigate the discovery of a dead man, a biker, tied to a tree. The man (Clyde) had his male parts cut off, and Warner notes to Stabler that the man was tasered. Fin checks the victim's pockets and discovers one of Benson's business cards inside. Meanwhile, Benson is out sick with the flu. Stabler goes to see her about the victim, but she doesn't remember ever meeting the man, and neither does Stabler. Stabler informs Benson that he's going to take care of the case.Fin and Munch visit the headquarters of the Death Knights, Clyde's motorcycle club. The detectives try to talk to the bikers but the club doesn't want the cops involved. When a club member shows up without the right license to operate a bike, however, the detectives force him to cooperate. They bring the biker to the precinct and make him watch survellience footage of a gang rape of a girl (Starla) which the biker participated in. The biker denies that it was rape, saying that she consented to it. The night that Clyde was freed from Attica prison, Starla was given to him as a gift from his club. Starla eventually became Clyde's old lady. Cragen says that Starla's story better match, else the biker will be arrested for rape.Stabler drops by Starla's home but she isn't there. Right before he leaves, however, he spots her, carrying a briefcase and dressed in a business suit. She panics at the sight of the detective and tries to run, but her suitcase flies open, and a lot of government documents tumble out. Starla claims that she didn't murder Clyde, and that the footage with her and the Death Knights wasn't gang rape. Starla has a job at the city clerk's office, but she's been pilfering blank birth certificates. She willingly admits that she wants to become a part of the Death Knights and has no shame for what she's done. She claims to not know Benson either.Cragen discovers that a 911 call was placed concerning Clyde's bike. A dark haired woman in a black Mustang was spotted hitting the motorcycle, but the caller only remembered part of the license plate. When the numbers are run, however, Benson's name pops up as a possible owner of the vehicle. Cragen goes with Benson to examine her car. She says that she's been home sick and hasn't driven her car in almost a moth. However, the damage to the car (a broken headlight and a large dent) tell a different story.The detectives all believe that Benson didn't cause the accident, and Fin says he'll try to find the person who placed the 911 call. To stave off any suspicion, Benson asks Warner to take a swab of her DNA. Fin and Munch do find the person who made the call. Khalil has a thick accent which doesn't match the voice of the caller on the tape. He says that he let someone borrow his cell phone to call 911 about a car accident. Khalil offers the detectives a description of the man, but it's too vague to be of much use. Meanwhile, the attempt to get survellience footage from Benson's garage hits a snag because the garage cycles through their tapes every 24 hours and that window has already passed. No one will be able to tell who took Benson's car. Benson is at the precinct, searching through her old case files to try and figure out her connection to the current case. Cragen tells her to go home and get some rest, and that Stabler will search through their cases.As he tracks down the Death Knights, Stabler informs Kathy on his cell that he's working late. But then he spots a biker pouring beer all over his car. It turns out the biker is an undercover cop, Russell, who has infiltrated the gang. Russell explains that his partner is working survelliance in a nearby building and that Stabler should check things out there. Russell's partner, Detective Lewis, has been tracking the Death Knights for the past six months. Lewis informs Stabler that Clyde seemed pretty close to all of the other gang members, and no one would have had any reason to try to kill him. Stabler brings up Benson to Lewis, and Lewis admits that he dug around once Benson's name came up, just in case she had any ties to the gang. But she's clean. Lewis also shows Stabler a photo of a man who is working on Clyde's bike, installing a GPS tracking device.Lieutenant Tucker wakes Benson from sleep, and ends up arresting her for murder even after she vehemently denies doing the deed. At the precinct, Benson gives Tucker her story. She was home sick with the flu, but she doesn't have an alibi. Tucker thinks that the fact that no one checked in on her is suspicious. Stabler finds out from Cragen that Benson gave up her Miranda rights, which might not be the best thing, even when she's proclaiming her innocence. Stabler tells Cragen about the photo. If they find the man in that photo, that would help clear Benson's name. Cragen suggests releasing the photo to the media and let the public help find him. Meanwhile Tucker accuses Benson of being dirty, which means that her partner Stabler is probably dirty as well.Tucker reminds Benson that she was getting psychiatric care last year and that she might have PTSD, cracked under the pressure and killed Clyde. Benson pleads for Tucker to tell her what evidence they have to link her to the crime. And Tucker says that her blood was found on the murder weapon. Benson finally realizes that she needs a lawyer. Stabler goes ballistic at Warner for tainting the evidence, but Warner is certain that Benson's DNA was on the knife that killed Clyde.In Central Booking, Benson discovers that her attorney will be Trevor Langan, who says that her friends paid for his assignment so she can't balk at who she got as a lawyer. Members of the Death Knights are at Benson's arraignment. Her bail is set and Langan says he has to get her out of Riker's Island before any other Death Knights get a hold of her. Benson posts bail thanks to Stabler, who took a mortgage out on his house. A tip from an ex-girlfriend leads the detectives to Lawrence Grabowski, who is stuck underneath a shelf in his office. The gang might have gotten to him first. Lawrence claims that he did not do anything to Clyde and that he didn't take Benson's blood. He was only following Benson because he was hired by someone else, Brady Harrison. Harrison was convicted of a series of date rapes and was sent to prison thanks to Benson and Stabler.Munch and Cragen finally discover the link between Harrison and Clyde. They were in Attica together, and apparently got into a fight, where Harrison was so badly beat up that he had to be taken to the infirmary. Fin and Stabler go to Harrison's place, but they don't find him. They also find that the place has already been turned upside down, presumably by the Death Knights. Stabler tracks down the gang, and Russell says that the club did go to Harrison's home, but he was already gone. Without Harrison, Benson will be the one tried for Clyde's murder.Benson returns to her home as the detectives try to find Harrison. Harrison hired Lawrence to follow Benson into a restaurant, and Lawrence took Benson's eating utensils after she was done with them. However, Warner says that the sample she tested had Benson's blood, not her saliva. The detectives find out that there is now a way to combine blood with any DNA to create a faked DNA sample.  The detectives go to talk to Dr. Joseph, who has a reputation for making these fabricated blood samples. Dr. Joseph knows Harrison and Fin tells the doctor to get in touch with him. They track down Harrison's location, and he isn't that far from Benson's apartment.Harrison breaks into Benson's home, grabs her and threatens her with his Taser. He's convinced that Benson planned for Clyde to rape him in prison because she told him \"that's what happens to 'pretty boys' in there. 'You'll understand what you put those women through.'\" Benson apologizes and she tells Harrison that she wasn't aware he was going to be sexually assaulted. Harrison is ready to shoot himself in the head since he's the only person who knows the entire truth. Olivia throws a lamp and herself at him so he can't commit suicide. They struggle, and Olivia grabs his Taser and uses it on Harrison. Then Stabler arrives and arrests him. Back at the precinct, Stabler and Benson speak to Dr. Joseph about the fabricated DNA. The DNA may have put a lot of innocent people in prison as well as let a lot of true criminals go free. Now that even DNA isn't 100% rock solid proof, this changes the way the detectives go after evidence."
    },
    {
      "episode_title": "Turmoil",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/turmoil-1304615/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Stabler is working on a case in which a high school girl (Nikki Sherman) was allegedly raped, which puts him at odds with his son, Dickie. The victim is Dickie's classmate and he says that she had photos on the Internet where she's baring her chest for the camera. Dickie's friend Shane, an ex-drug addict whom Stabler doesn't trust, drops by so that he and Dickie can go to school together.At the trial, defendant Sam Baylor's attorney says that the prosecution is keeping a recant statement from Nikki hidden from the defense, and that the defense has a witness which will prove that what happened to Nikki was consensual. Cabot doesn't think that the defense has anyone. A representative from the state bar (Liam Black) comes into the courtroom. The detectives give testimony that they handed all available evidence to Cabot. However, the judge offers 48 hours to Cabot to get their side of the story straight.Cabot and Black talk, and Cabot wonders whether the investigation into the way she practices is because of what happened to Sonya Paxton. SVU is on the spot, and if Cabot's license to practice is revoked, then the detectives are going to be targeted next for review. More bad news comes from Cragen, who tells Stabler that his son is missing. Stabler learns from Kathy that Dickie fought with another boy before he took off. Stabler assumes that he's with Shane. Gomez tells Stabler that she can help, but Stabler doesn't want to file a missing person's report just yet. However, Kathy does, and Gomez starts to check the cellphone towers to track Dickie down via phone call.Stabler receives a phone call from the bank, which mentions that Dickie tried to use an emergency credit card at an ATM. Kathy tries to find their son while Stabler goes to Shane's mother Belinda. She says that Shane has been clean for months, but Stabler isn't sure and doesn't like the fact that Shane and Dickie are friends. Belinda is frustrated with Stabler's suspicions and tells him that his son would rather be called \"Richard\" than Dickie. Later, the bank calls Stabler again, alerting him that Dickie's emergency credit card was being used again. Cragen says that there's another more pressing case that Stabler needs to focus on.Stabler, along with Fin and Benson, go over the evidence for the Sherman case. The victim says that Sam forced himself on her at a party and physical evidence shows that she had Sam's DNA on her and that there was some evidence of rape. But Sam says the sex was consensual and there was evidence of rape only because Nikki was a virgin. The defense claims to have evidence that Nikki said she wished to have sex with Sam. After thinking that they gave up all the evidence they could to the defense, Stabler remembers the online picture of Nikki which Dickie told him about.Kathy arrives at the precinct, very troubled about what's happened to Dickie. She says he called her and he sounded panicky. He wanted the code to the emergency card and he lost Shane. He called from a dangerous neighborhood in the south Bronx, and Fin heads off to check the surveillance footage from the ATM. The detectives are told by Cragen that they can continue working on finding Dickie until they get a break in the Sherman case. Benson and Stabler interrogate Danny Proctor, the boy Dickie fought with earlier. Dickie was trying to defend Shane because Shane had sold Danny a few stolen items to pay to get into the Army. A recruiter had been speaking to Shane and Dickie.Stabler confronts the Army recruiter, Sgt. Jordan, asking why he's targeting a minor. Dickie should be kicked out of the recruitment office the next time he enters it, but the Army needs soldiers and Jordan makes no promises to Stabler about turning Dickie away. And once Dickie turns 18, his dad won't have any power over this anymore.The ATM surveillance footage shows Shane with Dickie's card, but Dickie isn't around. Stabler lays out plans to find his son, but Munch has discovered new evidence in the Sherman case, her topless photo. The picture shows her surrounded by high school boys, including Sam. Furious, Cabot wonders why they hadn't gotten this picture earlier and blames Stabler's preoccupation with finding his son. Cabot explains that their every move is being scrutinized by the state bar, but Stabler doesn't back down.Fin and Benson speak to Belinda, who tells them that Shane was constantly getting calls from Dickie. When the detectives suggest that Shane has fallen off the wagon, Belinda once again insists that her son is clean. Shane donates some of his spare time at the homeless shelter because that is where his sponsor works. Belinda accuses the detectives of just wanting to arrest Shane and refuses to give them permission to check his phone. Stabler thinks that Shane was forcing Dickie to get cash for him, but its unclear whether Shane was going to use the money for drugs or for something else.The last number called on Shane's phone was at the homeless shelter, and the detectives go to talk to Shane's sponsor, Carrie. She says that the last time she spoke with Shane, he was clean and that Shane was growing close to a homeless man named Harold, who was still a drug addict. Dickie had also come in asking about Harold. When Stabler arrives, they find Dickie bludgeoning Harold with a piece of wood.Cabot and Nikki talk about the photo. Nikki claims that somebody put something in her drink, and Cabot suggests that Nikki was slipped the date rape drug. But the party happened three weeks before the rape, and the only reason she was there was because she wanted to hang out with the seniors. Cabot says that Nikki has to tell her father about the photo.Dickie tells Benson that Shane needed money to buy a fake ID and birth certificate so that he could join the Army. Also he knows that Shane is clean. He then asks Benson if she's ever slept with her partner. Harold knows where Shane is and Dickie just wanted to find out. Shane's phone is traced to central booking, but the boy himself isn't there and Shane's phone has blood on it. Dickie learns that Shane is missing and that they have to find him right away. Stabler tells Dickie that since he's his father, he has a right to know where Dickie is at all times. But Dickie doesn't want to be controlled by his father any more. Livid, Stabler then shoves Dickie against the wall.It's Shane's blood on his phone, and the phone was stolen by a man named Neal Douglas, who has a long criminal record. The detectives start to speak to Neal but Cabot intervenes, saying that Neal is required to have his lawyer present before the interrogation can continue. Later, Paxton warns Cabot that she can't give more ammo to the state bar.Cabot has dropped the charges against Sam Baylor, which upsets Nikki. She should have listened to her friends and not said anything. Munch is put in charge of SVU because Cragen was allowing Stabler too much leeway in investigating his own case. Cragen informs Stabler that they just found Shane's body in a dumpster. Cabot berates Stabler for going to the crime scene, and Benson tells Cabot that she just requested a new ADA since Cabot just dumped a rape victim to save her own career.Shane has multiple stab wounds and was stomped and kicked to death. His death would have been very slow and very torturous. The tox screens on his body show that he was completely clean of drugs. Stabler listens to Warner's report, feeling guilty for accusing Shane of being a bad influence on Dickie. Neal, the suspect in Shane's murder, was given the phone in a swap for drugs, but he didn't know whom he gave the drugs to. However, he was a homeless man. Fin goes to nab Howard, who assaults Fin with a knife. Harold, severely mentally disturbed, had killed Shane just to get his phone and to get his drugs.Stabler studies more tape footage, thinking that he could have helped Shane if he had managed to look at the tapes in time. Benson goes to talk to Nikki, but finds her passed out on her bed with an empty bottle of Oxycontin nearby. Benson tries to revive Nikki using CPR. Meanwhile, Stabler's attempt to talk to Belinda falls on deaf ears. Cabot is trying to refile for the Sherman case, and brings in Nikki's friend Amy. Amy had lied in her testimony when she said that Sam had invited Nikki to parties. Amy was bribed to lie, and she's now willing to share the truth.Dickie has been out all night before coming home. He tells his dad that Belinda won't talk to him and won't let him attend Shane's funeral. Stabler feels guilty, but when Dickie offers him the Army consent form, Stabler refuses to put his signature on it. Dickie begins to cry and Stabler gives him a fierce hug."
    },
    {
      "episode_title": "Users",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/users-1304610/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "A girl is in a room in a sleazy motel, and she receives a text which reads \"I'm on my way.\" Meanwhile outside the motel, a boy shoots up. The girl is joined by a mysterious man, who proceeds to choke her to death. The boy leaves the scene in his car before the police arrive. Benson and Stabler talk to the desk clerk, who claims that the girl paid in cash and came to the motel alone, but she was expecting someone else to join her. The room was in the name \"A.J. Gold.\"Warner sees that the victim was raped, sodomized, and then strangled. The victim can't have been a prostitute because she doesn't look like one, and also she seems to have struggled against her killer. There is evidence of blood in her mouth which is not hers. Fin says that pics of the murder victim have been leaked onto the Internet, and those photos were not police photos. They were taken hours before the police arrived. The desk clerk confesses that he took the photos and sold them to a website. He also says that he didn't kill her. He was alerted to the scene after another guest complained that they heard screaming coming from A.J.'s room. The desk clerk also stole A.J.'s cell phone. When the detectives point out a really bad cut in the clerk's arm, the clerk says that he got it from cooking heroin.Using the cell phone, the detectives get in touch with two of A.J.'s friends. They speak to the girls, and they say that A.J. was looking for an older man to have sex with. However, she wasn't a prostitute. A.J. also told them that her father molested her. This leads the detectives to talk to A.J.'s parents. Terri, her mother, didn't realize that A.J. was going around saying that Greg (her father) molested her. A.J. and her dad didn't have a good relationship, however, and they were always arguing. In fact, there was a huge blow up between them right before A.J. died. Greg arrives at the Dunne home, and his shirt is stained with blood. The detectives immediately arrest him for the rape and murder of his daughter.In Interrogation, Greg claims that he did not kill his daughter. Terri says that A.J. was put in a youth treatment facility called A Sheltered Place for her oppositional defiant disorder. A Sheltered Place (ASP) is run by a man named Martin Gold. Terri fully believes that Gold had the ability to help her daughter, but Greg says that Gold lies in order to keep his facility running. Gold had told A.J. that she was troubled because her father molested her, and A.J. was starting to believe it. Someone left a flyer on the windshield of Greg's car with a picture of Gold and A.J., and the text at the bottom read: \"Martin Gold is raping your daughter\". Greg went to confront Gold about this and they got into a fight, where Gold stabbed Greg with a pen. Greg was arrested, and had just returned from jail to the news that his daughter is dead. Greg thinks that Gold killed A.J.The detectives go to ASP to speak with Gold, and they arrive in the middle of one of Gold's speeches to the teens. The teens leave, and they all tell Gold that they love him. Gold says he doesn't want to press charges against Greg. Stabler gives Gold the flyer from Greg's car, and Gold claims that the picture was faked. He has an alibi for the time of A.J.'s murder: he was at the shelter and he has the survelliance tapes to prove it. But when the detectives ask for the tapes, Gold says no. He claims not to know why A.J. signed for a room with \"A.J. Gold\".Cabot, angry that the detectives weren't able to get at the tapes, issues a warrant so that they can confiscate them. But when they go over the tapes, they see that Gold was telling the truth. ASP's website is fairly popular, and their motto is \"We diminish the power of unwanted thought and impulses by embracing them.\" Stabler and Benson are very concerned about Gold's methods, but Cragen argues that Gold's success rate is 83%. The detectives also have to be careful around the facility because the daughter of Deputy Mayor for Legal Affairs is currently a patient of Gold's.Morales figures out that the picture of Gold and A.J. was Photoshopped. But from the tapes, he also discovers that A.J. was staying overnight at ASP, and Gold's facility isn't legally set up as a live-in shelter. The detectives speak to A.J.'s parents and they say that they let their daughter stay at the facility because Gold claimed it would be easier to help her.Munch finds out that A.J.'s credit card was just used in Little Italy. Warner notices that the blood in A.J.'s mouth contains trances of drugs used to treat Hepatitis C. The detectives aim to talk to the desk clerk at the motel again but then they see a boy in the morgue, near A.J.'s body. The boy, Enzo, tries to run away but is caught. Fin tracks down and arrests the suspect who used the credit card, Ramsey Vickers. Enzo thinks that A.J.'s death was his fault. Meanwhile, Vickers is extremely nervous and wants to talk to a lawyer first. But when Cragen comes in, Vickers suddenly collapses and is taken to the hospital.Vickers is suffering serious side effects because of a bite on his penis. A.J. apparently bit down on him as he molested her, which means that he's the one who killed her. He says that he didn't intend to kill A.J., and that he met her through a Craigslist ad.The detectives bring up A.J.'s ad, which states that she's looking for an older man whom she could pretend to be her father as she slept with him. Enzo is also one of Gold's patients, and he was at ASP to be treated for heroin addiction. He met A.J. and they fell in love. However, they had to keep their relationship a secret because Gold forbids patients to date each other. Enzo was the one who Photoshopped the picture, but he knew for sure that Gold was raping A.J. to help her get over her fears. On the day A.J. was killed, Enzo had followed her to the hotel room, but he chickened out and ran away so he wasn't able to help her. Stabler asks if Enzo would agree to testify in court against Gold, and Enzo says yes.Huang believes that Enzo would be more beneficial to their case if he has the heroin out of his system, and he also believes that Gold is taking advantage of troubled teenagers in order to entertain himself. Benson and Stabler arrest Gold right in the middle of a therapy session, but during interrogation, Gold is confident that the jury won't believe Enzo's testimony.The detectives ask Cabot to press charges against Gold, but Cabot hesitates, since the only testimony they'd have is from a drug addict. Huang tells the detectives about a new type of medication which can cure heroin addiction in 24 hours. If they got Enzo this treatment, then he could testify clean. The drug hasn't been approved yet in the US, however. The police have to let Gold go, and since he has legal custody of Enzo, he takes the boy too. Benson and Stabler suspect that Gold is supplying Enzo with drugs so that he wouldn't be able to take the stand.Huang finds Gold's file on Enzo and then takes the boy from the shelter. Benson tells him that what he's doing is illegal, but Huang doesn't think he has a choice. He brings Enzo to get the drug, after convincing the boy that this is the only way that he'll get better. Later at ASP, Enzo asks Gold to forgive him for what he did with Huang. Enzo asks Gold for more drugs and Gold willingly hands out some to him. The detectives then arrest Gold for drug possession and distribution and as an accessory to murder.Enzo, now free of the addiction, is fine to take the stand. Huang turns himself in for his law-breaking, and he gets his medical license suspended for 30 days, which he thinks is a very small price to pay."
    },
    {
      "episode_title": "Spooked",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/spooked-1301961/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "An abandoned rental truck seems like easy pickings for two car thieves, but when they bust the vehicle open, they discover two dead people, a man and a woman, inside. Both victims' throats have been sliced through, and the woman's breasts have been surgically removed. Her underwear is found hanging on a clothesline, and Benson wonders if she has been raped. Later, as Munch and Cragan discuss the case, Munch watches as new phone lines are installed at the precinct, an update which Cragan had spent over a decade applying for.Warner finds out that the murder weapon is a scalpel. A tattoo on the male victim points to him possibly being involved in a Mexican drug cartel. Cragan gets Munch to send pictures of the tattoo and the male victims' fingerprints to the FBI to see if he'd border-crossed legally. But because of the victims' teeth, Warner thinks that they must be American. They have no other clues to help them apart from some unidentifiable brown fibers.The detectives track down the male victim's identity through the car rental company. His name was Carlos Martinez and he left a Mercedes behind at the car rental lot. Checking the GPS in the car, the detectives trace the last place Martinez planned on going. The address is an abandoned residence which could have been used as a drug factory. They also find evidence that Ramona Rodriguez, the female victim, attempted to destroy her license by setting it on fire.Benson and Stabler track down Ramona's roommate, Terri, and she claims that she did not know Ramona very well. She just needed the money Ramona's rent brought in. Ramona's passport shows that she'd been traveling all over the place, as a drug mule. Maybe her breast implants were usually filled with heroin. They also find the source for the mysterious brown fibers, from a teddy bear on Ramona's bed. Meanwhile, someone else is trying to visit Terri's apartment: Agent Dean Porter.Porter explains that the teddy bear contains a half kilo of black tar heroin, and the detectives inform him that Martinez and Ramona are dead. Martinez, Porter says, was about to hit the FBI 10 most wanted list and he thinks the victims were attacked by a rival drug cartel because of how the victims were found. Cragan makes a deal with Porter: the FBI tracks down the drugs, and SVU tackles the homicides.Benson and Porter share small talk for a while and then Stabler puts a stop to their conversation. A search warrant is obtained and the detectives go through Ramona's apartment, discovering a safe deposit box key. The box (belonging to a man named Juan Pablo) contains a plane ticket. Timmons wants to try and get the real owner of the box from the prints on it. A flight coming in from Mexico might just have their suspect aboard.The detectives go to JFK airport, where Stabler spots a Hispanic male with a shipment of kid's toys. Cragan informs Benson that Pablo's real name is Manuel Rojas. Porter is at the airport and chases after the van that took the shipment of toys. However, Stabler sees that Rojas hasn't left the airport yet. Benson goes after Rojas but she is taken hostage by him instead.A cop is shot by Rojas as he continues to drag Benson around with him. Stabler goes after them, but when Rojas puts the gun to Benson's head, Stabler refuses to negotiate. When Benson accuses Rojas of killing Ramona and Martinez, he denies it. Rojas is shockingly shot dead by Porter. But Porter was supposed to be going after the drugs, not the murder suspect. Porter mentions that the FBI was in contact with an informant who said that Ramona and Martinez were planning to double-cross and steal from their gang, and so Rojas killed them. Cragan declares that SVU's role in the case is over and that Benson and Stabler should start putting together their report.The detectives work through the report when Warner discovers that a third DNA profile was at the crime scene, not from Rojas but from a woman. There's no evidence that Rojas ever set foot in the rental. Therefore, Benson concludes that the DNA must belong to Terri, the roommate. She wants to call Porter to tell him about this discover, but Stabler stops her.The detectives go to Terri's apartment, and Stable recognizes a cable television installer as the same man who worked on the phone line updates at the precinct. Morales searches through SVU to find all the bugs, and the cable technician, Michael Garcia, is brought in for questioning. Porter is there too but when he tells Garcia that he could face up to 30 years in prison, Garcia doesn't say a word. Porter wonders if rogue cops recruited Garcia to keep SVU off the trail of the drugs. Porter wants to handle the rest of the case, but Stabler wants SVU to do it. Porter claims that the two detectives are in for way more than they bargained for, since the cartels have bugged the precinct phones.Stabler decides to go against orders and the detectives continue to track Terri. In a grocery store, Benson spots Terri putting a bag in a shopping cart and then takes the cart of another man. Terri flees before Benson can stop her, but Benson manages to grab the man with the exchanged cart. The bag contains Ramona's breast implant. With Porter keeping an eye on things from a distance, the detectives arrest the man. The man denies that the bag is his.The implant contains a SIM card with coded data, containing a list of names and addresses. However, before the detectives try to track down those names, Porter comes in with a warrant from federal court, giving the FBI all evidence in the murder case. Morales figures out that it was the FBI that bugged SVU, and that Benson and Stabler are constantly being watched. Garcia must have also been working for Porter as well.Porter was well aware that Terri murdered Ramona and Martinez. Terri is a CIA spook, and Munch theorizes that Terri was gathering intelligence on the SVU for Cuba. The SIM card contains a list of names of American agents that Terri wanted to rat out. Ramona and Terri were close friends in high school, and Porter watched the detectives to keep them from uncovering Terri's true motives.Benson banks on her shared history with Porter to get some information out of him. He comes to her apartment with a bouquet of flowers. Morales and Stabler access Porter's phone while Benson kisses Porter to divert his attention. After the information is downloaded, Cragen calls Benson and claims that they found Terri. Porter takes off, and the detectives track Porter as he tries to get to Terri first.Benson and Stabler find Terri and arrest her for murder. They bring her into SVU, where she claims that the names on the card are for the resistance in Cuba, so that they knew who to send their gathered information to in the US. Terri says that she had no idea Ramona was a mule, but once Ramona got the breast implants, she blackmailed Terri for money to keep her quiet. Afraid that she was going to sell off the information on the card, Terri had to kill Ramona, take the breast implants, and kill Martinez to alleviate any witnesses. And Porter was aware of everything from the start.Benson wants to arrest Porter, but Cragen receives an order from higher up saying that they need to let Terri and Porter go. After Porter claims that this was all due to the heightened national security, Benson wonders why he didn't tell her everything considering the history they had together."
    },
    {
      "episode_title": "Hardwired",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/hardwired-1295542/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Hammered",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/hammered-1297354/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "A naked man startles himself awake and, disoriented, looks over damage done to his bathroom. The mirror is cracked and his hands are covered in blood. He manages to make it to his bedroom where he finds the dead body of a woman. Shocked at the scene, he throws up.Warner, Stabler, and Benson arrive at the scene to investigate. They note that the man (Dalton Rindell) has an injury on his head. The victim was bludgeoned to death. Warner notes that fluids on the victim's thighs indicate that there was sexual intercourse involved, and she can also pinpoint the exact time of death. The victim held her hands up to protect herself from the blows, and her watch on her wrist was broken at 12:57. There is an engraving on the watch which reads \"Audrey, with eternal love, Michael.\" Benson suggests that Rindell was having an affair with Audrey, and that Michael found out about it and attacked the pair of lovers while they were in bed.Rindell doesn't remember what happened, he must have blacked out between the victim's time of death and the next morning when he called 911. The paramedic claims that the injury on Rindell's head shouldn't affect his memory, but Rindell remembers nothing about last night. He doesn't know who the woman is, and thinks that he was attacked himself. Stabler is skeptical of Rindell's story, as there were no signs of forced entry. However, there is also no evidence of the victim's purse. They decide to get a DNA sample from Rindell.Rindell is at the station being fingerprinted, and he keeps wondering about why he would be targetted for something like this. Munch gives him a release to sign so that they'll be able to search his apartment without a warrant, and he signs it without complaint. Warner takes a DNA sample from Rindell, and Benson arrives with a toolbox found in Rindell's apartment. The hammer is missing. Rindell claims to feel very very sick, and Stabler says they should take him to the hospital.The doctor finds a sliver of glass embedded in Rindell's head but otherwise his CT scan is normal. He is dehydrated, however, so was Rindell drinking heavily the previous night? Rindell denies it, he doesn't drink or take drugs. And all he remembers from last night was that he was working. Munch and Fin meanwhile go through the man's apartment. They find that his bathroom is lined with bloody handprints and used towels, and when they check the shower itself, they find a hammer, which has been cleaned of blood and prints.Rindell still doesn't remember a thing, and still insists that he was working that night. He is a building developer and was at a gathering of people he and his partner had presold condo units to. Construction on the building had to stop because the crew found a problem, so the developers had a get-together to help ease buyers' concerns. Did Rindell drink then? Rindell, again, denies it.Cragen goes to the development company to talk to Rindell's partner Bill Tattinger. Cragen wonders whether the developers might be just taking the buyers' money without giving them an actual return. Tattinger counters that the company just needs another round of financing to help cover the costs, and that the building will become a landmark. Otherwise, the company will have to file bankruptcy. Cragen figures that this could be motive enough for murder and asks for a list of their buyers. Tattinger doesn't give up the names. Meanwhile, Munch and Fin discover that the victim's bag was tossed out of Rindell's apartment last night. Inside, they find the victim's personal effects, including a purse. She's IDed as Audrey Hale, a doctor at a women's clinic.Benson and Stabler are questioning Audrey's ex-husband. He claims to have been worried about her job at the clinic, since they do abortions there and their family had been threatened before. During the divorce hearing, he petitioned for sole custody of their daughter, but he lost. He'd always assumed that Audrey would eventually get hurt because of her job. He doesn't seem to have any connection to Rindell or to the development company.Rindell still believes that he was being set up, even when confronted about the abortion issue by Munch. So Benson and Stabler go to the women's clinic, and confront a protester, who says that Audrey's death was a blessing because now there was one less mass murderer out there. Inside the clinic, the detectives speak to Dr. Kittle, who shows them a box of hate mail that the clinic has received. Benson takes the letters. The detectives find out from Dr. Kittle that Audrey had plans for dinner with a female friend last night.They speak to Audrey's friend, Linda, who says that they had dinner and shared a taxi home, but then went to a bar for a nightcap. At the bar, Audrey met a guy who matched Rindell's description, and they were getting along so well that Linda decided to go home without Audrey.The detectives are driving Rindell home and they pass by the bar, but he claims that he doesn't remember the place. He's been sober for over a year and shows Stabler his 1 year sobriety chip. However, when they go inside, the bartender remembers seeing him there last night with Audrey. Rindell says he's going to vomit so he rushes to the men's room. Stabler tries to follow him inside, but he's too late to slip in before Rindell shuts the door. Stabler receives a phone call, so he has to move away from the bathroom to get better reception. The DNA evidence on Audrey matches Rindell. When Stabler goes back to the bathroom, he finds Rindell has fled.Cragen chastises the detectives for bringing Rindell on a field trip. There seems to be no action on his credit cards or his bank accounts. They're keeping an eye on the garage where he keeps his car, and the airport, train, and bus terminals have all been alerted. ADA Paxton arrives and complains about her missing defendant. She now has to go through a separate hearing since Stabler screwed up on the bartender's ID of Rindell.Paxton and Cragen study a computer-generated recreation of the crime scene. The victim apparently was in bed, and Rindell attacks her with the hammer, which causes her to fall out of the bed. Rindell then continues to bludgeon her on the floor. Cragen mentions that the sex has to be consensual because they were both at a bar and drinking heavily, but Paxton doesn't think that being drunk is an excuse for obvious rape. The severity of the blows suggests that Rindell should be covered in blood, but no bloody clothes were found. So the tech wonders if Rindell was naked when he did the crime. He must have cleaned up a little and then smashed his head in the mirror after he found out what he had really done. Cragen receives Rindell's phone records. He called Tattinger many times but those calls went unanswered, however, he did manage to call his ex.Rindell's ex-wife has no idea where he is, and when Munch tells her about the phone call, she tells them about the strange story he told her, about how he was being set up. But as a rental agent, she'd have a lot of places where Rindell could hide. She claims that she doesn't want anything to do with him anymore, since she managed to quit drinking and he didn't. He became a different man when he was drunk, and she left because of that. She says that Tattinger might be the one who'd give him help.Benson and Stabler arrive at the development company, and discover Rindell and Tattinger fighting. Rindell is cuffed and demands that Tattinger tell the detectives the truth of what happened. Tattinger admits that he slipped Rindell a little alcohol at the gathering, because he still needed to convince the buyers that their investment was safe.Rindell admits that he's on anxiety medication, which you're not supposed to mix with alcohol. He thinks that Tattinger must have made his drink really strong because he doesn't remember having that many drinks, doesn't remember leaving the office, and doesn't remember what happened afterwards.Paxton thinks that Rindell is using alcohol as a crutch, and that alcoholism isn't actually a disease because one can stop whenever one wishes. Cragen counters that alcoholism is a recognized addiction, and that he's been sober for over 20 years. He still has to fight with the addiction every day. Paxton says that alcoholism shouldn't be an excuse for rape and murder. Cragen adds that they can pin Rindell on the murder but not on the rape. A woman arrives at the station, who claims to have worked at the development company for awhile. Rindell sexually harassed her by exposing himself and then grabbing at her.Rindell says that that was the last time he'd taken a drop of alcohol until Tattinger made him drink again, but Paxton still insists that he shouldn't give alcohol as an excuse. She claims that Rindell found out what Audrey did and killed her in a blind rage, but Rindell keeps saying that he's not anti-abortion. He just doesn't remember what happened, and he has had alcohol-induced blackouts before. Paxton shows him a computer screen which plays the recreation of the murder, but Rindell's face has been placed on the assailant's face.At a Frye hearing, Dr. Sofer is giving testimony on the problem of alcoholism and how much a person's judgment is impaired because of it. Paxton doesn't think the hearing is necessary and objects to the hearing, even though new scientific evidence might be brought in to her case. Addiction is a disease, and people who are prone to addiction have physical changes to various segments of the brain. Even if Rindell took a drink on his own, his addiction to alcohol made it impossible for him to keep any self-control.Paxton cross-examines Sofer, to get her to agree that not all addicts commit murder. Alcoholism isn't a disease like a tumor. A tumor can't be cured just by thinking about not having the cancer, but people can force themselves to stop drinking. Paxton manages to convince the judge that the \"alcoholism as a disease\" defense won't be admissible in court. Benson admits that her mother was a drunk, and she died falling down a flight of stairs. The question of alcoholism as addiction isn't so cut and dry, but if there were a cure for it, then her mother would still be alive. Rindell is now claiming temporary insanity for alcohol psychosis.At the hearing, Paxton shows the computer recreation of the murder, but it's the wrong file. It's the one with Rindell's face on the assailant, which has tainted the jury since it clearly places Rindell at the scene of the crime. Later Paxton is at a bar, drinking, as Benson and Stabler enter. The judge sent the jury home, and the detectives try to console Paxton. But she's having none of it. If the judge polls the jury and finds that they can't disregard the computer simulation, he will be forced to let Rindell go and declare a mistrial. Paxton says she'll need the entire night to prepare for the next day in court.In court the next day, Paxton is late and harried-looking. Rindell immediately pegs her as being drunk. Benson ends up giving her a sobriety test, and her blood alcohol level is just above the legal limit. The judge tells her she should be removed from the courtroom, and Benson tries to escort her out.A mistrial has been called on the case, and Benson tells Rindell that he's an extremely lucky man. Rindell counters that no matter what, this case will be haunting him for the rest of his life. He confesses that he realizes that he'd killed Audrey and starts to break down. He was so drunk that he doesn't think a memory of the event formed in his head. The stress from his business probably made him snap, and now that he realizes what he's done, he can't let go of it.The detectives discuss Paxton's dismissal and Stabler points out that this was why she was such a control freak, that she was a functioning alcoholic trying to control everything she could. Paxton is off to court-ordered rehab and apologizes to the detectives before she leaves. Later, Benson goes to visit her mother's grave, placing a bouquet of roses on her tombstone."
    },
    {
      "episode_title": "Solitary",
      "nth_episode": 22,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/solitary-1297722/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "A young woman, Lily, is kidnapped from her apartment.  Her boyfriend comes home and finds out what happens.  He assumes their creepy neighbor kidnapped his girlfriend.  Elliot and Olivia knock on the guy's door and find a guy named Donovan that Elliot had put into jail decades before.  It is eventually revealed that his lawyer is Jessica Walter.Lily is found floating in the Hudson River.  She is still alive.  She wakes up and can't remember the specifics of what happened to her.  She was pretty certain their creepy neighbor is the one that kidnapped her.  Things turn around when a women working at a copy store tells the police that she saw Lily arguing with an Asian man around midnight, after she was supposedly taken.  It turns out that Lily has a drug problem she wanted to keep a secret from her boyfriend.  Elliot went to apologize to Donovan.  Donovan was mistaken as to why Elliot went to find him and pushes Elliot off the roof.At the trial, there was a debate over the treatment of the prisoners in solitary confinement.  Donovan challenges Elliot to understand what it is like to be completely alone.  To refute this, Elliot decides to go into solitary confinement himself.  Elliot goes crazy only being in for three days and he now understands what Donovan went through.  Olivia is still not convinced and is unwilling to drop the charges."
    },
    {
      "episode_title": "Sugar",
      "nth_episode": 23,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/sugar-1295080/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Two geocachers race to reach their goal first, but instead of finding their intended treasure, they discover a suitcase with the naked body of a young girl inside. Benson and Stabler are brought on the case, and the detectives have to break up the ensuing argument between the two geocachers over who found the suitcase first. Geocaching is like high-tech treasure hunting, and there are websites devoted to giving clues to where these caches are hidden. They don't think that the dead body was supposed to be the cache. When asked who put together the clues for their current hunt, the geocachers say it's someone called the Master Baiter. His website contains a video of his latest hunt, based in the subway system. His IP address is traced to a store on Staten Island called the Garb Barn.Benson and Stabler go to the store to investigate, with Benson loudly paging the \"Master Baiter\" on the store PA system. The request gets some nervous giggles from the employees but one of them takes off running with the detectives in hot pursuit. The employee says that she didn't plant the suitcase. She was only there in the tunnel to get the shot, but a train passed by once and ruined one of her takes. The video footage reveals that the suitcase was thrown off the train.The train was an express to Florida, and the victim is IDed as Emily Keefe, who had a one-way ticket to Tampa. The train's departure was delayed because of equipment problems, and it's suspected that the perp took advantage of the late train to find and kill Emily.Emily's parents are notified of their daughter's death, though her stepdad wonders why she wasn't with her dog at the time, because she never went anywhere with her dog. Emily had a wild side, hanging out with the wrong people, but then she met Owen, who was a nice guy but lost his job on Wall Street. He didn't seem to care that he was unemployed, and he spent all of his time partying and sailing. The detectives give Owen a visit, and, panicked, Owen tries to flee on an inflatable raft. Stabler shoots at the raft, stopping Owen's attempt at escape.In for questioning, Owen is told that Emily was killed. He's surprised but says right away that he didn't do it. He ran from the police because he was smoking a joint and didn't want to get caught. Drugs are found on his boat, but no evidence that Emily had been living there for awhile. Owen confesses that he's a dealer, and that he was sailing from Tampa with the drugs when Emily was found. Owen gives them the address to Emily's apartment.Benson and Stabler search the apartment, finding Emily's dog and also a number of jewelry gift boxes from Tiffanys. Her computer reveals her profile on a website called Tasty Sugar. They go to Ad-Vance United, the company behind tastysugar.com. Lizette, an assistant with the company, tells them that the website is like social networking with a romantic twist. Her boss, Vance Shepard, is told about Emily's murder, but Vance refuses to give up any of her personal information without a warrant.Emily's profile appears to have been wiped from Tasty Sugar, but the tech uses the Wayback Machine website to find a copy of her profile. Her profile also states that she can do double-dating with another girl named Pamela. Stabler posing as a client, meets Pamela, and it's learned that the Tasty Sugar website is basically a place where sugar daddies can meet potential sugar babies to spend all their money on. When Stabler asks about Emily, Pamela locks that down because Emily was stupid and fell in love with someone. Which turns out to be Vance.Vance is brought in for questioning and he's eager because he has nothing to hide. His home life is pretty much a wreck. His wife Joyce is a hypochondriac who \"faked\" having breast cancer for attention, going so far as getting a mastectomy. His daughter Chantel is starved for attention and isn't getting it from her dad. Vance says that he loved Emily and wanted to be more than her sugar daddy, but they had a fight and he ended up breaking up with Emily on the same day she was killed. Joyce tells the detectives later that she thinks Vance is immature and combative when he doesn't get his way. He was never physically abusive but was mentally abusive to her and to Chantel.Vance sticks to his story that Emily ran out of his apartment and that he stayed at home for 90 minutes before going to dinner with his assistant, Lizette. Before Vance can be questioned further, however, his lawyer (Dwight Stannich) arrives with video evidence that Emily was alive and well when she left Vance.ADA Paxton is furious that they have to release Vance, and there's a discussion about the difference between prostitution and having an actual escort service, and the difference appears to be the amount of money and gifts exchanged. Paxton suggests going to talk to Lizette the assistant again, even though the detectives say that she knows nothing. Paxton (with Benson and Stabler in tow) goes to Ad-Vance, and Paxton puts pressure on Lizette, pointing out that her impressive boob job (a gift from Vance) would make her a very grateful girl. Grateful enough to do anything that Vance told her to do. Vance arrives, upset that someone is out to harass one of his employees. Paxton points out that they're going to search through all the surveillance footage at Grand Central and eventually find Vance standing on the platform, and it's only a matter of time. Vance tells them to leave, but Paxton says she's already done her job. It wasn't Lizette she wanted to make worried; it's Vance.SVU is about to sort through hours of video from the train station when Lizette arrives and says that she can't lie for Vance any longer. She and Vance had dinner, but he arrived late, and he was out of breath and distracted. His shirt was bloody. He said that he was hit by a taxi and gave the shirt to Lizette to get dry-cleaned. Lizette still had the shirt, and she thinks that Vance killed Emily. After Lizette's confession, Vance is arrested.Vance is in interrogation and he confesses to killing Emily. He gave her everything and she still went back to an old boyfriend. Paxton realizes that Vance doesn't have his lawyer with him and tries to stop the interrogation. Vance says he doesn't need a lawyer, and he just wants to confess to the crime. Paxton just wants to do everything by the book, which means that he has to have a lawyer present even as he's saying that he killed her.At the arraignment, Vance pleads guilty but his lawyer pleads not guilty. The argument being that it was a crime of passion and Vance can't be held responsible for what he did. SVU is combing through the video footage at Grand Central and while there is evidence of Emily at the station, there's no evidence of Vance. However, there's something strange about the images of Emily, because in one shot, it doesn't look like Emily.Chantel killed Emily because she was jealous that someone around her age was spending all this time with her dad while she and her mom were basically being ignored. Vance found Emily's body and immediately decided to take the blame for her murder, because he thought that was how he could finally show Chantel that he loves her. He takes the blame for making Chantel into a cold-blooded killer. Chantel posed as Emily when getting on the train, but then the train was delayed, which made her nervous enough to dispose of the suitcase containing Emily's body. Vance asks to see his daughter one more time, and he hugs her, but she ends up stabbing him in the neck with a pair of scissors, saying that he'll never break another promise to her again. Vance bleeds to death, with Benson and Stabler in shock, and Paxton on the brink of crying."
    },
    {
      "episode_title": "Unstable",
      "nth_episode": 24,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/unstable-1294183/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "corpus": "Nate Kendal, an officer working in another precinct, arrests a meth user who might have killed a 3 month old baby. Kendal spots a woman running in the street, with a bedsheet wrapped around her, and goes after her. She tells him that she's been raped. Benson and Stabler are brought in to investigate the assault, and Kendal immediately butts heads with SVU. The rape victim (Rena West), will only trust Kendal and no one else. So Benson and Stabler must bring him in to help with the case. Kendal gives up some of the details about the perp that the victim told to him, but doesn't want to continue being on the case because it's not his concern and he doesn't like dealing with victims. Stabler appeals to Kendal's sense of justice, and Kendal agrees to help bring Rena in.At first the victim is cautious and doesn't want to have to testify at the trial, which would mean reliving the assault over and over. Stabler tells her that if the man isn't caught, he'll be free to do this over and over again to more women. Rena doesn't seem to care. Kendal manages to talk to her and gain more information about the assault. Stabler has misgivings, saying that Kendal's not used to talking to assault victims, but Cragan counters that at least Kendal is getting her talking. Benson is wary and suggests that they keep a close eye on Kendal if they're going to work with him.Since Rena was attacked after she bought groceries, the investigation moves to Domingo Deli and Grocery, where it's discovered that the surveillance camera there doesn't work. However, there's a guy in the apartment across the street who watches over everything and never forgets a face. When Benson and Stabler go to the apartment. They meet Spencer, who is autistic and takes videos of the people who come in and out of the store as a form of socializing. Benson shows him the sketch of the suspect, and Spencer pinpoints when the man was at the store. Meanwhile, Rena is shown a photo array of suspects and she points out the same man Spencer did.Facial recognition IDs the suspect as Mark Foster, who was in prison for aggravated assault for beating up his ex-wife. When Benson and Stabler go to talk to Foster, (who is working at a meat packing plant) he starts to run off. He doesn't get very far because Kendal drives up and hits Foster with his car. Once Foster is brought in, he claims that whenever a white woman is raped, a black man is brought in as the potential suspect. Foster also has an alibi. Despite his wife having a restraining order against him, he decided to visit her anyway. Stabler keeps on with the questions, but then Sonya Paxton (the new Executive ADA) says that they've gone over the amount of time allowed to question a suspect without a lawyer present. Cabot is in Albany for training and when she's done, she's going to take over Paxton's spot in Appeals.When Stabler tells Paxton that Rena was shown the photos of potential suspects in an array, Paxton says that showing the photos one at a time would be a better way to present them, since victims can only take in so many details at once. Most mis-convictions are from witness misidentifications so whatever steps they can take in order to stop putting innocent people in jail would be fine by her.The detectives go to talk to Foster's ex-wife (Layla), but find Kendal already there and physically threatening her. She's a crackhead who is unable to confirm that Foster was there when he said he was. There's a report of a case from 10 years ago with a similar MO and similar evidence, and the perp received 25 years in prison for it. It was one of Stabler's old cases, which surprises him, since if Foster was the real purp, then Stabler got an innocent man (Victor Tate) wrongly convicted. However, there is no way to connect the two cases because the evidence from 10 years ago (green fibers from the interior of a '90s van) was all used up by Forensics.Stabler goes to talk to the victim of the 10 year old case, Katie Harris. She doesn't know why she has to go through this again when she'd already told her story at the trial 10 years ago. She ID's Tate again from an array of photos. Stabler is starting to doubt that they got the right man, but Fin counters that it's not his fault. It was the entire system that failed if Tate got wrongly convicted, and the blame shouldn't rest on the shoulders of a single man.Two more alleged victims of the rapist are discovered, but since they were prostitutes, the victims gave false names and the perp was never charged. One victim is now dead, but the other has turned her life around and became a court reporter. However, she refuses to cooperate because she knows what happens in sexual assault trials and she doesn't want the same thing to happen to her.There's another case, and this time it's not just rape. The victim (Lynn Rivers) was brutally killed and mutiliated after the assault. The victim also had a cell phone with a lot of missed calls from a person named Angelina Lupino. The detectives assume that since Foster is locked up, there must be another perp, but it's discovered that Foster was let out on bail. They go to question Angelina, who says that Lynn was sent to get beer because she was the only person who had a fake ID. However, the store owner refused to sell liquor to Lynn. Warner does a post-mortem on the body and finds that the weapon was a knife with a long, tapered blade.They find that Paxton's father owns a van which matches the description of the car the perp used. The detectives also find a large amount of knives, and Paxton's father explains that he was a butcher for 40 years, so it's obvious that there would be a lot of knives in the house. When asked about the van, he says that he keeps it parked in a garage next door. Kendal notices smoke from outside, and the detectives find Foster in the middle of setting the van on fire to destroy evidence.Foster confesses to the crimes, and Stabler goes to talk to Tate, assuring the man that he'll be able to get him out of prison since the true perp of the assault has been found. Though at first doubtful that Stabler will help, eventually Tate comes around. Later, Foster is taunting Stabler, saying that he did a sloppy job and basically pointing out how he made a mistake in arresting Tate 10 years ago. Kendal offers to take Foster to the tombs, but Foster says he needs to go take a leak. Meanwhile, Rena arrives and asks to see Kendal, but Benson reminds her that Kendal doesn't work in this precinct. She also tells Rena that she can't use Kendal as a crutch forever and it would be better that she get some counseling. A crash is heard from the men's room and Kendal is found looking out of one of the windows. Below on the pavement is the body of Foster. Kendal claims that Foster jumped.Warner says that Foster's neck had been broken, but it's impossible to tell whether that happened before or after he hit the ground. Benson suspects that Kendal killed Foster, but Stabler counters that at least Foster won't be roaming the streets anymore. Paxton tells Stabler that without Foster's testimony, Tate will have to stay in prison. Stabler asks for Paxton's advice on what he can do for Tate, and Paxton says there's nothing he can do now."
    }
  ]
}