{"episode_recaps":[{"episode_title":"Influence","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/influence-730604\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After Jamie Hoskins falsely accuses two classmates of rape after a consensual act then hits nine pedestrians during an attempted suicide, medical tests reveal she has been taking medication for bipolar disorder and stopped her pills a week earlier. Jamie is charged with murder and released on her own recognizance after she agrees to take her medication, but after rock star Derek Lord, who is well known for his negative views on psychiatry, gets involved and begins spearheading her defense, Jamie again stops taking her medication. Novak is sympathetic to Jamie, but Jamie's insistence on following Derek Lord's advice leaves Novak with no choice but to take the case to trial."},{"episode_title":"Web","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/web-730605\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Fat","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/fat-715551\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Fault","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/fault-687296\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Venom","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/venom-677569\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Ken Randall calls Benson for help after he's picked up in an alley late at night. He claims that he was looking for a body after overhearing a man talk about murdering a woman and dumping her body while he was at the bar that night. Tutuola is upset that no one informed him, and determined to clear his son's name even though Ken immediately gets his own lawyer. Tutuola turns his eye on Ken's cousin, Darius Parker, who was with Ken that night and has been in and out of trouble for years, and after Ken voluntarily submits his DNA to clear his name, a shocking family connection between Darius and Ken is revealed. Darius confesses to having murdered the woman and her baby, but his confession is out because no one had contacted his lawyer."},{"episode_title":"Class","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/class-672828\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After Carolyn Pereira's body is dumped in an area frequented by prostitutes, Stabler and Tutuola soon realise she had far more money than a student on financial aid should have had, and learn that she was deeply involved in the worlds of online gambling and high stakes poker. Suspects include the Gloria Culhane, the roommate who ended up with the very expensive ring that Caroline stole from a star athlete, Roddy Franklin, the star athlete who had his ring taken by Caroline, and Adam Halder, Caroline's best friend from childhood who turned out to be her backup during her online gambling forays. Stabler makes a special plea for Halder, feeling like he and the young man have something in common because both were boys from the wrong side of the tracks dealing with rich kids who treated them like dirt."},{"episode_title":"Gone","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/gone-653422\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"The episode begins with the detectives arresting Doug Waverly, who is about to leave for Brazil with his father, at the airport, as well as arresting Nick Pratt and Jason King at their high school. The three are arraigned and Novak accuses them of the rape and murder of visiting Canadian student Jennifer Durning, who had disappeared two months earlier. Despite Novak assuring the arraignment judge that they had enough evidence to get an indictment on these charges, the judge decides there is not yet enough evidence to hold them and releases the three teenagers on bail after arraigning them on the charge of endangering the welfare of a minor (for security footage which shows the trio giving underage Jennifer alcohol). Waverly, Pratt and King's parents are easily able to pay bail, and the boys go free.Back in the squad room, Novak admits that they don't actually have enough evidence to charge the trio with rape and murder, but as a tip to the police hotline alerted them to the fact that Waverly was trying to leave the country, they had to act.The detectives run through everything they know about the case so far. Jennifer Durning was at a nightclub with her friend, Dana Simpson, where she met the three boys on the night she disappeared. She left the club with them and later that night returned to her hotel room. She received a phone call shortly afterwards which lured her out of the hotel and she was never seen again. In the early hours of the morning, the trio were seen at a diner, from which they reported their car stolen to police, and the detectives suspect they dumped the car, but can't figure out who would have driven them from Jennifer's hotel to the diner.As they are running Novak through all this, DA Arthur Branch walks in and starts questioning her on why she promised an indictment when there is no evidence. He tells everyone that they had better get a confession or find Jennifer's body soon.As an excuse to get the suspects into the station and to question them, they pretend that the Medical Examiner's Office is closed while it is cleaned for some sort of contamination, and have the ME come and collect DNA from the suspects at the station. While they wait for the MEs to arrive (late, to give the detectives more time), they show the boys footage made at the nightclub by Jennifer's friend, security footage outside the club which shows them all getting into a car together, and security footage from Jennifer's hotel, which shows her clearly upset. They tell them about Dana Simpson's statement; that Jennifer called her when she returned to the hotel and told her she had been gang raped, and that Jennifer's clothes, which she had changed out of when she returned to the apartment, had been tested and had the DNA of three males on them.Jason refuses to say anything to the detectives, despite the evidence, because he refuses to do anything that will get his cousin, Nick Pratt, in trouble. Nick Pratt and Doug Waverly have no such qualms, and are quick to place all the blame on Jason for the rape and the murder.Jason's lawyer pleads with Novak to cut his client a break, insisting that there is no way he is guilty. He mentions that Jason takes piano lessons at Julliard, and Novak realises that the phone call which tipped the police off to Doug Waverly's attempt to leave the country was made from a pay phone near Julliard. Jason admits that he made the call, and tells Novak that after they had dropped Jennifer back off at her hotel, Pratt and Waverly wanted to kill her, but he had left the car at that point.Jason testifies at the grand jury, telling them that he and Jennifer had consensual sex, but that Nick Pratt and Doug Waverly had then raped her. It was Nick's idea to kill her to keep her silence. With his testimony, Novak is able to get and indictment against Pratt and Waverly, and Jason becomes very upset that he betrayed his cousin. His parents decide to take him away to the mountains, to get away from everyone.The DNA evidence comes back- Nick Pratt & Doug Waverly's DNA was on the outside of Jennifer's jeans, consistent with Jason's version of events. But a male pubic hair was also found on the toilet seat in Jennifer's hotel room, which did not match either of them or Jason. Novak decides not to bring it into the case, as it could be unimportant.During the trial, Detective Stabler testifies about the investigation, and the defence lawyers bring up the hair found in the hotel room. Judge Donnelly calls everyone into her chambers, where the defence argue that they have a very good reason for wanting to bring the hair to the jury's attention, and they tell her what it is only once Novak has left the room. It seems to be a valid reason, as Donnelly rules that the hair can be brought in as evidence. In an attempt to find out who the hair might belong to, the detectives start looking through hours of footage from the elevator in the hotel, and Munch spots a man in a coat and hat getting off on Jennifer's floor, who returns to the elevator later carrying Jennifer's coat. They guess that he was able to enter her room by using the key from Jennifer's lost purse, which they weren't able to locate.They locate the man, Keith Willis, who is a well-known local drunk, and who has Jennifer's passport and other belongings in his possession. He is able to identify Nick Pratt and Doug Waverly from their photographs and tells the detectives that they paid him to make a phone call to Jennifer telling her that he had her passport, which lured her out of the hotel. He says that he saw Pratt and Waverly grab her and put her in their car.Unfortunately, Willis is demented, probably from alcohol abuse, and believes it is 1989 and he is a Bulgarian diplomat- not a reliable witness. Stabler and Benson decide to question Jason about whether he remembers seeing Willis that night, but when they arrive at the house his family are renting in the Catskills, they discover that he is missing. No one was supposed to know about his whereabouts, but there are a set of car tracks in the driveway which do not belong to any cars that Waverly and Pratt have access to, and no sign of a struggle.Novak takes the news of Jason's disappearance very hard, as she feels guilty for forcing him to testify. Arthur Branch is furious that there is a leak somewhere which gave away the information about Jason's whereabouts, but they decide that it is not in SVU or the DA's office, which only leaves Judge Donnelly's staff. Branch insists that they can't stop the trial now, because double jeopardy would apply. Novak tries to buy time for the detectives to find Jason by putting a long line of character witnesses on the stand who talk about what a nice girl Jennifer Durning was. The defence tire of it, and Donnelly agrees and gives Novak one day to bring Jason up as a witness.That night, Branch and Novak go to visit Donnelly at her house and make her step outside while they talk, in case there is a bug in her house. They tell her about the leak, and she admits that she doesn't know her staff very well yet. They go to the courthouse and a police tech guy scans Donnelly's chambers, finding a bug placed on the bookshelf, which would have picked up Donnelly mentioning Jason's whereabouts on her Dictaphone. Donnelly says that unfortunately, she cannot rule a mistrial unless they have actual evidence that Jason has met with harm. As Novak has no other witnesses, and the evidence she has presented does not meet the burden of proof, Donnelly has no choice but to dismiss the charges against Pratt and Waverly.Although there is no longer anything they can do to prosecute Jennifer Durning's murder, the detectives begin questioning Donnelly's staff, trying to find out what happened to Jason. They find out that Emily McCooper, a court officer, had been in Donnelly's chambers 'to use the bathroom', and the receiver for the bug was found in her locker. Someone had bought McCooper a new Mercedes, but the detectives were able to track down her old car, and the tires matched the tracks outside the house where Jason was staying and had Jason's blood in it. McCooper admits that she has been sleeping with Nick Pratt and that he had asked her to drive him and Doug Waverly to Waverly's father's produce warehouse.The police guess that they dumped Jennifer's body somewhere near the warehouse, which is their comfort zone. They realize that the diner where they ended up on the night of Jennifer's murder is across the bridge from the warehouse, and they might appear on toll booth camera footage.Munch and Tutuola look through the footage and find Nick Pratt and Doug Waverly in the back of some man's car. They track down the driver, and he tells them where he picked the boys up from. The detectives finally find their original car, which had been towed, in the police impound lot where it had been sitting the whole time. The boot is covered in Jennifer Durning's blood.They go to where the car was originally towed from, and find that it is next to the river. They find Jennifer's shoe, but her body has probably been swept away. They are able to find Jason's body, though, because it snagged on the bridge. The episode ends with Nick Pratt and Doug Waverly being arrested for Jason's murder, just as they were celebrating getting away with Jennifer Durning's murder."},{"episode_title":"Manipulated","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/manipulated-629769\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Uniform police officers respond to a 911 call and, at first, accidentally go to the wrong apartment, where students are filming a horror movie. In the real apartment, they find the body of lawyer Vicki Riggs, who has been raped and murdered and her engagement ring stolen.Detectives Benson and Stabler initially suspect Vicki's fiancee, as the 911 call reporting the body was made by a male. However, a voice-print comparison shows that he did not make the call.Benson and Stabler then talk to Vicki's boss, wheelchair-bound Tessa McKellen, who says that none of Vicki's cases really would have put her in danger, except for a pro bono case involving dancers at a strip club run by the mob, who were claiming for insurance.The detectives do not suspect a mob hit, but they speak to the manager of the Foreplay Club, only to be told that he and Vicki had come to an arrangement to allow the dancers to have insurance. Part of this arrangement, he reveals, was to give Vicki a job dancing at the club herself!Benson and Stabler talk to Josie Post, another stripper whom Vicki danced with. Josie gives them a lead in the form of Tim, a street vendor who frequents the club and who seems to have an obsession with Vicki.Stabler and Tutuola go to talk to Tim, who tells them that Vicki is his girlfriend and shows them the ring which he intends to use to propose to her. This is Vicki's stolen engagement ring, but Tim denies stealing it. He says that Vicki threw it away behind the club, after her fiancee dumped her.Benson talks to the fiancee, who admits that he knew about her stripping and had called off the wedding, but says that he only lied to protect Vicki's reputation.When Tim's voice also doesn't match that of the 911 caller, they seem to be at a dead end, until Munch shows up with photographs taken of Vicki's building by the film students. The photographs show Vicki entering her building on the night of her murder with another man; her lover.Using a database of driver's licence photos, they compare the facial features of the man in the photo and come up with a match: Linus McKellen, Tessa McKellen's husband.Benson and Stabler go to the McKellen's house where they try to question Linus, but Tessa interrupts. It becomes clear that Tessa, paralysed from a car accident for which Linus feels responsible, is totally reliant on Linus for her care. Stabler notices blood on the jacket that Linus wore in the photograph, but Tessa claims it was a nose bleed. The detectives invite Linus to the squad, and Tessa wants to go with him as his lawyer, but he agrees to go alone.Linus admits to having an affair with Vicki, and to being with her in her apartment the night she died. He says that he left the apartment, but returned five minutes later to retrieve his watch, and found her dead. He called 911.The detectives do not believe that someone else could have killed Vicki in those five minutes, and so Novak says there is enough evidence to indict him. However, Linus' lawyer argues that the ID the detectives made is inadmissable.The lawyer argues to Judge Petrovsky that the method of making IDs based on driver's licence photos is unreliable and not well enough tested to stand up in court. She agrees, and as a result all evidence obtained since that ID (including Linus' confession of being at the scene) are out.The detectives go back to the beginning and look and the McKellen's phone records. They notice that one cell phone records calls to both Vicki Riggs and Josie Post late at night. Benson and Stabler go to Josie's apartment to talk to her about the calls, and break down the door of her apartment to find her raped and murdered.With the door still chained from the inside, the only way the killer could've entered the apartment was through the very high window. The CSU techs determine that the killer entered through a neighbouring building, climbed to the roof, climbed hand-over-hand along a wire to the roof of Josie's apartment building, then sort of abseiled down the side of the building and climbed into Josie's apartment through the window.Although the DNA from Josie's rape kit matches Linus, he denies ever having slept with her but says that he and Vicki sometimes used her apartment to get together. Benson and Stabler start to believe that Linus is innocent, and has been set-up, possibly in an attempt to hurt Tessa, who is reliant on Linus.They go to see Tessa, who is in hospital with pneumonia, and ask her if any of her clients might have a grudge, but she won't break privilege. They delve into her cases anyway and find that she lost a case for a military contract firm called Silverhammer, which was forced to fire employees due to the expense of their loss.Silverhammer give them a list of all the fired employees, one of whom, Walter Inman, has a criminal record for domestic violence and assault. When they attempt to talk to Inman at his apartment, he makes a run for it and abseils out the window, down to the street where Munch and Tutuola are waiting. They manage to arrest him, but not without a struggle.Inman is not about to talk, but Warner reveals that in running extra tests on the DNA from Josie Post's rape kit, she found saliva matching Tessa McKellen mixed with Linus' semen. They realise that Tessa has probably orchestrated the murders. However, Tessa's lawyer argues that her saliva was transferred to Josie by conversion.When they discover that Inman spent his money earned from the two hits on his daughter's college education, Novak is able to get him to talk by promising to allow him to transfer enough of the money to continue to pay his daughter's fees before the money is taken away. He admits to killing Vicki and Josie for Tessa, although he made a mistake in assuming that Linus was having an affair with Josie, also. He also admits to stealing bacteria from a lab for Tessa, too, and has a list in her handwriting of what she wanted. He says that she willingly injected herself with it.Benson and Stabler arrest Tessa, and Huang interviews her. He comes to the conclusion that Tessa has Munchausen's Syndrome, a mental illness where a person pretends to be sick or even makes themself sick to gain attention. This diagnosis gives rise to Tessa's defence, which is that she is psychologically unfit to stand trial. When Tessa gives herself a seizure in the courtroom during the competency trial, the judge agrees with the defence and Tessa is sent to a private hospital.In a bid to expose Tessa's lies and manipulation for what they are, Benson and Stabler visit Linus at their house and ask him whether he had been to the doctor with Tessa recently, and he admits that Tessa hasn't let him go with her in years. Finally realising the truth, Linus grabs Tessa in her wheelchair and pushes her into the indoor swimming pool. She swims to the edge and climbs out, not paralysed after all. Her lies exposed, she can now stand trial for ordering the murders of Vicki Riggs and Josie Post."},{"episode_title":"Taboo","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/taboo-584144\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Blast","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/blast-594362\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Infected","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/infected-536500\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"A boy, Nathan Phelps, witnesses his mother's murder from a closet where he is hiding. During the investigation, he becomes close to Olivia. They eventually find out who killed Nathan's mother, a man named Ted Carthage who runs a charity and also has paid women and girls to have sex with him. They bring Carthage in for a line-up, but Nathan can't identify him. Later, he's having lunch with Olivia at a restaurant across the street and he sees Carthage. He realizes that he's the man who killed his mother and runs across the busy street screaming at him. Olivia reaches him before he can do any harm, but later Nathan goes to the place where he works and kills him.In court, Nathan's lawyer uses as a defense a study that shows that people who see gun violence are more than twice as likely to commit violence themselves. When she cross-examines Olivia, Olivia agrees that although seeing gun violence might not justify committing murder, it might explain it. Casey decides to agree to a plea bargain. They are in court about to agree to the plea bargain when a lawyer paid for by the National Gun Association serves them with a restraining order and ordering Casey, Nathan's attorney, and Judge Donnelly to be defendents in a civil case. The judge in the civil case orders an evidenciary hearing on the study. The man who did the study testifies, and the lawyer hired by the NGA then calls Nathan Phelpd to testify. Nathan's lawyer objects, but Judge Donnelly tells Casey to ask for a recess. During the recess, Judge Donnelly tells Nathan's lawyer to let him testify because it will violate his fifth ammendment right not to have to incriminate himself, and the criminal case will have to be dismissed. Nathan is called to testify and the NGA lawyer eventually makes him admit that he hates the man who killed his mother. Nathan's lawyer then asks for a mistrial. The judge in the civil case tells her that she can't ask for a mistrial because it's a hearing, not a trial. She then says that she was asking Judge Donnelly, not him. Judge Donnelly grants the mistrial and Casey asks for the hearing to be dismissed because if there's no trial, there's no need for an evidentiary hearing. The hearing is dismissed and Nathan doesn't have to go to jail and gets a foster family."},{"episode_title":"Alien","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/alien-536497\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After young Sean Hamill is stabbed in the back at the schoolyard, detectives are led to Charlie Monaghan, the older boy who had previously gotten into trouble over Hamill, but it isn't long before their attention turns to Monaghan's half-sister Emma Boyd. Hamill had been torturing the little girl for months because she had two mothers. After getting a nice deal for Emma's side, Benson and Stabler are thrown for a loop when Emma's biological grandparents accuse Zoe, who had never legally adopted Emma, of sexually molesting the little girl, and evidence seems to support their claims."},{"episode_title":"Storm","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/storm-552220\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Rockabye","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/rockabye-552216\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After sixteen-year-old Lauren Westley loses her unborn child due to a severe abdominal beating, her father's insistance that Lauren was raped leads detectives to the baby's father, but it isn't long before the detectives realise that Lauren was an active party in her own beating, and the two teens had found it necessary to take the steps they did because the abortion clinic kept putting off Lauren's request for an appointment. Novak faces a tough opponent in her own office when she and Branch disagree over the appropriate action to be taken against Wayne Mortens, the young girl's boyfriend."},{"episode_title":"Starved","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/starved-536495\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Name","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/name-536498\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Raw","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/raw-536496\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"A shooting at an elementary school playground leaves three children wounded. Two of the victims are Jewish and the third is African-American, which suggests the incident is a hate crime. The African American victim, Jeffrey Whitlock, later dies at the hospital.Benson meets Jeffrey's parents, Mark and Jana Whitlock. The couple, who is white, had adopted Jeffrey a year earlier. Mark is a corrections officer at Rikers, which raises the possibility that Jeffrey's murder was inmate revenge. Mark tells Benson, although he has received his share of inmate abuse and threats, every guard there does.The shooter had taken his ammunition with him, but his precision sniper rifle was left behind to avoid being caught with it in his possession. The serial number is intact, which leads to a gun shop owned by Brian Ackerman. At the shop, Stabler and Munch find Brian's teenage son, Kyle, cleaning up after closing for the day. At their insistence, Kyle allows them to go inside. Wondering why Kyle is there alone, the detectives see a light in the basement and go downstairs. There they find white supremacist propaganda everywhere and a woman named Star Morrison. She insults Munch when she realizes he is Jewish. After she slaps him, they arrest her for assaulting a police officer. They also take Kyle to the station because they can't leave an underage youth alone. Morrison tells Stabler she just helps out in the shop after hours. She mentions Brian Ackerman also has a mail-order business. He leads a white supremacist group, Revolution Aryan Warriors, or RAW for short. Thoroughly indoctrinated by his father, Kyle proves to be as racist as Morrison.DNA in sweat found on the sniper rifle's scope leads to a convicted felon, Brannon Lee Redding. SVU arrests him at his apartment, which is a shrine to white supremacy. He says the rifle had been stolen from him.SVU learns Redding had been released from Rikers recently and had bought the rifle from Brian Ackerman's shop four days before the school shooting. Although the two men share racist ideologies, Brian had never visited Rikers. Mark Whitlock also denies knowing Redding and vice versa.Redding tells Novak he has no connection to RAW. She pressures him by telling him getting to trial for Jeffrey Whitlock's murder will take a year, he will be held in Rikers until the trial begins, which is plenty of time for someone to try to kill him. Even inmates have standards, one of which is zero tolerance for child murderers. Redding capitulates, and Novak and his attorney reach a plea bargain.At his trial, Redding asks to change his initial not-guilty plea to guilty; however, the judge refuses to accept the plea bargain. Redding explodes in racist fury as he is removed from the courtroom. From the courtroom's spectator section, Star Morrison picks up where Redding left off and she is arrested for contempt of court. Redding tries to strike another deal with Novak. He admits his ties to RAW, and tells her Brian Ackerman had given the rifle to him and had him shoot Jeffrey Whitlock. Star Morrison came into the gun shop just as Redding was leaving, and he had assumed she was Brian's girlfriend.Stabler tells Morrison that Redding said she had been present when Brian Ackerman gave him the rifle. The two men knew each other well enough that Redding revealed he had just been released from Rikers. Brian told Redding that RAW tracks race traitors, and a white Rikers guard named Mark Whitlock had adopted an African-American boy. Brian also provided Redding with the boy's picture.Brian Ackerman will be charged with conspiracy to commit second-degree murder, and Star Morrison will be called to testify at his trial. She tells Stabler she will not testify. Subpoenaed by Novak, Morrison appears at Brian Ackerman's trial and takes the witness stand. When she is asked to state her name, she asserts her Fifth Amendment right against self-incrimination. She won't budge, and the judge finally lets her step down without testifying. Redding takes the stand next. Midway through his  testimony the cry \"race traitor!\" rings out, and a bullet catches Redding in the chest. Kyle Ackerman, in the courtroom's spectator section, suddenly has a gun. He continues to fire, and is joined by an armed fellow RAW member disguised as a court employee. In the shootout that follows, several people are hit, including Munch and Stabler. Kyle is moving in on Stabler for the kill when he himself is brought down by Morrison, who has reached for a dropped gun. As additional court officers rush in with their weapons drawn, Morrison quickly identifies herself as a federal agent.\"Star Morrison\" is actually FBI agent Dana Lewis. The Feds have their own interest in RAW, to which end Lewis had infiltrated the group five months earlier. The reason she could not testify at Brian Ackerman's trial is now apparent. To maintain her cover she would have had to lie on the witness stand, starting with her name.An FBI sting on a skinhead terrorist group linked to RAW is successful. The federal raid reveals some interesting information that Lewis delivers to Benson. The two officers visit Mark and Jana Whitlock at home, and ask them about two life insurance policies totaling $750,000 that the couple had taken out on Jeffrey.  The average value of a policy on a child is only $50,000. The Whitlocks had paid the $350 monthly premium despite having filed for bankruptcy only two years before. They had filed the insurance claim only five days after Jeffrey's death. In the raid on the skinhead group, the FBI found documents that mentioned Mark Whitlock by name. He had pledged one-third of a $750,000 future insurance payout to RAW. Mark, not Brian Ackerman, had provided Jeffrey's picture to Redding. The Whitlocks had adopted Jeffrey for the purpose of killing him for the insurance money. After the true motive is exposed, Jana Whitlock makes one last feeble attempt to defend herself and her husband by saying,  \"We're not racists. We just needed the money.\""},{"episode_title":"Strain","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/strain-522514\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Ripped","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/ripped-512773\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":"17-year-old high school baseball player Luke Thomas Breslin is accused of hitting classmate Pamela Sawyer in the face and tearing her clothes. Pamela has been a good friend of his since second grade.Stabler and Fin respond to the call. Luke becomes angered during an initial interview, and punches Fin.It turns out that Luke's father is Stabler's former partner Pete Breslin, and Stabler hasn't seen Pete in years. Later, at the station, Luke actually can't remember anything about what happened.When it comes to what Luke did to Pamela, she says Luke has never done anything like that before. Stabler talks to Pete, who mentions that his wife Lily left him and Luke, and moved to Michigan six years ago. Stabler has arranged for Luke to talk to Dr. Huang.Stabler finds Benson, Cragen, and Novak discussing the case. An angry Benson wants to put Luke away, and Novak says that with the evidence they have, which includes some of Pamela's blood on the shirt of Luke's baseball uniform, they have enough to go after Luke.Stabler tells Novak, Benson, and Cragen that that's a lot of work for a misdemeanor. Novak says she'll put it in motion, and Cragen tells Stabler to immediately get Luke into the system. Huang arrives to talk to Luke, and Pete and Stabler talk. Stabler tells Pete that Cragen said to get Luke into the system.Pete says Luke has colleges and major league baseball scouts looking at him. Stabler says Luke probably wouldn't do any time. Pete says that if Luke gets convicted, he'll have to report it to every college and major league team that looks at him, which means they won't want him, and Luke's life would be over before it gets a chance to start.Stabler advises Pete to call a lawyer, leaving Pete angry. Cragen confronts Stabler, who had told Pamela's parents that she was better off not making a complaint. For that, Cragen angrily sends Stabler home.Huang learns that Luke has been juggling baseball and a 3.8 GPA. After talking to Luke, Huang thinks he might be bipolar. Huang says that if Luke is bipolar, he needs to be on medication.Cragen says that Novak, who might be facing a psychiatric-based defense, needs to know if Luke has a history of blowing his stack. Benson talks to Pamela, who says that she's never seen Luke get angry before, even at times when he should get angry.Pamela says that nothing Luke does is ever good enough for Pete. For example, when Luke gets an A on a test, Pete says it should've been an A+. First game of the season, Luke pitches a two-hitter, and Pete says it should've been a no-hitter. And after Luke had an operation, the doctor said that if Luke didn't stop playing all year round, he'd never pitch again. Pete blamed Luke, and told Luke that it wouldn't have happened if Luke had worked out more, and then he gave Luke money to join a gym.Fin talks to Buster Flynn, who runs the gym, and Buster says that Luke worked out \"like a fiend\" until last week. Buster says Luke got into it with one of the gym members, because he thought the guy was being too slow on the bench press. Luke slugged the guy. Luke tried to slug the guy again, but Buster jumped in and broke it up, and Buster hasn't seen Luke since.Fin and Buster check Luke's locker at the gym, and they find steroids. That's what's been making Luke do things he wouldn't normally do, and that's what's been helping him balance baseball and his GPA. Buster agrees to allow an undercover cop to be put in his gym to see if anyone there is selling the steroids.Later, Cragen tells Fin and Benson that he put in an undercover request to narcotics, and he was told that Narcotics doesn't see steroids as a priority. Huang agrees that Luke must have been in a roid rage when he attacked Pamela. Benson realizes that Luke is trying so hard to satisfy Pete, and Luke thinks steroids will help him do that.That night, Benson goes to Stabler's house and apologizes to him for her attitude. Benson tells Stabler about the steroids, how Luke's been doing them for six months. Stabler wants to tell Pete about the steroids, but Benson thinks that'll make the situation worse. She says Luke begged them not to tell Pete. Benson says Luke's arraignment is first thing in the morning, and then Benson leaves.On the next morning, in the court room, Pete learns about the steroids. Luke is released into Pete's custody to await trial, and Novak has no objection to the release.Pete angrily takes Luke out of the room. Stabler follows, and finds Pete in a restroom, hitting Luke, and saying what a failure Luke is, telling Luke that it looks like he can't be a man without using steroids. Stabler tries to get Pete off of Luke, but Pete slugs Stabler. Stabler throws Pete off of Luke, and, in a rage, Stabler punches Pete several times.Stabler goes to Dr. Rebecca Hendrix's house for help, feeling that he had nowhere else to go for help, as his wife Kathy left him and took the kids with her last year. Stabler tells Hendrix what happened in the restroom. Stabler also explains that when Kathy left, she said she was tired of him being angry all the time.Hendrix asks him how long he's been at SVU, and he says 12 years. Hendrix mentions that the average stay at the SVU is two years. It turns out that the rage Stabler felt when he beat Pete up stems from how Stabler's own father treated him when he was a kid. Pete has similarities to Stabler's father.On the next day, Stabler goes to Pete's house, and finds a bullet hole in a front window. Drawing his gun, he goes inside and finds Pete bleeding from his head. Stabler rides in an ambulance with Pete. Pete admits that Luke's always been a great kid -- and then Pete goes into cardiac arrest for a couple of seconds before coming out of it. Pete's pulse is 180.Later, at the hospital, Stabler is told that the bullet lodged in Pete's skull, and didn't hit his brain. But Pete had a reaction to the epinephrine that the medics gave him in the ambulance, and it has affected his heart. The doctor believes Pete had steroids in his system.Cragen arrives, and he's not angry at Stabler anymore. Stabler tells him what the doctor said about Pete being on steroids. Cragen says that since Munch and Fin are at Pete's house, he'll have them look for the steroids. Later, Stabler visits Pete, and asks him how long he's been doing steroids.Pete says \"You remember that highway cop last year on Staten Island? Perp took his gun and shot him.\" Stabler says \"Kenny Teachen. Sure.\" Pete says \"He was my next partner after you. 43 years old. He got soft and got himself killed. I wasn't gonna let that happen to me.\"With realization, Stabler says \"Taking the 'roids to keep your edge on the street.\" Pete says \"You gonna tell my C.O.?\" Stabler says \"Pete, crime scene found your stash. There's no way to keep that quiet.\"Pete says \"It was bound to happen anyway after our fight. I knew I was gonna get fired, lose my pension. That's why I tried to end it.\" Stabler, suspecting something, says \"Pete, don't lie to me.\" Pete says \"I'm not lying.\" Stabler asks \"Where are the powder burns on the side of your head?\" If Pete had shot himself, there would be powder burns. Stabler asks \"Where's Luke?\" Pete says \"He's my son.\"Benson opens the door and gets Stabler's attention. Outside the room, Benson says \"Luke's fingerprint is on the trigger of Breslin's .38.\" Stabler asks if Luke's been picked up, and Benson says Cragen wanted her to get Stabler first, because Luke may be armed -- Pete's duty weapon is missing. And Luke and Pamela were both absent from school.They go to Pamela's house, where cops who are already there say they got a call about someone in the house with a gun. Benson and Stabler open the front door, guns drawn. They go to an upstairs hallway, and see Pamela in her bedroom, sitting on her bed. She signals that Luke is in there, with the missing gun.Stabler tells Luke that he's going to come in without his weapon. Stabler hands his gun to another cop, and slowly goes in. Luke is pointing the gun at his own chest, and Pamela tells him not to do it. Benson gets Pamela out of the room.Luke, in tears, explains that after what happened in the restroom, his aunt took him to her house, but Luke wanted to talk to Pete, so Luke went home. Luke walked in, and Pete laid into him about the steroids again. Luke told Pete that he can't make Luke stop taking them if Pete's taking them himself. Luke admits to Stabler that he had taken the steroids from Pete's bedroom. Luke explains that he admitted that to Pete, and Pete told him to get out.Luke admits that he was so angry that he grabbed Pete's old .38 revolver, went back to the living room, and said \"Dad, look at me. Look at me.\" But Pete wouldn't look at Luke. The next thing Luke knows, Pete's on the floor, bleeding. Luke says \"He was right.\" Stabler asks \"About what?\" Luke says \"I'm a failure.\"Stabler, walking toward Luke, says \"Listen to me. You're not a failure.\" Luke says \"I am.\" Kneeling down by Luke, Stabler says \"I know you're scared and you may think this is the only way out of it, but it's not. Luke, it's the steroids. When was the last time you took them?\" Luke says \"I took them over a week ago.\"Stabler says \"You're going through withdrawal. This is why you're so depressed.\" Luke says \"I murdered my father.\" Stabler says \"He's alive. Luke, he's alive.\" Luke says \"Please don't lie to me. I shot him in the head.\" Stabler says \"No, it grazed him. He's gonna be okay.\" Luke says \"There was blood all over the floor.\"Stabler says \"Listen to me. I just talked to him an hour ago. He wanted me to tell you that he's sorry. He said all of this is his fault. You're the only good thing in his life.\" Luke says \"No. He wouldn't say that.\"Stabler says \"You'll have to take my word for it. Let him tell you himself.\" Luke says \"I can see him?\" Stabler says \"He wants to see you.\"Luke gives up the gun. Stabler takes Luke to visit Pete at the hospital. Pete takes Luke into his arms, and says \"I'm sorry.\""},{"episode_title":"911","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/911-504792\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Design","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/design-488547\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Demons","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/demons-458781\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"svu","corpus":""}]}