{"episode_recaps":[{"episode_title":"Screwed","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/screwed-996773\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Pretend","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/pretend-996779\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"When a man who is part of a crew preparing a house for demolition returns to get something he left behind sees a light and approaches the door when it opens suddenly and he is knocked down and he sees someone wearing an S & M mask. When the one in the mask leaves he goes into the room and sees another person also wearing a mask dead. SVU is called in. When they take off the mask they see that person is a teenager.They find instruments that sppear to be used in underground fighting. Warner says he bleed to death, he was probably struck by one of the instruments and a major artery was struck. Outside there's a crowd, Fin talks to one of them who tells them that there's a convicted sex offender living in the neighborhood. Fin and Munch go to the apartment and find that some sprayed rapist on the door. The landlord tells them where he works. Stabler and Benson go to speak to him and he denies their allegations. They go to the woman who spray painted his door who tells them that her son is missing and suspects that he had something to do with it. They take her to identify the body and she says it's her son. Cragen was about to send someone to arrest the guy when a young man comes in saying he has video of the boy who was killed. Cragen, Stabler, and Benson watch the tape while Munch and Fin interview the boy, Scott Heston. Cragen and Stabler deduce that they were staging a fight so that they could put it on the internet but things went out of control when the boy who was killed, Riley was struck in his vital artery. Stabler goes into the interview room and listens as Scott says that the other guy was someone he never knew who knew Riley. But Stabler tells him that when Riley was fighting the other guy the camera was still which meant no one was holding it. So that means  Scott was the other guy. Scott is brought to trial and the defense tries to put on a defense claiming that Scott was acting out over his depression. After the trial while the jury is deliberating, a girl, Cassandra Sullivan approaches Casey telling her that she is Riley's girlfriend and that Scott had some kind of obsession for her. The jury somes back and finds him guilty of negligent homicide. After the verdict is read, Scott stares at Cassandra which Casey notices. Later she goes to her home and asks her to tell her what happened between Scott and Riley. She tells her that she and Scott had sex once and Scott was hounding her. Casey asks her to speak at Scott's sentencing. Stabler and Benson go to see Scott about what Cassandra said about which he denies.At his hearing Cassandra doesn't show and Casey is worried. Later they learn she was hit by a car. Stabler goes to the Transportaion office to find out what happened and they find a photo of Cassandra being hit. The driver in the car Stabler recognizes as a friend of Scott's. Stabler interrogates him and he admits Scott paid him to hit her.Benson goes to see Cassandra in the hospital, the doctor tells her that while she was  treating Cassandra she discovers that can't be a teenager, that she has to be in her late 20's. They check her out and find out that she has been pulling some kind of scam wherein she claims to be a teenager to get into foster care. When Stabler and Benson confront her about it she denies it.Later Scott's lawyer shows up at SVU insisting that Cassandra or whatever her name is to charged with raping Scott. Stabler thinks this is just a ploy for his defense of Scott at his trial for what he did to her.Stabler and Benson tell Casey they learned that 12 years ago she was placed in foster care after being abused by her parents. And apparently liked it that she didn't want to give it up. Casey has her thrown out of foster care and arrested for fraud. She goes to see Cassandra and offers her a deal which would get her probation but she refuses. At her trial, after Scott testifies, she examines him and attacks him which leads to the judge declaring a mistrial.Later Casey brings one of the her foster parents to her who shows her photos of her when she stayed with them. She acts ungrateful to the woman. Later Stabler and Benson enter and Casey tells them she'll refile and hopefully she'll accept her offer. But they say that she might have to face other charges in other cities. When news of her came out some of her other victims have come forward while the statute of limitations has run on some of them there are still some that she can be prosecuted for. When they show her the photos of her victims. She claims she loved them all. But they ask her why she left them. She amswers cause they got older and she didn't"},{"episode_title":"Annihilated","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/annihilated-996778\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Stabler and Benson investigate the murder of a woman who appears to have been raped also. They find a wedding dress and the date marked on the calendar. Warner says her neck was snapped. Stabler recognizes it as something the military would train their soldiers to do. They find no photo of her fiance. They go to her parents who tell them that her fiance works for the government as a spy. They do give them the only picture they have of him. They say that he claims that a terrorist group is after him, which is why he keeps a low profile. When they run his name they're told he is dead. Munch says that's how the government wants their spies. They ask around and learn that the terrorist group he said is after him wouldn't operate in the U.S. They go back to SVU and Munch discovers that the man just loaded his cellphone in a Staten Island convenience store. They go there and the clerk recognizes him but doesn't know his name but tells them where they could find him. They go to the Royce residence when they ask the wife if they heard of the man they're looking she doesn't know him. She asks her husband Malcolm to come out and they see that he's the man they're looking for. They bring him in and when they tell him his girlfriend is dead he acts shocked. They're incredulous. They're about to let him go when Fin tells them that his car pass shows that he came to the city on the night of the murder. When they talk to him, he tells them that the car wasn't with him on that night, his wife had it. Cragen will try to keep him there until they have a chance to talk to her. They go to her, and she's upset that her husband cheated on her. When they ask her where she was on the night of the murder, she claims that she went out cause she's sick and tired of being a housewife. They talk to one of her fiends who tells them that she found out about her husband when the travel agent whom he bought a trip for him and his girlfriend called and looked for him under his alias. She tells them that she was planning something but not divorce because they're Catholic. When they go back to see her, they find all the children dead, shot and when they go into the master bedroom they find her on the floor with a gun in her hand and her husband on the bed shot but still alive. They go to the hospital to question him and he tells them that his wife pointed the gun at him and they struggled with which is why he was only grazed. He then freaks out when they tell him about his children. Stabler then goes to see his children after seeing them, he is about to leave but Kathy asks him to stay and he does. The next day one of his daughters sees him and asks him if he knows what he is doing. Halloran brings Stabler to the bedroom to renact it. If there was a struggle the bullet wouldn't have ended up where they found it. But if he shot himself...Stabler goes back to the hospital to arrest him and finds him on the roof standing on the ledge. Stabler talks him in and arrests him. Back at SVU, Huang says that he killed his family cause he feared that he was going to lose them. Stabler then goes to interrogate him and Stabler knows that he pretended to be a spy and had a girlfriend because like his wife, he was unsatisfied with his life. But when his girlfriend wanted to get married everything unraveled. And he still doesn't want to admit to anything. Later Halloran comes in with books he found that are of spying and a manual on various assassination techniques. Which explains how he learned how to break his girlfriend's neck. And also Halloran says that he only found his finger prints on the box the gun was kept in. Which means he handled the gun. Novak decides that she has enough to charge him. Cragen tells Stabler he's done. Stabler's about to leave but blocks the door cause he wants to talk to him. Stabler puts the same hold he placed on his girlfriend till he admits he killed them all. Satbler walks out and goes to the elevator and leaves."},{"episode_title":"Florida","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/florida-996777\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Benson and Stabler are interviewing a rape suspect when Olivia starts getting in the man's face, Cragen comes in and asks her to come with him. She goes into his office and finds FBI Agent Porter, the man who handled her when she was working undercover, there. He tells het that he's come to talk about Simon Marsden. It seems that he is now on their fugitive list. He asks her why she helped him. At first she doesn't want to say anything. He then shows a photo taken of Simon receiving a money order and he tells her that it seems that a money was sent from near where Olivia lives and while he hasn't check the surveillance tape, he tells if she's on it...That's when she tells him Simon's her half brother. Porter then tells her to call him if she hears from him. And he tells her that the camera was broken. Before she asks who turned her to him. While he doesn't come out and say it, he implies that it's Captain Millfield.Olivia then goes to see Millfield to tell her to leave her alone. But it seems that Millfield is determined to get Simon. Later Olivia returns to the squad room and Elliot tells her that the suspect they were interrogating wants to speak only to her. When she goes into the inteerrogation room. The guy provokes her saying that she is just looking to get back at someone who wronged her. That's when she loses and starts beating him. Cragen comes in and pulls her out. He berates her for her actions and she retorts and leaves. Elliot tries to talk to her but she doesn't want to talk.Later Olivia gets a call from Simon who asks her to meet him. She calls Porter who accompanies her. When she meets Simon he is hoping that she will help him but she doubts that he is innocent. When Porter tries to get he runs away and they chase. When he runs into an alley and they follow him, a car comes out and nearly runs it over. And Olivia says it's Simon's car. They go baco to Olivia's and look at some the things Simon gave her, which includes photos of her that their kept. While looking through they find Simon's old address. They arrive hoping to speak to his mom, Sharon but are told by the nurse at the door that she suffers from Alzheimers. She also tells them that Simon did visit her but will most likely not know anything. They go in and speak to her. She recognizes Olivia from the pictures that her husband Joe had of her. She asks what Joe said about her, did he try to contact her. She tells her that he tried to call her but her mother answered and hanged up. When they ask where Simon is, she tells him that he is on Florida on Route 94, Joe left Simon his house there. When they try to talk to her some more her condition surfaces so they leave. Porter says he'll try and find the house, Olivia says to go without she has something to do. Olivia goes to the coroners office and tries to learn about her father. She learns that his name is Hollister and that he died after taking a combination fo drugs and alcohol which was ruled a suicide. She then goes to where he worked, a food distributor. The son of the owner talks to her and tells him that Joe suffered from depression and his father made Joe go see a doctor who medicated. Eventually he met and married Sharon and had Simon. But things changed when he started drinking and when Simon was almost killed because of it Sharon left him and reverted to her maiden name, Marsden and she wouldn't let him see Simon. So it was because he lost Simon that he killed himself. Olivia asks why his father kept him despite his problems. He tells her that most of their biggest clients were because of Joe. When he tells her that among them were Colleges, she asks if one of them was Columbia. Her mother was working in the cafeteria at the time and it was where she was raped. She goes to Huang to talk about it. She tells him that she did research on other rapes committed at the same time and found 2, wherein the victims were also working in cafeterias at colleges at the time and the mo is the same. Olivia wonders what made him stop. Huang tells her that his employer made him see a doctor for his depression which was when the rapes stopped. Olivia tells him rapists don't just stop. Huang tells her that the medication he was prescribed for his depression killed his sex drive and that his depression is what made him rape to begin with. But Huang deduces that there is more. She shows him the photos he kept of her and wonders if her mother was really raped. Huang tells her she has to face what her father was. She then goes to one of the victims who tells her that Joe did rape her. Olivia is going into her apartment when Milliken shows up. She wants Olivia to tell her what she knows. They go to her office and Olivia tells her about what Simon's mother said. When Millfield's calls her she leaves Olivia alone who sees the file on Donna Leonte, the woman Simon supposedly raped. Olivia takes a photo of the hair found on her that supposedly belongs to Simon. When Millfield returns Olivia pretends to get a phone call and leaves. She calls Halloran to meet her in the lab and shows him the photo of the hair that was supposedly pulled by victim of her attacker. Halloran tells her that the hair in the photo was pulled but rather one that fell on it's own. Which means that it was planted. Olivia goes back to talk to Millfield but is told she is on breavement leave because her sister whom Millfield claims was also raped by Simon died a few days ago of a drug overdose.Olivia leaves the station and finds Elliot and Porter waiting for her. Elliot tells her Halloran told him about what she asked and deduced where she is. She asks Porter if he found Simon. He tells her that it was red herring. But Olivia believes that Sharon knew what she was talking about. When they mention Route 94 in Florida; Elliot thinks she was mixed up that she probably meant Route 94 to Florida which is a road sign in the Catskills. Olivia realizes that it is near where Simon use to live and Millfield knows it. She also tells them that Millfield framed Simon. Porter tries to find the house. When they get there, they see the car that nearly ran them over when they were chaisng Simon. They approach the house when they hear a shot. Olivia and Porter enter while Elliot goes around. They enter and find Millfield on the floor and Simon holding a gun on her. Olivia tries to talk to him but he doesn't trust her. When the local police and FBI arrive, Olivia calls Elliot on her cell and leaves it open so they can hear them. Olivia tells Millfield she knows she framed Simon. Millfield claims Simon tried to kill her but Simon says it was an accident. She came in with her gun trained on him and he grabbbed it and it went off. Simon still refuses to surrender and when he hears Porter freaks out. He orders Porter to leave and Olivia to come in unarmed. Which she does. When they hear the conversation and Elliot thinks it's getting shaky decides to go in. Olivia asks him why did he try to run her over with his car. Simon says his car is in the shop. The car outside was driven by Millfield. Olivia says it was Millfield who tried to run her over. She was trying to get Olivia to see that Simon's sum. When Elliot goes in Olivia stands between him and Simon. Simon accuses Millfield of trying to ruin his life and Millfield retorts that he ruined her sister's. Simon denies what she is accusing him of. Olivia asks him to describe the night he was with Millfield's sister. Whe he says he just kissed her then she freaked. Olivia says that she was reliving a traumatic experience. She then asks Millfield if her sister ever spoke about being molested. At first she denies it but later admits she did say something once but didn't believe her. Because she was accusing her father who didn't touch her. But Olivia tells her that sometimes that's what happens they pick one. And Millfield continues blames herself for her sister, saying if she only believed her. Olivia says the only one who is at fault is her father. Millfield admits that Simon's shooting her was an accident. Olivia asks her about Donna Leonte saying that Simon raped her. She convinced her to say Simon raped her. Simon then hands the gun to Olivia and go out. Millfield is taken away in an ambulance and they're told she will be okay. Olivia asks the FBI Agent if he will charge Simon and says after the mess Millfield made, he doesn't need the hassle. Porter takes Simon to his office to get his statement. And before leaving Simon apoogizes to Olivia who does the same. And Olivia thanks Elliot for being there."},{"episode_title":"Responsible","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/responsible-959844\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"When a couple who have been on vacation return home, they find a dead girl in their room. When it appeared the girl may have been sexually assaulted, SVU is brought in. Warner tells Stabler that the girl was not assaulted and that the girl did because she was drinking and vomitted and died from suffocating on her on vomit.  Stabler and Benson interview the couple who tell them that they don't have any liquor because the husband is a recovering alcoholic. They then ask if anyone has a key to their residence. They say that prior to leaving on their vacation they hired a dog walker to come in a couple of times a week to take care of their dog. But they discover that their was not taken cared of. Stabler and Benson go to the walker who tells them that because she has so many clients she passes some of them to high school students and the one she passed the couple to was a girl named Becca Rice. When they go to speak to her, at first she says she doesn't know who the girl is. But when mother comes home, who tells her to tell them what she knows. She says that she gave the key to the place to a girl at her school Regan Michaels. Also there is another student from her school Jordan Owens, whom she tutors who reveals that he was at the party but doesn't know the girl. He then shows them the website that tells people of the party. They see on the website the dead girl and learn her name is Melanie Tamkin. They go to her parents who tell them that she is not a drinker. Later the detectives go speak to Regan and two other students, Mark and Luke who were the hosts of the party. They say that Melanie came and tried to drink but passed out. They tried to wake her up but couldn't. When they tell Novak, she wants to hold them responsible for Melanie's death and find out how they got the liquor. When they are arraigned, Judge Donnelly decides to let them go on their own recognizance but orders them not to drink. Mr. Tamkin who was there gets upset and Stabler takes him and begs Elliot for his help. Later Stabler is having a meal with his daughter when he discovers that she is still drinking. He then asks for her to find Regan and the others when they announce they are having another party. Eventually he goes to see Becca who tells them where they are. They arrest them, Regan, Luke, Matt, and Jordan. Stabler and Novak storm into Donnelly's chambers upon learning that she let them go again. It's after Elliot lets out on Donnelly that she retorts with his interceding for his daughter when she was arrested for a DUI. That's when he gets a call and tells Donnelly that she has to see something and that is the four of them on a blog being drunk and insulting Donnelly who orders them picked up. Looking for Jordan they go Becca's thinking he was there but she tells him that he is not scheduled for tutoring today. They go in and find him in bed with her mother. Becca freaks out. They take them in. Both try to justify the whole thing. It is then that Regan, Matt, and Luke are brought in. After speaking to Becca's mom Benson tries to talk to her but runs out. After their arraignment, Becca confronts Jordan who tells her that her mother made the move not him which she doesn't believe. After she and her mother leave, Stabler talks to Jordan who finally admits it was Becca's mother who provided them with the liquor. Later Stabler gets a call saying that Jordan was in an accident. When he arrives he finds that Regan was with him. They discover that he was drunk but Regan wasn't. They try to talk to Becca but refuses, she blames them for Jordan's death. She tells that he was with her before he died. They suspect that when he was with her he was drinking but can't get her to admit. At the memorial service for Regan and Jordan, after hearing some lame eulogies, Stabler stands up and tells everyone that Jordan was drunk and noone knew or did anything. After they leave, Luke comes out and tells them Stabler is right. That's when he tells them that Becca is also a drunk. Stabler shows up at Becca's with a social worker. He gives her a breathalyzer test and discovers that she has a high blood alcohol count. The Social Worker takes Becca away while Stabler arrests her mother. Her mom along with her lawyer go to Donnelly to try and get the charges dropped. But Novak states that Becca is an alcoholic and her mother allowed her to be one. Donnelly instructs Novak to get corroboration from Becca or she is throwing it out. Stabler visits Becca at rehab who admits to being sober for the first time in months. He asks her how she started drinking. She says that she wanted to escape from her problems and says that's what her mother did. And that when her mother caught her, she didn't freak out, she joined her. He asks her if her mother was the one who the alcohol for the party and she says yes. He then asks on the night Jordan died when he was with her did he drink, she says yes. She testifies in court but her mother's lawyer badgers her on cross examination that she breaks down. They go to see Novak to gloat that her case is getting weaker but she tells that he must be proud going after a teenager. Becca's mother refuses to accept resposibility for her alcoholism. Later Novak had Warner describe how Becca's drinking has affected her health. After hearing this Becca's mother stands up and admits to everything, even providing the alcohol for the party wherein Melanie died. Later Stabler is eating with his daughter again. It is then that he brings up her DUI arrest and feels that she should own up to it so he takes her license and burns it."},{"episode_title":"Sin","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/sin-996776\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Philadelphia","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/philadelphia-959843\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"The episode starts as Elliot Stabler is talking to a psychiatrist. She informs him everything he tells her in confidential and she will use his information for a recommendation. Stabler tells her that Olivia Benson is experienced, professional, and good with the victims. Benson and Stabler are next seen in New Jersey outside of a house. Benson is looking through binoculars when New Jersey police find them. The Jersey Police ask what Benson and Stabler are doing in New Jersey if they're from Manhattan. Benson says that she is not at liberty to tell them what case they were working on. They are then informed that they are not at liberty to return back to Manhattan and are taken to the New Jersey Headquarters. In the car on the way, Stabler tells Benson that he is there to make sure that she doesn't do anything stupid, but Benson tells him that what she is working on is personal.Benson is talking to the psychiatrist. She tells her that she knows why she must talk to her, but doesn't agree with it. The psychiatrist asks Benson what Stabler is like, in which Benson replies by saying that he is the best -- smart, brave, and dedicated. She also says that she could tell him anything.Benson is then seen at the New Jersey Police headquarters. She still keeps closed-mouthed and refuses to tell why she was in New Jersey. Captain Millfeild, the captian, then informs her that she is free to go, and that Captian Cragen knows all about it and informed her they'd never come back to New Jersey.At the precinct, Cragen asks Benson and Stabler what they were doing in New Jersey. Benson and Stabler make up an excuse and say they were working on a four year old case. Cragen doesn't believe them, but informs them that while they were A.W.O.L, a man was raped.Benson and Stabler go to talk to the rape victim, whose name is Ronnie. Ronnie describes the rapists, but refuses to testify because he doesn't want his wife to find out.Benson and Stabler go back to the precinct to tell the squad that Ronnie won't look at mug shots or testify. Munch points out that every van that the rapists drove was different for each rape and that they must be stealing one for each attack. Cragen tells Benson and Stabler to take Ronnie for a walk in the park and see what he remembers. Benson gets a phone call and says that she won't be able to go.Benson goes to Huang's office, where he greets her with Simon Marsden's records. He tells her that his DNA is the in the record because he shoplifted when he was younger. Huang asks what else Benson knows about him, and she tells him what she saw the other night in New Jersey. Huang asks what she is really looking for. She tells him it's personal, but he guesses that it has something to do with her father. Benson then tells him that Simon Marsden is her brother and that they have the same father.At the precinct, Cragen asks where Benson is. He is answered by Stabler, who tells him that she had some urgent personal business. Stabler says that they found two possible vehicles involved in the attacks. Tutuola says that their next step is to run survelience on the park. They remember that the attacks took place on Friday and Saturday nights and since it was a Saturday, the rapists would most likely attack again. They decide to parole the park, but Cragen worries that they might not have enough people without Benson.Benson goes to visit Marsden's girlfriend, Lucy, in New Jersey. Lucy informs Benson that Marsden is not home. Benson suggests that she and Lucy should talk and gives Lucy her number.Meanwhile, Stabler is shown talking to the psychiatrist again. He informs her that even though Benson is under stress, it's nothing that she can not handle.As Benson is leaving Lucy and Marsden's house, Captain Millfield finds her and tells her that Benson promised she was stay away. Millfield takes Benson to a bar, where she asks Benson what else she knows about Marsden. She also tells her that she thinks Marsden is stalking women, and without help from Benson, she is stuck. Benson tells her that she's working tonight and leaves.Benson then meets Stabler in a parole car. As they watch for the van the rapists are driving, Stabler notices that something is wrong with Benson. She tells him that Marsden might be a rapist, like father like son. She also tells him that she regrets looking for him, and that she has been alone her whole life. She appologizes for whining, and Stabler consoles her by telling her that family is everything. Tutuola calls Benson and Stabler over the radio and informs them that he and Munch spotted a suspicious van. Stabler says that he and Benson will split up in to two different cars and follow the van.As Benson gets in to a seperate car, her cell phone rings. It is Lucy, Marsden's girlfriend. They plan to meet at a bar the next night. Over the radio, Stabler gives Benson specific instructions to go east on Seventy-Second street. Benson juggles between her conversation with Lucy and turns west instead of east. Stabler finds her and yells at her, asking why she went the wrong way. She said that she did not hear his instructions, and he asks her why she gave him the indictation that she did hear by saying, \"Copy, El.\" Benson then hears over the radio that another man was raped and she goes to the hospital.At the hospital, the victim described the rapists and the attack, but refused to identify them.Back at the precinct, Cragen asks Huang for help. Huang points out that only the first victim was gay. He also thinks that the rapist raped because he was raped in the past. They come to the conclusion that the rapist must be an ex-con, because men get raped in prison. Cragen commands them to check the victim's description against recent paroles to see if any match. Munch and Tutuola leave, and Cragen confront Benson and Stabler about the previous night. He asks how the rapists got away, and Stabler covers for Benson by saying that he gave her unclear directions. Cragen doesn't believe him, so he goes to the Technical Assistance Response Unit. There, he listens to the radio tapes. He finds out that Benson was talking to somebody on the phone and wonders who it is.Benson goes to the bar to meet Lucy, but is surprised when Marsden shows up instead. She automatically backs out and says that meeting him was a mistake and that she thought he was someone else. Marsden suspects she's lying, and tells her that he did research on the net. He found out that Benson was a police officer, and accuses her of being with the cops who are watching him and making his life miserable. He recognizes her and asks if they had met before. She tells him again that she had made a mistake.Back at the precint, Stabler asks Benson if she saw Marsden, She tells him yes, and that it was a mistake. Cragen then informs them that the rapist's van was found. Benson and Stabler go to the scene of the van, where they find out that there is a soda can with prints on it. That leads them to find the rapists, who turn out to be two brothers.Now that they have the rapists, Benson and Stabler go to the victim, Ronnie's, house. Ronnie tells them once again that he is not testifying. He is mad because he might have HIV and he is getting married in two weeks.Back at the precinct, Cragen scolds the squad. He tells them that they don't have a case. Benson starts to tell him that if the victim won't talk, they won't have a case. Cragen tells Benson that it is her job to make the victims talk -- a job she used to be able to do. Stabler defends Benson by asking Cragen if he has a problem with them. He tells them that he listened to the radio tapes and is upset with them. Tutuola then walks in and gets scolded by Cragen. He tells him he had been talking to a CO at Attica, and he found out that their perp, Bobby Trapedo, belonged to a prison gang. They owned him. Cregan tells Tutuola and Munch to get the cons on tape.Elliot is next seen talking to the psyciatrist again, where she asks him how far his loyalty to Olivia goes. He tells her that once, he chose to save Olivia and a boy died. The pysciatrist asked what Benson would do, and he tells her that she would have to ask her.As Benson is opening the door to her apartment, she is stopped by Marsden. He tells her that he followed her from the precinct, which makes her think that maybe he was stalking the women. He shows her a picture of herself from the newspaper when she was in high school, and he tells her that he found it in his father's things. He then shows her a picture of his father, and Benson tells him that his father raped her mother. Marsden denies it at first, but Benson explains that rapists often lead double lives. She tells him that she found him by chance, and that she's not connected to the cops that are watching him. He denies that he ever did anything, and he could never hurt a woman. She brings up that he once stole women's clothing when he was a kid, and he tells her that it was for his girlfriend.As they are sitting on Benson's couch, he gets to know her. He asks her her preference in ice cream, cereal, and movies. Benson says that her mother is dead and that she is pretty much on her own.In the middle of the night, Benson is called to a crime scene by Millfield. One of the women that Marsden was supposidly stalking was raped, and Benson tells Millfeild that it is impossible that Marsden had done it, because he had been at the apartment.At the station house, the victim identifies Marsden. Benson then doubts that Marsden was ever telling the truth.Back at the precinct, Cragen questions Benson's relationship to Marsden. Benson informs him that Marsden is her brother. He then questions Stabler's involvment in her search for Marsden, but neither Benson nor Stabler tell the truth. This makes Cragen angry, and orders them to go home. Munch informs Cragen that they found tapes from Bobby Trapedo's fellow inmates, stating that he was raped in prison. Novak and Huang threaten to use the tapes to send into Dateline, causing Trapedo to confess to raping the men. Benson is next seen talking to the pyschiatrist again, who asks her if she would choose Elliot over a member of the public. Upset with the questioning, Benson leaves.Stabler shows up at Bensons apartment offering her company. While there, he discovers that Millfield's sister went to school with Marsden. They then question Marsden to find out if he had any connection to Millfield's sister. In high school, he dated her. The date went too far, and Millfield's sister accused him of causing her great emotional pain. Marsden denies causing any pain to her, but Benson doesn't believe him. He then tells her that he could never lie to his big sister.Benson and Stabler go meet Millfield, where they tell her that they discovered the connection between her and Marsden. Millfield denies knowing that Marsden was the same man that dated her sister in high school, but neither Benson or Stabler believes it.Later, Stabler gets a message that Marsden had jumped bail. He questions Benson to see if she knew anything about it, which offends her. She informs him that she would never interfere with an investigation. Cragen informs Benson and Stabler that they will have to go through a psychiatric examination to see if they are fit to work together. Both are unhappy with it, but know that they are forced to. As a result of the psyciatric exam, Rebecca Hendrix, the psyciatrist, informs Cragen that Benson and Stabler have a mutual reliance and an emotional dependence for eachother, but splitting them up would just cause SVU to lose their two best detectives."},{"episode_title":"Haystack","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/haystack-967358\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Dependent","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/dependent-959842\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"As Sidney Truex walks his son, Tommy, home from a friend's house, he wonders why his mother was not called instead. Tommy informs him they had tried calling her, but she was not answering the phone. Truex believes she was asleep. When Tommy asks him when he is moving back home, he responds that he hopes it will be soon. Truex tries to explain that, although he and his mother, Maura, are not together, they still love him very much. Once in the home, Tommy asks him to stay the night. Truex makes him a deal. If he goes straight to bed, he will tuck him in and read his favorite story. While they are having their conversation, someone comes up behind them and hits Truex on the head with a lamp. Tommy runs screaming in search of Maura. When he gets to her bedroom, he finds his mother unresponsive on her bed covered in a sheet. He runs back, pushes the panic button, and sits in a doorway cuddling his teddy bear.As Benson and Stabler make their way up the stairs, Warner explains Truex is still unconscious at Mercy. At hearing the name, Benson verifies they are talking about the mob attorney. Warner informs them he had been hit on the head. The security company found him on the floor when they responded to the panic button. The alarm was either not set or Truex disarmed it when he came in. Maura had been raped, sodomized, and bludgeoned, and she slowly bled to death. There is no DNA because she had been assaulted with a candlestick. Stabler notes the perp has anger issues before asking about forensics. A partial bloody tennis shoe print is pointed out. Warner tells them the only other person not accounted for that lives in the house is a 16-year-old daughter, Charlotte, but she is not home. Stabler wonders where she is at one o'clock in the morning. Warner tells him Tommy had indicated to her that Charlotte was spending the weekend at a friend's house. Stabler asks if Tommy saw the attacker. Warner tells him Tommy is pretty traumatized, so patrol waited for them to interview him. When Benson asks her where Tommy is, Warner wordlessly points the way.Benson knocks on the door jamb before entering the room where Tommy is sitting still with his bear and staring into space. She introduces herself before asking him to tell her what happened. When she leans down in front of him, she explains she needs for him to be a big boy and tell her what happened. After a brief pause, he looks at her and tells her a monster hurt his daddy. When a Cragen arrives in the squad room dressed in formal attire, Benson asks where his top hat is. He explains Councilman Baker's daughter got married and he had been paged at the after party by the Chief of Detectives to get some answers on the Truex case. Stabler believes it was personal. He does not believe Maura was a random target. Cragen wonders if there was a dissatisfied client who was sending a message. Benson wonders if the perp was after Sidney and did not know they were separated. When Cragen questions if Maura was the one against whom someone had a grudge, Benson explains she was a sales representative for Tauscher-Leto Pharmaceuticals. Stabler adds that it is difficult to run a background check on the family so early on a Saturday. He suggests they find out from Charlotte, but is told she is still MIA. Stabler adds they found the family phone book in the kitchen and are using it to locate Maura's friend. Cragen informs them he will have the CO at the 15th to post an officer outside Truex's hospital room. Tutuola interrupts them to inform them a family friend said Charlotte spends her weekends with Jennifer Brown. Stabler does not want to tell her the news over the phone and he and Benson leave so they can tell her in person.Benson tells Jennifer they need to speak with Charlotte. Jennifer claims Charlotte had left before she woke up. Benson asks where she went so early and is told she may have gone home. Jennifer's mother interrupts and asks who they are. Benson shows her badge and informs her they were told Charlotte had spent the weekend there. Her mother asks Jennifer if she lied to the detectives before telling Benson and Stabler Charlotte is not allowed in her home. She explains Charlotte was a good girl until she started lying and skipping school. She believes she may be on drugs. Jennifer's mother tells Jennifer that Charlotte is only using her to cover for her before walking away. Jennifer stops Benson and Stabler as they try to leave telling them Charlotte is not a bad person. Maura would not let her see Ryan Bedford, so she has to lie to see him. She tells them he lives at The Packard on First Avenue.Ryan answers his door after Stabler flashes his badge. Stabler explains they are looking for Charlotte before asking if she is there. Ryan asks if he is under arrest, which causes Benson to ask if he should be. He defends himself by saying her parents do not like him, but she is 16 and he is 19, and it is not a crime. When Stabler asks where his parents are, he is told St. Bart's before Bedford tells him to tell Maura he will talk Charlotte into going home and she is fine. Benson tells him they will talk to her themselves. Bedford calls for Charlotte and tells her the police are there. As Charlotte walks down the stairs, she thinks her parents had sent them to freak her out. Stabler tries to explain there has been an accident, but she thinks it is a trick. Benson tells her to get dressed and come with them. She refuses. Stabler tells her that her parents had been assaulted before telling her to get dressed. He further explains that Maura is dead and Truex is in the hospital. Bedford offers to go with her, but she tells him to stay and she needs to be with Tommy.As Huang watches Tommy draw at Stabler's desk, Benson and Stabler escort Charlotte into the room. When Tommy hears his sister say his name, he runs up the stairs and tells her to go away from him. She asks what is wrong with him. Huang explains he is traumatized from watching Truex get attacked and adds he will be all right in time. Charlotte tells them that Tommy likes their Aunt Amy in Riverdale, so they could stay with her. Huang agrees to set it up before excusing himself to check on Tommy. Benson informs her Truex is still in surgery and they will not know anything for a few hours. Stabler asks if anyone has threatened her family. Charlotte wonders if he is joking. Half the city hates Truex for the cases he tries. He had hired a private investigator because of everything that had been happening. Garbage was being spread in their garden and his car was spray-painted with curses.The private investigator shows Benson and Stabler pictures of the things done to the Truex family. Garbage is on the doorstep. Bags of excrement are set on fire on the stoop. Swastikas are painted on the front door. The family cat had been dismembered and returned in several boxes. Sidney had moved out to protect the family. They are told the suspect is Luccio Ricci. Truex had defended his father, but lost the case, and Ricci blames Truex for his family losing everything they had owned. He shows them a file of Truex's hate mail. He explains the letters were unsigned, but he had taken them to a handwriting analyst with writing samples from his trash who confirmed he had written them. Stabler notes it was enough to take it to the police. The investigator wanted to do that, but Truex felt bad for losing the case and did not want him to pursue it further. Ricci now spends his time in San Marco Hall in Little Italy.Benson and Stabler arrive at San Marco Hall armed with the picture of Ricci. They locate him immediately as he plays cards with two others. They tell him they need to talk about Truex. He tells them he charged them a fortune for losing his father's case. Benson shows him the pictures of the damage he had done. He denies ever hurting Truex. When Stabler clarifies he just threatened Truex and his family, Ricci claims he was just playing. Benson reminds him he did 18 months for playing when a jury called it aggravated assault, at which Ricci claimed he had been framed. As Benson answers her ringing cell, Stabler asks if Ricci was upset because Truex had his freedom. Ricci repeats he never hurt Truex and adds he should ask him. Benson ends her call and tells him they will asking him because he had just awakened.Benson assures Truex that Tommy was not hurt. Stabler informs him they heard about the vandalism, threats, and hate mail he suffered at the hands of Ricci. Truex assures them he stopped the harassment when he moved out. When he questions if they believe Ricci killed Maura, Benson turns the question back on him, but he does not remember. He explains the doctors think he has some temporary memory loss. Benson asks him to take them through what he does remember. He remembers walking Tommy upstairs to his bedroom. He felt a pain in his head. He fell down. He thinks he blacked out for a second. When he stops recounting the events, Stabler urges him to continue. He admits he saw Charlotte running down the hallway, which caused him to believe she had killed Maura.In the interview room, Charlotte denies being at home. When Stabler informs her that Truex had seen her there, she claims he says a lot of things that are not true and adds her father lies for a living because he is a lawyer. Benson thinks they do not get along, but she corrects her saying he is never home. The only way she knows what he is doing is by watching the news. Charlotte claims Maura's idea of parenting was to lock her up so she would not have to deal with her. Stabler notes Maura's method did not work well. Charlotte tells them she got around her rules causing Stabler to comment on her using her friends to cover for her so she could go out with Bedford. She explains she had to because Maura hated him for no reason and would not allow them to be together. Benson reminds her they know she was with Bedford on Friday night before asking what they did. She tells them she and Bedford had gone to a friend's house to get wasted. When they left there, she claims they crashed until Benson and Stabler woke them up. Stabler tells her they need the names of everyone at her friend's house, but she refuses to drag her friends into it. Benson persuades her by threatening to question every student in her school.At Hanover Day School, Jane Williams denies being at a party and claims she had been babysitting until late. One of her male friends claims he was at his house with his friend watching a game all night. Another male friend says he was home all night writing a term paper that was due the following week. Susan tells them she was at the movies with Jane until after midnight. When Stabler informs her that Jane had said she was babysitting, she changes her story saying they watched the movies while Jane was babysitting. Benson wants the name of the family so they can check out the story, and Susan admits they had a party.Stabler escorts the other three friends back to the steps to join Benson and Susan. They are not thrilled that Susan had ratted them out. Benson informs them Charlotte admitted to being drunk that night. Stabler tells them they just want to know what Charlotte did that night. One of them announces she did baby blues, but is called a moron for not realizing they meant where she was. Benson tries to clarify Charlotte was on drugs and is told \"I guess.\"Kathy Stabler answers the door to her husband, and he tells her they need to talk. She tells him she saw the news and knew he did not kill Bedford. He confirms it has been a rough couple of days. He has had time to think about what is important to him. He loves his job and he loves his family. He almost lost both. He tells her he wants to come home."},{"episode_title":"Loophole","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/loophole-959841\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"As Tutuola and Stabler attempt to arrest Cupid, a kid, Taylor, steps out of the elevator with an envelope addressed to the Special Victims Unit only to be knocked out against the wall. Tutuola yells for Munch to help Taylor. Munch suggests they shoot Cupid before checking on the unconscious boy. Cupid breaks away from Tutuola and Stabler before throwing a uniform officer towards them. When he heads towards Cragen and Benson with a bench, Cragen warns two uniforms Cupid is high on PCP giving them just enough time to move before the bench is launched their way. Stabler hits Cupid in the head with the fire extinguisher to try to stop him. Cupid throws him through the window before grabbing a chair and slinging it towards Tutuola and into another window. Benson returns from the squad room with a taser. She informs him Barbie is gone as she aims towards his abdomen. He warns Benson not to make him hurt her before she gives her final warning. He believes Benson is jealous of Barbie's beauty. When he raises the chair, she zaps him to his knees. When she stops, he pulls off the leads and begins to get up only to be stopped by Tutuola hitting him in the head with a chair. As uniform officers rush to get the cuffs on Cupid, Cragen and Benson check on Stabler. Cragen notes he has a deep cut in his arm. Benson has someone to notify EMS that an officer is down. As Stabler is being wheeled out on a gurney by EMS with Benson at his side, Cragen is informed they are being taken to Bellevue and Benson is going with him. Once they leave, Cragen notices the envelope on the floor. Tutuola informs him the kid was carrying it. Inside they find pictures of a little boy in his underwear and a note with a memory card attached to it asking them to put the guy away. In the hospital, the doctor warns Stabler that his arm will be numb after the slight pinch from the needle. Stabler informs him his arm is already numb, but is proven wrong when he feels the pinch. Cragen approaches him asking how he is feeling. When he replies that he feels like a million bucks, Benson adds it happens when you get hit by a bus. Cragen informs him Cupid is in the prison ward in steel restraints. The doctor tells them Stabler's radial nerve was almost severed. Stabler assures him he will be ready for work, but the doctor tells him he has to wait until the feeling comes back in his arm and hands. Cragen informs Stabler he would rather lose him for a few weeks than attend his retirement party. Benson tells Stabler Tutuola is talking with Taylor.From his hospital bed, Taylor asks Tutuola what happened. Tutuola tells him he picked the wrong time to get off the elevator explaining a guy in a PCP rage took him out. After explaining where he was, Taylor remembers the envelope. Tutuola assures him he got the envelope. Taylor explains a guy on the street wearing shades and a winter jacket with the hood up gave him $50 to deliver it. He was told the money was all he needed for an explanation. He pulls the bill from his pocket saying he knew it was too good to be true. In the squad room, Benson informs Cragen the bill was too beat up for prints. Tutuola adds the only prints on the envelope were his, Munch's, and Taylor's. There was no DNA. Benson adds the only other fingerprints were on the pictures, but they were not in the system. She believes the tipster's fingerprints are in the system. Cragen figures that is why he wants to go undetected, but wonders why he did not give the perp's name. Tutuola guesses he is afraid of him, like a previous victim. Benson suggests the perp is a member of the victim's family and the tipster is as well. Cragen wonders if the tipster edited out the worst of the pictures. Benson explains that they used digital image recovery software in Computer Crimes to restore erased files so maybe it would work on the memory card. Morales informs Benson and Tutuola he was able to locate JPEG files on the memory card, but the pictures were of one door from various angles. As they look at the images blown up, Benson notices writing on a truck that passes the glass door. After flipping the image and clearing it up, it reads \"Empoli Bakery.\" Morales checks the EXIF data to find out when the picture was taken and by what kind of camera. The pictures were taken with a Photo Pro 600 camera. The truck passed by at 1:46 the previous Tuesday.  As Tutuola was going through the driver's route in the Empoli Bakery truck with him, the driver turns onto a dangerous block. The driver explains he would not have went that way, but a water main broke the day in question forcing him to take the route to Columbia Presbyterian. When Tutuola has him pull over, he tells him to help himself to a snack. Tutuola gets off the truck carrying two doughnuts while Benson gets out of the car behind them. He offers her one, but she declines. A little boy, Kevin, notices the exchange and asks for the doughnut. Tutuola gladly gives him one causing \"the wax man\" to question the reason for it. When Benson shows her badge, he decides to drop it. Tutuola notes it is raining and ushers everyone inside. \"The wax man\" believes they are there about the break-ins, but they do not correct him. He explains the building has had 3 break-ins in the past month. When Benson asks about the most recent one, he wonders why she does not already know about the one a few nights prior. Tutuola explains they were too busy eating to find out the information. \"The wax man\" informs them the super is Seth Millstead. His apartment is in the basement and was the most recent one to be robbed. In Millstead's apartment while Benson is on the phone, Millstead wonders if the police communicate because he denies the break-in ever occurred. Tutuola informs him the door and \"the wax man\" say otherwise. When Millstead claims \"the wax man\" is too strung out to know anything, Tutuola request permission to look around which Millstead grants as Benson ends her call. Benson explains 2 patrol cars were sent after a call was received about a break-in to his apartment. He explains he told the other cops that he locked his keys in the apartment and it is cheaper to break-in and fix the door rather than call a locksmith. Tutuola interrupts them saying he understands Millstead's reasoning asking him to call with any more problems. Once outside the door. Benson questions why he pulled her out. Tutuola explains Millstead is lying and they do not have a warrant for his digital camera, which is the same make and model as the one that took the pictures. He believes the person that broke-in got more than they bargained for. Benson realizes they have a burglar with a conscience. As he and Tutuola walk into his office, Cragen explains he does not believe a burglar would risk prison time to be a Good Samaritan. Tutuola reminds him they did not find prints or DNA on the envelope or pictures. He suspects the perp stopped four blocks away to look at the things he stole. When he found the kiddie porn, he decided to call it in. When Cragen still sounds doubtful, Tutuola reminds him burglars do not necessarily like kiddie porn. When they arrive at the board in the squad room, Cragen questions why the guy reported his crime. Tutuola guesses he wanted to make sure they were able to link the kiddie porn to the right person. Cragen tells him the guy should have given him the address because it was luck that they found it. Cragen reminds them the guy could not have known the pictures of the door was on the card causing them to wonder why the pictures were taken. Benson explains the landlord was looking at fines because of the ten break-ins in the building within the year because of the lack of a front door. The pictures were taken to prove to the city that the door was installed. When Benson informs them Millstead does not have any priors, Tutuola reminds them he has not been caught yet. Cragen asks Munch as he joins them if the kid in the pictures lives in the building. Munch informs them his name is Diego Benitez from A-6. Munch explains he was late because he was showing the picture of Diego to the local elementary school principal. His emergency contact is his mother who is probably serving lunch.At Tenerio's Caf, Benson asks Jennifer Benitez to step down so they can speak about Diego. Benson explains they believe he may have been sexually abused. She explains the only ones he is around are his teacher and the guy who watches him while she works her other job, but she does not believe they would hurt him. When she tells him she will talk to him, Benson explains it is best that they speak with him. She assures them she will get him far away from whoever is hurting him and she will get him help. Benson shows her the pictures of Diego saying they could already be on the internet. The best way to handle it is to arrest the guy. She hands the pictures back to Benson saying she has to go. Tutuola notes something has her spooked. Benson thinks she knows it is Millstead and is afraid of him. Tutuola thinks she may be sleeping with Millstead and is trying to protect him. Tutuola reminds her they did not get permission to talk to Diego. Benson suggests they look for the 911 caller. Munch should have the tape.In the squad room, Munch plays the tape of the call for Benson and Tutuola. They realize the caller is \"the wax man\".In the interrogation room, \"the wax man\" will not stop cleaning his ears causing Tutuola to ask him to stop. \"The wax man\" explains he has a cerumen problem causing him to produce too much earwax which will clog his auditory canals if he does not keep cleaning his ears. Munch tells him he needs a hearing test before playing the tape of the 911 call. \"The wax man\" tells him he is not deaf. Tutuola points out the tape is of him talking to the police. \"The wax man\" claims he was being a good citizen. When he claims he heard the burglary in the basement because he was home, they remind him there are 5 slabs of concrete between his apartment and Millstead's. He claims he was having a good ear day. Watching the interview from his office, Cragen asks Benson where they found this guy. She explains he was hanging around the front of Millstead's building. His real name is Raymond Nesbit. He has a long arrest record for Heroine Possession. He is on parole after doing 2-1\/2 at Fulton for Burglary Two. Cragen figures old habits die hard. As the interrogation continues, Nesbit explains he watches Diego after school while his mother works. When Tutuola asks if he is into little boys, Nesbit tells him not to pin any kiddie diddling on him causing Munch to question if Diego confided in him about being abused. Nesbit denies saying that. Tutuola tells him they do not speak his \"dialect of crazy\" asking him to talk to him straight. Nesbit affirms Diego told him Millstead took pictures of him in his underwear. When they show him the pictures from the envelope, Nesbit wonders where they got them. They explain a messenger dropped them off and they believe it was the same guy who broke into Millstead's apartment. Nesbit believes the guy should keep his mouth shut unless he is able to walk on other crimes he committed. In his office, Cragen informs Novak Nesbit committed 10 burglaries in the building since he returned from prison a year prior. A crowbar was used to gain access to all 10 apartments and nothing was taken but cash. Benson suspects it was to feed his heroine habit causing Novak to say that makes it alright. She wants him arrested for his parole violation and sent back to prison. She wants to get a statement from the victim. Benson reminds her they cannot get parental consent to talk to him. Cragen informs her Nesbit is the only one who can testify kiddie porn was found in Millstead's apartment, but he will not testify unless they cut him a deal. Novak wonders what would happen if he commits an assault after they let him go and the media finds out they had him proving her point. Novak offers to let him walk on the Millstead burglary only if he confesses to taking the kiddie porn. Cragen does not believe he will go for it. Tutuola tells her they need to get a warrant for Millstead's apartment. Novak tells them they need something besides the camera. Benson reminds them the memory card has images of Diego and the front door. Novak agrees to try Judge Ahearn since she has a kid the same age as Diego.Millstead's door is forced open as an officer announces they have a search warrant. Benson approaches Millstead announcing he is under arrest for Possession of Child Porn with Tutuola by her side. Tutuola tells him it is about him rewriting history and lying about a break-in. When Benson tells him of the pictures of a boy in his underwear, Millstead notes it does not sound like any child porn he has heard of. Novak shows the Judge the pictures claiming it is child porn. Zeirko, Millstead's attorney, believes she has x-ray vision since there are no genitals or a sex act being performed. When Novak scoffs at the implication they are only family photos, Zeirko shows her a picture of his 4-year-old daughter in a two-piece questioning if it is child porn. She explains if he sells it to a pedophile, then it is. Novak argues Justice Stewart said he would know child porn if he saw it. She sites US v. Dost saying they must consider what the child is wearing and the intent of the image. Zeirko adds they must consider if the child is naked or performing a sex act. The Judge explains he is not giving a perp a free ride without researching Novak's points promising a ruling the following day. He adds she needs a statement from the victim for the search warrant to stick.Benson arrives at the Benitez apartment. When she informs her of Millstead's arrest, Jennifer wonders if he believes she talked. Benson assures her she does not need to worry he will report her illegal status. She explains she knows Jennifer's green card expired the year prior. She pleads with Benson not to send them back to Honduras adding Diego was born here. Benson explains she is there to help Diego. Jennifer allows her to enter her home where she sees a tired Diego sitting on the couch. After she introduces herself, she shows Diego the pictures of him and asks if he has seen them. He denies seeing them or knowing who took them. Benson takes her coat off after suddenly becoming hot due to the heat. Diego does not remember if anyone asked him to pose for the picture. Jennifer notices Benson is not acting right and shows concern for her well being by offering to get her some water. Once she is out of the room, Benson turns her attention back to Diego to find him unconscious. When she gets up, she is dizzy and her vision is blurred. Suddenly she hears glass breaking in th kitchen causing her to check it out. When she sees Jennifer on the floor, she moves her to the other room. She locates a window and breaks it to vent the apartment before carrying Diego and Jennifer out. She yells for help telling tenants to call for help and to get everyone out of the building before collapsing against the wall. Cragen arrives on the scene recounting to Tutuola he knows of 12 victims, including Jennifer, Diego, and Benson. Tutuola explains the other victims occupied two other apartments. Patrol evacuated the building. Hazmat is ready to go in. Emergency Services is looking for any other victims. When Cragen asks about the condition of the victims, Tutuola informs him Benson is the only one not at the ER. They make their way to the ambulance where Benson is telling EMS she does not need to go to the hospital, but is reminded they do not know what made her pass out. Cragen and Tutuola interrupt them only to be told she is refusing medical treatment. Cragen assures him Benson would not violate procedure by not going. When she attempts to convince him she does not need to go, Cragen tells him to restrain her if he has to in order to take her. Tutuola informs Cragen the Red Cross is setting up a temporary shelter for the evacuated tenants at a school around the corner. O'Halloran informs them Benson's actions stopped more people from getting sick before asking about her.As Benson is being wheeled into the ER, she hears a girl from the building screaming her desire to go home. She is told of the other two families effected being exposed longer to the poisonous vapors in the apartment. O'Halloran informs Cragen and Tutuola the gas sniffer he will be using should tell them the poison they are dealing with. When he comments it is standard for the War on Terror, Cragen wonders if they located a terrorist lab. With his first stop being the basement, O'Halloran explains TARU has him hooked up to audio and video with a monitor next to the Hazmat truck so they can watch. After the doctor orders aa blood gas and a tox screen, she orders oxygen causing Benson to wonder why she needs it. She is only told it is to bring up her oxygen saturation. As a nurse is working on her, Benson notices Diego being wheeled out on a gurney and questions his whereabouts. The nurse explains he is going to Pediatrics.O'Halloran informs Cragen he is getting a reading for VOC (volatile organic compounds). He explains there are VOCs in paint thinner, gasoline, benzine, and old floor wax. He is called over to a 95-gallon over pack container, which are designed to transport 55-gallon barrels leaking chemicals and are used for nuclear waste. The container does not have any markings to tell them what is in it, but the PID tells them it is organophosphates. The doctor informs Benson that her blood work shows she has half of the cholinesterase she should have. It is an enzyme that helps regulate the nervous system. The levels drop when you have been exposed to organophosphates. She explains she will give her a shot of atropine, which is an antedote. She should be better in 24 hours. Benson is told is told she must stay overnight in hopes they can find out which one made her sick. O'Halloran tells Cragen the PID is reading the organophosphate as unknown therefore they must notify the EPA, the Terrorism Task Force, and Homeland Security. Cragen wonders if there is a sleeper cell in the building. O'Halloran informs him the terrorists in the Tokyo subway attacks in '95 used Sarin gas, one of the deadliest organophosphates. Tutuola realizes they are talking about nerve gas. O'Halloran decides to leave the container alone and check the individual apartments. In the hospital, Benson wakes up to Jennifer standing next to the gurney. Jennifer explains she was told Benson saved them. She explains the doctors ran some tests on Diego and found cancer in his blood. The doctors do not know what caused the cancer.O'Halloran explains to Tutuola and Cragen they found the organophosphate on the heaters in all 3 apartments. He guesses it must have been sprayed in the apartments and the heat from the heaters sent it into the air. They do not know how the other apartments were not in the same condition. Tutuola needs to talk to Millstead. At Rikers Island's front desk, Officer Bates questions if Tutuola needs to speak with Millstead. When it is confirmed, Bates calls his supervisor before telling Tutuola he will have to wait. He wonders if Millstead needs time to pretty himself first. Zeirko arrives wondering why Tutuola is there. Tutuola explains he is there to see Millstead. Zeirko believes Rikers called Tutuola before calling him. As they make there way to Millstead, Zeirko explains that during Millstead's daily exercise in the yard there was a pile-up. When the guards got everyone off of Millstead, there was a sharpened toothbrush sticking out of hie rib cage. Zeirko tells him they have about a dozen suspects. As they pull the sheet from Millstead's dead body, Tutuola sarcastically comments, \"It could not have happened to a nicer guy.\"In Cragen's office as he puts his roll-a-way bed away, Tutuola tells him of the attack on Millstead. The weapon hit Millstead's ascending aorta only allowing a minute before death. Cragen notes their only lead on the toxin died with Millstead before explaining Homeland Security and the FBI took over the case adding they want Millstead's kiddie porn as well. Benson arrives questioning whether they are giving up. When she informs them she is wearing scrubs because Hazmat confiscated her clothes, Cragen tells her she could have gone home. She informs him she is not going home until she finds out what happened to her. Cragen explains they may not have that information for days and their role in the case is over. Munch interrupts telling them they should see what was found in Millstead's apartment first. In the squad room, the team watches a tape of Millstead talking to Diego. He asks him to remember 3 words before talking to him about school, which he is struggling. Munch explains the mini DV tapes were found under a floorboard in Millstead's apartment. When Novak tells him she does not need to see the boy being abused on camera, Munch assures her it is G-rated before continuing the tape. Before allowing him to go, Millstead asks for the words. Even though Diego repeats the wrong ones, Millstead tells him he did good. Munch tells them they have over 200 sessions of Diego and the other kids at the hospital. Munch informs them Millstead was getting quarterly checks from EHD Associates. He explains the company does research for chemical companies, but the offices and bank accounts disappeared 2 days prior. He explains the chemical in the basement is an experimental pesticide that EHD Associates is paying Millstead to test it on the kids in the building and the tapes are evidence of the long-term effects on the kids. When Tutuola tells him the thought is out there even for him, Munch points out that Millstead was listed as a consultant with the company. In the morgue, Warner tells Tutuola and Benson Munch is not crazy. She explains it would not be the first time a company poisoned people. She explains the government tried to pay poor families in Jacksonville, Florida to videotape the effects of pesticides on their children. The only reason they stopped was because of public protest and their own scientists. The EPA prohibits all testing on pregnant women and children. Companies get around this by using Observational Testing. If you spray for bugs, they can observe how the chemical effects them. She believes the pictures are proof of toxicity to show any rashes on the skin. When Benson questions what pesticide they are talking about, Warner explains the company has to submit all data to the EPA for final approval. While standing outside the building watching the removal of the 95-gallon container, the EPA representative explains to Tutuola and Benson that they do not know what the chemical is because they do not deal with the companies until the have all of their data ready for approval. Benson reminds him the only reason the study was not completed was because kids almost died. He assures them the EPA's hands are clean on this causing Tutuola to slam him into the car. When Tutuola reminds him of CHEERS, he explains they only used people who were already using the stuff, which are the poor. Benson tells him the chemical companies seem to be allowed to do whatever they want, but he corrects her saying they have to follow certain rules and guidelines. She does not believe the company asked for permission before exposing the families to the pesticide. He assures her the company would not open themselves to a multi-million dollar lawsuit by not getting permission. In Diego's hospital room, Benson questions if Jennifer signed a form giving them permission to spray the apartment. Jennifer explains Millstead told her she would get a hundred dollars every few months if she signed the form to allow Millstead to spray the drug in the apartment. Benson verifies she was told it was a drug instead of a poison or a pesticide. Jennifer confirms Millstead told her it was safe. Benson assures her it was not her fault because she did not know, but Millstead probably did. Jennifer tells her Diego needs chemotherapy, but she does not have medical insurance or money to pay for it. Jennifer confirms Millstead gave her a copy of the form she signed. It is in her apartment. In the Benitez apartment, Tutuola believes the EPA should clean up the apartment before they come home. Benson finds the form and begins reading over it. She understands why Jennifer did not understand it when she is having a hard time reading the legalese. She reads a portion that basically says EHD Associates cannot be held responsible for anything before turning a few pages to add Danforth Chemical, the contracting company, cannot be held responsible. Tutuola notes the big company contracted their dirty work out to the lowest bidder. Benson states she would not let a Fortune 500 company get away with this. At Danforth Chemical, Benson meets Charley Moss, attorney for Danforth Chemical, instead of the CEO of the company, Mr. Roger Hanley. When Moss claims Hanley is too busy to speak with her, Benson suggests Hanley does not have the guts to deal with her himself. After introducing herself and producing her badge, she informs him the poison sprayed almost killed her. Moss reminds her she used her position for personal business meaning she entered the building under false pretenses. She explains 11 others were also poisoned and she is there to find out what they were poisoned with. Moss tells her he cannot help her without a subpoena and suggests she leave the building. When the security guard tries to escort her out, she warns him she will arrest him for assaulting a cop if he touches her again. Moss instructs her to leave before he calls the police to have her arrested for trespassing causing her to finally leave. Novak tries to persuade Benson to hire a civil attorney to settle the matter with Danforth Chemical. Benson assures her that the fight is not about money. Novak explains Moss called the District Attorney about her abusing her power and her being on the case is a conflict of interest. Benson defends herself saying Danforth Chemical abused their power when they committed 12 counts of Assault Two. Novak reminds her the case is not an SVU case. Novak interrupts Benson's recitation of the legal definition of the charge to inform her she will have to prove intent. Benson reminds her they treated the people like lab rats adding she wants to stick it to the EPA. Novak quickly informs her federal agencies have blanket immunity. Benson wonders who they hold accountable for Diego's follicular lymphoma. Novak tells her if she were thinking like a cop, instead of a victim, she would realize it is not that simple. Benson believes it is no different from Tuskegee or Willowbrook. Novak clarifies Millstead was the one who sprayed the poison and he is dead before adding if she wants to charge Danforth Chemical she has to prove their chemical caused Diego's cancer. Warner informs Benson she cannot testify the chemical caused Diego's cancer because it is impossible to prove. Diego is the only one with cancer. The children were exposed to the chemical for two years, as well as asbestos, lead paint, cockroach and rodent droppings. The cancer could be caused by any of them, combination of them, or none of them. Cancer comes from genetics and environment. Warner adds she still would not be able to testify if they found 10 people in the building with the cancer.As Benson concentrates on her computer screen at close to midnight, Stabler arrives explaining he could not stay away for the required two weeks so he came when Cragen would not be there. When she agrees with the feeling, he verifies Cragen ripped her for her visit at Danforth Chemical. He reminds her he has spies everywhere. When he questions if she should be doing this to herself, she wonders if he thinks she should give up as well. He tries to explain he thinks it is great she is passionate about it, but is interrupted when she tells him it is easy to be passionate when you are a victim. He is glad she admits to being a victim. He reminds her she tells victims to get help, but she is not following her own advice. She explains if she hires a lawyer, Danforth Chemical will bury her in paperwork for the next ten years and Diego could be dead by then. She adds that she cannot find out what made them sick because it is proprietary information. Stabler advises her that \"Sometimes the only way to beat someone in a dirty fight is to get right down into the gutter with them.Morales is astonished at what Benson asks him to do. She begs him not to ask her to repeat herself. When he wonders why she cannot do it herself considering she worked in Computer Crimes, she explains she was not there long enough to learn. He tells her he never thought she would break the law. She says she is desperate because she got no where playing fair and she needs the information to get the subpoena. He questions whether it is worth losing their jobs and going to prison. She believes it is because it will prove a big chemical company is intentionally poisoning little kids. She assures him there will be no hard feelings if he decides not to help her.In the Men's Room at Danforth Chemical, Benson balances Morales's laptop on her knees at the same time she is balancing on her feet on a toilet in one of the stalls. When she questions their location, Morales explains he needed a signal and no one can see them in there. Once he has hacked into their system, Benson explains they need the names of any experimental pesticides in the testing stage. The computer beeps alerting them to Danforth's Wireless Intrusion Detection System. Morales explains it will get louder the closer they get to locating them. While there are no pesticides in the testing stage, there is one awaiting EPA approval. Zilithion. He shuts the computer, grabs his bag, and leaves. When Benson gets out of her position and begins to leave, two security guards come in. She tells them she thought it was the Ladies' Room and leaves. Munch and Benson make their way into Hanley's meeting despite his receptionist's protests. As Benson handcuffs Hanley, she explains he is under arrest for 12 counts of Assault with Zilithion. Hanley tells them he is not a criminal. Munch tells him what his company does to kids is criminal.At the precinct, Munch takes Hanley's mug shot. Munch tells Hanley he is done, but is told they are all done when Moss gets there. Munch tells him that until Moss gets there, he can stay in the \"prisoner lounge.\" When he requests preferential treatment, Munch scoffs at giving special treatment to a plutocrat adding they would all lose their jobs. Moss arrives telling Munch they will lose it anyway before asking about Hanley's well being. Hanley asks him to get him out of there, but Moss informs him they need to get rid of the media circus the detectives called. Benson walks up behind him denying they did saying it is against department policy. Munch tells Moss anyone could have called them because the place has more leaks than a 100-year-old water main. Moss demands to see Novak. Novak arrives to the interrogation room with Benson. Moss tells them to enjoy their practical joke because it is about to explode in their faces. She tells him the only thing bursting is his bubble. When Moss tries to say he will talk to the DA, Novak informs him the DA approved everything including Hanley's arrest. Hanley denies assaulting anyone. Benson tells him he assaulted her and 11 others with Zilithion. Moss assures them they had signed releases. Benson holds up Jennifer's copy sating it is a pile of crap that refers to the pesticide as a drug. Hanley claims his company did not do anything wrong causing Benson to question if he even cares about poisoning little kids. Novak reminds them they did not get permission from the foster family with the 3 mentally handicapped kids. Hanley tells her it was legal. Benson explains they slithered through a loophole in the EPA regulations and used the kids as lab rats. Moss does not believe they can prove Hanley had direct knowledge of any of it. Novak tells him her subpoena to his IT department will not turn up any incriminating e-mails if he did not know about it. When she notices the worried look on Hanley's face, she assures him he will go to jail. Benson shows him a picture of Diego and informs him he has cancer after breathing his nerve gas for two years. Novak tells him he will pay lifetime medical expanses for him and every other tenant in the building. In return, they will drop all charges, blame everything on the research company, and will announce publicly they are cooperating with their investigation. Benson adds the media circus will go away. When Novak tells them the offer has a half-life of ten seconds, Hanley agrees.In Mercy General's play room, Benson explains that Jennifer will have to sign an agreement to never tell anyone what happened. Jennifer agrees stating she can take care of her son now. She notes Diego looks like his father and she hopes he can be strong like him. Benson assures her he will be because he has a strong mother. Benson turns to leave, but is stopped by Jennifer wanting Diego to say good-bye. Benson wants him to play."},{"episode_title":"Outsider","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/outsider-941609\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"As Ming Hao is frantically trying to hand-wash an item in the bathroom sink, a friend bangs on the door asking for Ming to open it. Ming tells her to go away. Ming is bleeding from her nose and crying as the pounding continues. Her friend gains the assistance of their Resident Adviser Ken Randall. Her friend tells Ken that she believes Ming was raped. Ken knocks on the door and tells Ming anything she tells him will remain private. She informs him it is not a school matter causing him to tell her his father is a cop. She refuses to go anywhere causing him to offer to have his father come to the dorm. Ming does not want everyone to see a cop there. He promises her if she will talk to his father, he will help her. After a few moments, she opens the bathroom door.At the precinct, Ming tells Ken and Tutuola about her attack. She got off the subway on an empty platform and headed for the stairs. A man grabbed her and dragged her behind the pillar. He pinned her down and put his hand over her mouth. She was able to get a quick look at him to see he had a bandanna around his face before she closed her eyes. He made her tell him she liked it while he was raping her. While he was choking her, she heard people yelling stop causing him to run away. When she opened her eyes again, everyone was gone. Ken believes the people shouting must have chased the rapist. Tutuola takes the opportunity to tell Ming she is doing good before informing her the information will help them catch the guy. She does not want to go to court because her parents will find out. Ken assures her it will be okay stating she is not the first girl at Hudson to get raped. She tells them she should not have come to the station because she cannot do this before running out. When Ken acknowledges he blew it, Tutuola tells him to fix it.Ken returns to the squad room to inform Tutuola he cannot convince Ming to come back and asks what they need to do now. Tutuola informs him they cannot do anything without Ming's statement adding he cannot force her. Ken believes Ming's shock is preventing her from filing a report. Tutuola tries to explain that some victims would rather move on than to go through the rape kit, testimony, and cross-examination. Ken pleads with him to not give up. He admits he said something that scared her off and he wants to make it right.Benson approaches Tutuola stating she saw Ken downstairs. He asks if Ken told her how he screwed up. She informs him he looked upset causing Tutuola to tell her he should be. Benson reminds him Ken was trying to help and suggests he talk to her. He informs her Ming is the one throwing up roadblocks. Benson tells him to go around her. She urges him to work the case for Ken. He concedes stating he will check to see if anyone who saw Ming being attacked called it in.Tutuola asks a uniform officer why he did not file a 61 when he responded to the call about Ming's attack. The officer informs him he did not have a victim or evidence an attack occurred. Tutuola wonders if the officer is moonlighting as a crime scene tech. He explains the witnesses' description of the guy resembled the \"Unabomber\" and he has not heard of his escape. The witnesses looked stoned and were dressed like they came out of a nut house. He had his face painted and she was wearing black feathers. They claimed they just got off work at a restaurant called Joe's, Moe's, or Poe's. At Eddie Allen Poe's, Tutuola states the place looks like a freak show. The guy with his face painted tells them it is a theme restaurant while the girl with the black feathers informs them they dress like Poe's characters. She is the Raven and he is the Tell Tale Heart. Tutuola informs them he and Munch are there about the attack they witnessed the previous night. When the Raven tells them the other cop did not believe them, Tutuola informs them he believed they were stoned. The Tell Tale Heart informs them they have to be stoned to survive a night of working there. They inform them they still know a girl crying when they see it. They were on the other end of the platform so they got closer. The guy took off when they yelled. They tried to follow him, but he ducked in traffic and disappeared. When Tutuola shows them a picture of Ming asking if it was the girl they saw being attacked, they confirm it was her. The perp was wearing a navy blue hoodie, sunglasses, and a bandanna around his face. He asks them to help a sketch artist draw a composite of the guy.Ken asks Ming to look at the sketch to see if it is the guy, but she refuses. When Ken reminds her it is the only way to stop him from attacking other women, she agrees. She tells Tutuola the sketch is of the perp causing him to ask for more details. She tells him the guy talked like they were dating. He told her how good he would make her feel and that he was a good lover. He told her she is cuter than her little sister. She explains she had lunch with her and her parents, but left them around 3 and went straight to campus. Tutuola reminds her that her attack occurred at 9 and he does not believe traffic would cause it to take that long to get from Brooklyn to Manhattan. He asks if there is anything else she needs to tell him causing her to leave stating she will be late for her course.As they search the ship, Lake and Tutuola see Henry enter through a door at the end of the hall talking on a cell phone. When he sees them, he turns around and begins running. After chasing him for a few minutes, he holds an innocent boy at knife point. When they urge him to let the kid go, Henry explains he is going to make him famous. Lake tries to convince him to let him go saying no one would care about him since he is from a Third World country. He offers to let Henry take him hostage instead. As soon as the kid is out of the way, Tutuola shoots Henry in the right shoulder. Lake helps him off the ground and cuffs him as Henry questions his wound. Tutuola assures him he will live, considering it is only a flesh wound. Henry wonders if he will have a televised trial. Lake and Tutuola tell him he will. Before they can get him off the ship, they hear sirens coming. They watch as patrol cars pull up with a media van close by. Henry sees his fame is already beginning."},{"episode_title":"Burned","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/burned-939667\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"During a scheduled supervised visit with her father, Miles Sennet, Tessa exercises with him until he is too tired to continue. Sennet questions if she is exercising because of her crush. When she confirms his suspicion, he tells her not to grow up too fast. Tessa asks what a \"Dallas head hunter\" is causing her social worker, Sara Jenner, to end the visit. Sennet protests stating she has ended the visits early three times in a month. Jenner claims Tessa needs the time to study since her grades are slipping. Tessa corrects her saying she made a D on one pop quiz. Before walking them to the car, Sennet reminds Jenner he still has a half hour left. At the car, Tessa tells Sennet to take care of himself as she hugs him. After they drive off, Sennet begins pressing buttons on his cell phone.While standing in the doorway of Tessa's bedroom, Valerie, her mother, tries to explain Sennet has issues he is not dealing with making him untrustworthy. Tessa puts on her headphones causing Valerie to leave her room shutting the door behind her.While Valerie is in the shower, someone rips the curtain down wrapping it around her and removing her from the shower as she screams.Valerie explains to Benson and Stabler that she could not report her rape until her 12-year-old daughter went to school claiming she does not want Tessa to know. Her attacker dragged her from the shower to her bedroom and raped her before apologizing. She adds \"like he always does\" causing Stabler to realize she knew her attacker. She identifies him as her soon-to-be ex-husband making sure they understand Tessa is not to know about it. At the station, Valerie informs Benson and Stabler of Tessa's visit with Sennet the previous day stating she returned home around 5:30 or 6:00. She believes Tessa gave her the silent treatment because she thinks Valerie is keeping her from Sennet. When she tells them the visits are supervised, Stabler questions if Sennet ever abused either of them. She asks if drug and alcohol addiction count as abuse. Stabler explains they do not count as abuse by themselves. The judge in the case disagrees with Stabler because he issued an Order of Protection. Valerie stresses Sennet was in her home and raped her before asking why they have not arrested him. Benson explains they need to finish taking her statement before they can talk to him. Stabler adds they will need to talk with Tessa. Valerie does not believe Tessa will know anything since she was asleep at the time. Benson informs her that Sennet had to have a key since there were no signs of forced entry. Valerie does not believe Tessa would give him a key or their address because she knows if he found out where they live, then they would have to move again. Stabler thinks she may have out of anger towards her. Valerie claims Tessa loves her and Sennet and questioning her will force her to choose between them. She requests they keep Tessa out of it. Stabler questions where Sennet got the key.In the squad room, Stabler informs Benson Sennet will be returning tonight from a business trip scheduled over a month prior. Benson believes it was convenient. When Cragen joins them, Benson tells him CSU found fibers at the scene along with hairs. The rape kit was positive for intercourse, but negative for semen. Stabler notes husbands do not wear condoms. Benson believes he would if he went over there to humiliate her. She thinks Tessa is angry and misses her father. She does not know if Tessa gave Sennet the key or the address reminding them they are not allowed to talk to Tessa without parental consent. Cragen will try to get Novak to find a way around that. Stabler informs him of two domestic violence calls to the Sennet residence while they were together. One was no dispensation. The other resulted in court-ordered anger management after Sennet put his fist through a wall. Neither Valerie or Tessa have a history of ER visits. Benson reminds them she grew up with an alcoholic mother stating abuse does not have to be physical to cause damage. Stabler believes more families would have protection orders and supervised visits if that was all it takes. The Restraining Order expires in a week, but the hearing to request an extension was held a month prior resulting in the request being denied. Cragen wants to know why the judge denied the request.Judge Harrison informs Benson and Stabler the original petition for an Order of Protection did not have grounds adding they are handed out like candy because jurists feel pressured by feminazis. Benson wonders why he dismissed Valerie's fears. Judge Harrison believes Valerie watched too many movies adding there was never any violence or abuse in the home. Benson tells him the violence took place the night before when Sennet raped Valerie. Judge Harrison reminds her if she had the evidence to prove it, then she would not be there. Stabler reminds him their job is to believe the victim. Judge Harrison reminds them his job is to believe whoever is lying the least. Benson does not believe Valerie has a reason to lie. Judge Harrison explains that by accusing a husband of abuse, a wife tips the case in her favor. Stabler calls it the Silver Bullet Defense while Judge Harrison calls it Sexual Assault in Divorce. Stabler tells him Kathy declined hiring a lawyer that suggested she use that strategy. Judge Harrison explains other men are not that lucky before clarifying some women do need protection while others abuse the system in order to get what they want. He believes Valerie is abusing the system. Benson asks if he has proof or if he is making it up as he goes along. Judge Harrison warns her that accusing him of Judicial Misconduct without proof could land her in jail.As they leave the courthouse, Stabler scolds Benson for baiting a judge. She reminds him Valerie was raped. She believes his family situation is clouding his judgment causing him to empathize with the suspect. He corrects her stating it is an outrage because Sennet never touched his wife. When Benson adds \"until last night\" and reminds him of the bruises, Stabler explains Sennet is being punished even though he never touched either of them. Jenner explains to Munch and Tutuola that she has picked Tessa up, supervised the visits, and taken her home for the past 6 months. At first, she thought Valerie was being overprotective, but Sennet showed up at her apartment every day demanding to see Tessa. He was never charged because he stayed 500 feet away, but Jenner still felt it was harassment. Valerie moved frequently because she fears Sennet when he is drunk or high. Jenner claims to understand her feelings stating Sennet has exhibited a temper after she shortened some visits by getting in her face. Tutuola reminds her cutting the visits short was not her call to make. Jenner cuts the questioning short stating she has to go investigate a complaint on a father for spanking his child. When Tutuola asks for her supervisor's name, she tells him to \"Go to hell\" before leaving. Tutuola takes out his notepad and begins to write causing Munch to ask if he is writing her a ticket. He explains he is filing a formal complaint because cutting visits short is an abuse of her power.At Tessa's school, Stabler questions Benson about speaking with Tessa. Benson explains it is the only way to know if Sennet was in the house. Tessa is introduced to them saying they need to ask her questions about Sennet. When Stabler asks her to sit down, Tessa wonders if Sennet is in trouble. She explains he used to have problems with drugs and alcohol. She denies telling him where she lives, but admits to leaving her backpack laying around with her house keys in it. Benson tries to convince her to tell them if she told Sennet saying no one would be angry. Tessa denies telling him again realizing they do not believe her. She denies seeing Sennet in her home the previous night. Valerie interrupts them telling Tessa to wait outside. Benson defends their actions assuring her they did not tell Tessa about the assault. She continues stating Tessa denies seeing Sennet. Stabler believes Tessa is hiding something. He explains she needs to let them do their jobs since rape is a serious charge. Valerie orders them to stay away from Tessa since they have already questioned her. Benson believes Tessa is trying to protect Sennet, but Stabler does not believe it is Sennet she is protecting.Sennet cannot believe Valerie is trying to take away his freedom after taking everything else from him. Stabler calms him stating they want to hear his side of the story. Sennet tells them he is a recovering alcoholic and drug addict as well as a lousy husband, but denies being a rapist. He clarifies for Benson that if Valerie had sex it was not with him. When Stabler tries to make sure Valerie did not back out of consensual sex at the last minute, Sennet repeats they did not have sex. Benson informs him he will have to come with them since he does not have an alibi. He questions how he can clear himself if no one knows where he was. Stabler has him agree to take a poly.At the station, Cragen urges Valerie to think before she recants her statement. She claims she knows what she is doing. They are surprised to see Benson and Stabler escorting Sennet out of the elevator. When Cragen informs them Valerie recanted. Sennet and Valerie go after each other. Before they can get physical, Benson ushers Valerie into the elevator as Stabler pins Sennet against the wall. Cragen orders a uniform to escort Sennet out allowing Stabler to add to take him down the back stairs. Benson believes Valerie recanted to stop them from talking to Tessa. Stabler believes Sennet is a hothead. Valerie and Sennet are trying to destroy each other. Tutuola joins them informing Stabler Kathy called. He continues stating the hair found at Valerie's belong to Sennet. Benson notes he knows where they live. Stabler believes Tessa transferred the hairs from her visit. Benson does not buy it. Stabler reminds her that her relationship with him is the longest she has ever had with a man so she would not know how bad things can get with couples. She fires back stating that after 8 years in SVU, she does not need to be married to know when an abusive man is escalating. She walks off in one direction and after a brief pause he goes in the other direction.In Cragen's office, Novak informs Benson and Stabler they will not be able to get a search warrant without a corroborating witness placing Sennet in the apartment. Stabler suggests they arrest Valerie for lying to police and filing a bogus police report. Benson believes that would be re-victimizing a rape victim. Stabler reminds her Valerie recanted. Benson thinks Stabler is upset because he believes Valerie is abusing the system. He clarifies if Valerie is facing jail time she would allow them to talk to Tessa. Cragen is not comfortable with the idea. Stabler explains if she lied about the rape she will be in jail and if she did not lie they will have what they need to nail Sennet. Novak agrees to arrest Valerie, but wants Huang to interview Tessa in case Valerie cannot be persuaded. After Novak leaves, Cragen asks if they can work the case together or does he need to reassign it. Benson says it is fine before getting up to leave. As Valerie picks Tessa up after school, Stabler approaches her informing her she is under arrest for Filing a False Report and Lying to Police. Benson approaches Tessa attempting to hold her back and calm her. When Valerie does not heed Stabler's warning of doing it the easy way, Benson suggests Valerie calm down and think about Tessa. Valerie assures Tessa it will be okay telling her to come with her. At the station, Tessa asks Huang what will happen. He responds saying it depends on Valerie. She believes he is treating her like a kid instead of someone with a brain. She explains she has found Sennet passed out. She has flushed his stash. As a result, Sennet would scream and yell before going out to buy more. She denies he ever hit either one of them. Sennet would break things and hit the wall instead. Huang informs her that Valerie claims Sennet raped her. Tessa does not believe he would do that.When Benson asks her if Sennet raped her, Valerie refuses to talk about it adding she wants a lawyer. Stabler informs her she is charged with two forbiddenStabler to rush over, grab her, and run as she begs for him to let her go. As soon as she is out of sight, Sennet reaches into his back pocket pulling out a long kitchen knife. Tutuola orders him to put it down and stay put. Benson makes her way from behind the statue with her gun raised. When he raises the knife aiming it at Tutuola, she yells his name getting his attention. As soon as he turns around, she shoots three times to his chest dropping him. She approaches him and removes the clip from her gun. She informs him his ribs will hurt since she used plastic bullets. She walks away allowing the others to cuff him.At the Burn Unit, the doctor explains Valerie will be going through very painful debridement. In a few days if she stabilizes, she will have surgery, a round of maggots, and then another surgery to remove dead tissue. He believes it is remarkable she has survived this long, but doubts she will survive more. Benson informs Valerie Sennet has been arrested and Tessa is in the waiting room with her parents. When Valerie asks if they killed him, Stabler notes she is out of it. Valerie tells them the shower was his fault, but she showed him. Benson questions if Sennet raped her. She confirms it. As Benson and Stabler get through the doors of the Burn Unit, Valerie screams causing them to jump. They lean against the walls slowly taking off the gowns as they listen to her horrific screams.Stabler looks at the house once he is on the porch. He puts the large manila envelope into the mailbox before ringing the doorbell and making his way back to his car. He turns around in time to see Kathy come out. She notices the envelope causing her to look at him. After a few moments, he gets in his car and drives away. She watches him leave before going back inside.In the squad room, Phillip Anderson arrives asking Benson for Stabler. He explains they were looking for him concerning the Sennet case. She informs him the case is closed. Anderson tells her he heard Valerie was in critical condition on the news. He believes she was an amazing woman. He explains their relationship was casual with him only coming over while Tessa was with Sennet. Benson tells him Valerie accused Sennet of rape so she needs to know when they were last together sexually. He confirms they were together on the 5th. He was gone before 5 so Tessa would not see him. After she verifies he used a condom, he tells her he hopes she is done prying into his sex life because he is leaving. Benson informs him Valerie is in Cornell's Burn Unit in case he wants to visit her. He reminds her the relationship was casual before leaving. As Stabler lays in bed awake at 4:47AM, he receives a text message from Benson stating \"Meet me downstairs...Liv.\" When Stabler comes out of the door, Benson hands him a cup of coffee. He notices a flower in her cup as he sits down beside her. She explains it is tea causing him to realize she is serious about the change. After they confirm neither could sleep, Benson informs him Valerie was sleeping with the investigator from her lawyer's office clarifying she was not raped. When he informs her Valerie died 20 minutes earlier, Benson realizes Valerie knew she was dying and still lied. Stabler explains, \"When love warps into hate, there's nothing you won't do.\" He tells her he signed the divorce papers because he did not want Kathy to ever regret him. Benson believes it is a step in the right direction. She asks if they are okay. Stabler is afraid if he disagrees with her, he will lose the partnership. When Benson questions the change, he simply responds that things change. Benson reminds him the longest relationship she has ever had with a man has been with him. She questions if anyone else would put up with her. When she asks if he is hungry, he agrees he could eat but wonders who is buying. She explains with his divorce and four kids he is. He assumed that would be the case."},{"episode_title":"Scheherezade","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/scheherezade-935604\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"During Dickie and Elizabeth's Conformation ceremony, Elizabeth chooses Claire as her confirmation name. Dickie surprises his family by choosing Michael as his instead of Peter. When Maureen asks Stabler about it, he informs her St. Michael is the Patron Saint of Cops. Kathy thinks Dickie is just trying to please his father. Kathleen thinks he is trying to get Stabler and Kathy back together. After the ceremony, Stabler invites them to lunch at P&G's. Kathleen informs him she has been a vegetarian since the previous summer and they are going to their grandmother's. He tells them they will do something special the following Saturday. As Kathleen drags her off, Maureen tells him bye. Kathy reminds him the situation is still hard on the kids. He assures her he understands that. When Father Denis interrupts them to ask Stabler a favor, Stabler tells Kathy to tell the kids he wants to say bye before they leave. After she walks away, Father informs him he has a ministry at Haven House, a hospice. Judson Tierney is a patient there with end stage lung cancer. Father Denis wants Stabler to speak with him as soon as possible since he does not have more than a few days to live. Stabler arrives at the hospice to speak with Tierney. When Stabler introduces himself, Tierney tells him he has been waiting for this day for 30 years and he almost missed him.Tierney tells Stabler a priest used to be able to keep his mouth shut unlike Father Denis. He would let it go with a few Hail Marys, a good Act of Contrition, and do not do it again. When Stabler asks if he wants to confess, he asks if he needs a lawyer. Stabler tells him he can have one if he wants one. Tierney asks what he is charging him with. Trying to get him to talk, Stabler asks if he needs him to tell him causing Tierney to figure out that Stabler does not know. Tierney compliments him before calling him \"flatfoot\". Stabler informs him he is with Special Victims when he asks. Tierney wonders are all victims not special causing Stabler to explain his unit investigates rape, child abuse, kidnapping, and homicide. Stabler tells him he is there if he wants to talk. Tierney tells him not to rush him. Stabler reminds him of his impending death. He informs him his daughter hung up on him when he tried to call her so the doctors called. He has a lot of things to get off his chest. His daughter deserves to hear it from him. He tells Stabler if he will bring his daughter to him, he will tell him everything. When Stabler arrives at the squad room, Benson informs him Judson Tierney's record is clean, but they cannot be sure without fingerprints. He owns a house in Rego Park. He opened a locksmith shop in 1971 where he worked until the previous year when he got sick. He does not have any credit card debt. He has about $18,000 in his checking account. He has a small IRA. No red flags. Benson verified Tierney has never been investigated or a suspect with a friend at Intel. Benson gives him the address for Sheila Tierney DuMont on 83rd telling him she is a married schoolteacher with two children. When she volunteers to go with him to see her, he asks if she thinks Tierney molested his daughter. She responds by telling him Father Denis chose him for a reason. He tells her if Tierney did abuse her the statute of limitations ran out a long time ago. She reminds him it is never too late to help a victim. Sheila tells Benson and Stabler her life is none of their business. Stabler informs her that her father does not have much time left. She invites them back when he dies saying she will open the champagne. Stabler tells her he is trying to clear his conscience. She does not believe that is her problem. She has not seen Tierney since 1989 when her mother died. She was 18. He went her daughters' school and introduced himself on the playground. Sheila told them next time to run to a teacher. When Benson asks if he abused her, she asks them to leave. Stabler gives her his card in case she changes her mind before telling her that her daughters are beautiful. She stops them before they open the door to ask them to take a box she has in the basement to Tierney as a bon voyage present.In the squad room, Benson and Stabler dump a box of greeting cards on a desk. Benson notices they are all from Tierney. Stabler opens one with a message stating \"Sheila, please forgive me.\" Enclosed is a $100 bill. Benson opens one and fins the same message with another $100 bill. Stabler guesses there is a card there for every week since the last time he saw his daughter. Benson figures there are thousands of dollars there if they all have money in them.Benson and Stabler attempt to take the cards back to Sheila. She tells them to give the money to charity because there are some things money cannot buy. Benson lists forgiveness as one thing it cannot buy causing Sheila to tell her to give up because she is not going to talk about it. Stabler informs her some of the cards are addressed to her daughters suggesting they may want to read them. She tells them to get them out of her house. Stabler asks why she kept them instead of burning or trashing them. She was saving them for this occasion so he would know she never read any of them. As they leave, Benson tells Stabler she thinks Tierney molested his daughter because she reacted like a victim by cutting off all contact and refusing to allow him to see her daughters. Stabler believes Tierney did something wrong, but doubts he abused her causing Benson to ask why Tierney is under his skin. He denies it. Benson reminds him the cards have Tierney's saliva and fingerprints. If his DNA matches in the system, then they have him. She suggests they drop the cards off at the lab before grabbing dinner. He suggests they eat in the cafeteria of Haven House saying she should meet Tierney. Stabler knocks on Tierney's door before opening it. Tierney asks if he found his daughter. Stabler turns around and tells Benson to come in. Tierney mistakes her for Sheila, but Stabler corrects him introducing her. Tierney tells her she looks like Sheila. Benson explains she is Stabler's partner. When he asks if they think this is a joke, Stabler tells him to tell them if it is. Tierney confirms Sheila refused to come before explaining she is a tough kid. Even her father dying will not soften her up. When he pushes the button to his morphine drip, it does not work. He wants the doctor to just knock him out. Benson asks if he wants to spend his last days in a drug-induced coma. Tierney tells them she sounds like Sheila. Benson takes it as a compliment. She tells him Sheila looks good. When he asks for more details, she tells him she is beautiful and so are Ashley and Lindsay. He does not know where Sheila got the names. He realizes one of them has a birthday coming up so he needs to send her a card causing Benson and Stabler to glance at each other. When Benson asks what he did to Sheila, he tells her he hurt her. Benson asks how before he apologizes to her as if he believes Benson is Sheila and falling asleep. Stabler's pager begins beeping. He tells her it is the lab guessing they finished processing the cards. She tells him to go on and she will stay with Tierney hoping he will wake up willing to talk. At the Crime Lab, O'Halloran tells Stabler he was able to get DNA from the envelope flaps, but it was not a match to anything in the system. He was also able to lift fingerprints from the cards. He ran them and they came back belonging to Jake Tierney. He was arrested in 1956 for Burglary in Peoria. He was also arrested for Attempted Burglary in St. Paul in 1957 and Breaking and Entering in El Paso in 1958. He never did more than 6 months and nothing in 50 years. None of the money is newer than 1970 causing Stabler to deduce Tierney has a stash. As he calls Benson, O'Halloran tells him he checked with the FBI and was able to get a case number. He tells Benson they found something interesting so he is going to the FBI before asking if Tierney is awake.As Benson tells Stabler Tierney is still asleep, Tierney tells her he is awake. Benson returns to her conversation with Stabler telling him to call her if he finds out anything. Tierney asks if Stabler is putting in overtime to try to figure out the case. Benson suggests she know he abused Sheila. He admits he has done some bad things, but denies doing that saying he never laid a hand on her. She asks why he keeps asking Sheila for forgiveness. She wants to know what kind of father would molest his daughter then send her a reminder every year. Tierney tells her he does not know what her father did to her, but she needs professional help. He hopes Stabler has more sense.At the FBI, Agent Peters introduces herself to Stabler before he asks if she is assigned to case number 71210. She informs him cases beginning with 71 are from 1971 so the agent would be retired by now. The case is not closed so she will take a lead if he has one. He informs her that her case may be connected to his case and asks her to tell him about it. She explains two men committed the longest string of bank robberies. They are known as the Fedora bandits and have been on the most wanted list for 47 years. Tierney tells Benson and Stabler you appreciate beautiful mornings more when you do not have many left. He informs them the sky becomes clear before a big storm hits like God is trying to warn us that \"Good things don't last.\" Benson thinks it is his guilty conscience talking. Tierney claims it is the morphine. When he says he is cold, Benson gets him a blanket to cover up with. He is impressed when Stabler asks if he wants his fedora, but reminds them he does not have much time to figure it out. When Stabler asks if he is ready to confess to 21 armed robberies, Tierney tells him it is just the beginning. Elliot believes it has to do with 1971, the year Sheila was born. Tierney tells them the first time he held her in his arms, he knew he had to protect her and he could not do that if he was in jail. Benson believes Sheila is mad because she found out what he had done, but Tierney assures her she never knew. He never talked about his business to anyone, even a cop as pretty as Benson. Stabler announces he is done with it and is going to turn it over to the FBI as he walks away. Tierney reminds him it is just the beginning and asks him to trust him. As Tierney starts to roll away, Benson asks where he is going. He explains the drugs are making him tired, but asks her to stay saying she will never know when he will feel like talking. Father Denis approaches Stabler in the squad room asking about Tierney. Stabler informs him Tierney gave up the bank jobs. He is writing up the report for the Feds. When Father Denis asks if that is all he told him, Stabler asks if he is trying to tell him there is more. He asks for his guest to sit down before telling him Tierney is not talking to him. Father Denis reminds him that Tierney has been silent for a long time and old habits are hard to break. Stabler explains he has 12 open cases on his desk that he should be spending time on rather than playing 20 questions with Tierney. When Father Denis tells him his immortal soul is in danger, Stabler tells him eternal damnation is not a police matter. Father Denis responds saying it is not entirely a spiritual matter either. By doing this, he believes Stabler will be saving an entire family. Sheila tells Stabler she did not know about the robberies, but her dad is a pro at hiding things like her whole life. Stabler tells her she is a lot like her father. She hates him for keeping secrets when she has plenty of her own. She explains when her mother died, he wanted her to stay at home and go to college in Queens. She felt she needed to get out of the house. She saved her money wanting to go to Europe. She needed her birth certificate in order to get her passport, but refused to give it to her. She picked the lock on the strongbox containing the family papers. Stabler interrupts her saying she does not hate her father because of a missed summer vacation. She continues saying her birth certificate listed her father as Judson Tierney and her mother as Suzanne Mollinax, but her mother's name was Lenore. He explained it saying that her mother could not have children. He had an affair and had gotten her pregnant. Her parents never hugged her or said they loved her. Stabler explains that was the old school Irish way saying his parents were the same way. She does not believe it is the same thing saying the house was nothing but locked doors and silence. He tells her that does not mean they did not love her. She tells him her father made her mother raise his lover's child. She believes that is why they never touched her. She thinks her mother probably hated her. He doubts that. She reminds him they will never know.Huang reminds Stabler it is Sheila's choice whether to see her father or not. Stabler believes she will regret it if she does not see him before he dies. Stabler reminds him that all shrinks talk about is closure. Huang quotes Tolstoy's Anna Karenina saying \"Every unhappy family is unhappy in its own way\" adding that families are complicated. Stabler responds saying, \"Tell me about it.\" He asks Huang how to get Tierney to talk. Huang explains he will talk when he is ready and not before causing Stabler to remind him the guy is running out of time and he is running out of patience. Huang tells him he cannot rush Scheherezade of 1,001 Arabian Nights. He explains Scheherezade is the narrator. She made up the stories for a king who would marry a new bride every night and cut off the head of the one from the night before. She told him a story so gripping he could not kill her until he heard the end of it, but the story never ended. Huang believes Tierney is trying to stave off death like Scheherezade. Stabler concludes he is trying to hold on to make peace with his daughter. Huang suggests that since his real daughter will not come to him, then Benson needs to take her place. Stabler tells him she already has explaining she has been glued to his side sitting with him all night as he slept. Huang tells him that is Tierney's fantasy of a daughter. Benson needs to get furious with him. Stabler questions Benson needing to get mad at Tierney. Huang believes if she does, Tierney will do whatever it takes to get her back. Benson wakes Tierney telling him there will be plenty of time to sleep later. She wants him to tell her about Suzanne Mollinax. He tells her Suzanne died a long time ago. When Benson tells him she was Sheila's birth mother, he tells her his wife Lenore was her mother. He explains he told Sheila that blood does not matter, only love matters. Benson questions his version of love when he forced his wife to raise another woman's child. He denies he forced her saying she wanted a child, but could not have any. Benson believes they could have adopted, but is reminded he was a convicted felon. When he claims to have been a good father, Benson asks why Sheila will not talk to him if he was so devoted causing him to get up from the bed to go to the restroom. She tells him he cannot hide from his secrets any more. They are all coming out. He thinks he was just trying to protect her, but Benson does not buy it. She believes he was trying to protect himself so he would not go to prison. She tells him Sheila does not want to hear it and neither does she. When she threatens to leave, he comes out of the restroom asking if she has a car.At St. Paul's Cemetery in Plattsburg, New York, Tierney informs Benson that Lenore was born and raised in Plattsburg and deserved to be buried there. Upon seeing the roses, Benson assumes Sheila has been there, but is told the roses are from him. He used to bring the roses himself, but the florist does it now. When Benson offers to give him a minute, he tells her he does not have to come to the cemetery to talk to her. He tells her she better start digging. At first she thinks he is talking about the grave, but he tells her to look under the flowers. While she locates a set of keys, he informs her he believed Lenore would keep him from being tempted. She asks him what they go to, but he walks away.Stabler tries the key in every lock he can find in Tierney's house and outside. When he kicks something hidden under leaves on the ground, he removes the leaves locating the keyhole. He unlocks it and opens the door to the storm shelter. He looks around and finds a trunk. He opens it and sees it is filled with $100 bills. He calls Benson. As he tells her about the millions of dollars Tierney has stashed there, he opens the other trunk and finds the remains of other half of the Fedora Bandits. In the morgue, Warner informs Stabler the victim he found was shot at close range in the heart. He could have been killed recently or years ago. She explains mummification can occur at different rates depending on the environment the body was kept in. Stabler notes the wide collar and short tie the victim has on are from the 70s. When Warner suggests it brings back memories, Stabler asks if those memories are of her when she was in diapers. She is thankful for the compliment. The coins she found in his pocket are from 1971 so she guesses that will be as close as she will get to a time of death. Stabler tells her it makes sense considering the Fedora Bandits stopped robbing banks at that time.Benson approaches Tierney interrupting his meal suggesting he stopped robbing banks after he killed his partner instead of for Sheila. He admits it is true adding Jack had it coming. While he shows no remorse for it, he regrets stuffing Jack's body in a trunk and letting it rot in his backyard because it smelled bad. He did not turn himself in because there were other people involved. Benson reminds him Jack's family was involved, but is told Jack did not have kids and his wife was better off without him claiming he made sure she was taken care of as Benson helps him put on his oxygen tube when his coughing becomes bad. She asks if his wife would want to know he was dead. Rita Colino announces to her friends gathered around her dining table that she is a widow. One of them congratulates her before asking if she wants to be dealt out of the hand. Rita confirms she does before turning back to Stabler saying she has not thought about him in years. She knows he earned more than what he put on his income taxes explaining he bought her a piece of jewelry every time she got too curious. She hands him a picture before stating she thought he ran off with his mistress. At the time, people did not divorce for any reason, but she considered it when she found out his mistress, Suzanne Mollinax, ended up pregnant. Suzanne asked him to get a divorce, but he never asked. He had affairs, but always came home to her. She only found out about the baby because Suzanne showed up on her doorstep begging her to let him go. When Stabler asks for her name, she tells him it rhymes with \"hunt\" before telling him her given name.Benson shows Tierney the picture of Jack as she tells him he and Jack were both sleeping with Suzanne at the time she became pregnant. He tells her Sheila is Jack's child causing her to ask why his name is on the birth certificate instead of Jack's. He asks her to get him a cigarette explaining exactly where they are located. When she asks if he is joking, he reminds her he is already dying. Tierney explains when Sheila was about a month old, Jack called saying he was out of gas and needed him to bring a can of gas to him at Suzanne's. Jack killed her before he got there after she threatened to turn him in about the bank robberies if he did not leave his wife. Jack believed his problem was solved, but he needed to get rid of the body so he started splashing the gas around. Tierney reminds Jack about the baby, but is told she does not matter. Jack went towards the crib with the gas can in his hand so he shot him and took the baby. He told his wife the truth about the whole thing. After she cried for an hour, she made him promise that part of his life was over. He put the money and Jack in the bomb shelter and never looked back. When Benson asks why he did not tell Sheila she was adopted, he asks what he was supposed to tell her. Her mother was a blackmailing tramp. Her father was a murderous thief and he killed him. Benson realizes he did not want Sheila to hate herself. He tells her he needs to answer for killing Jack and kidnapping Sheila so he wants her to arrest him. She stands up and begins reading him his rights after she informs him of the charges against him.As Stabler enters the squad room, Tutuola asks him if he is trying to make them look bad by solving 21 bank robberies, a murder, and a kidnap in 48 hours. Stabler attributes it to Catholic guilt stating it is a good thing. Munch thought Jews had a corner on that market before questioning why he was not at Federal Plaza gloating. Stabler explains he had to pull up the paperwork on the old cases to write up the charges on Tierney. Tutuola offers his assistance. Stabler tells him he needs the case for the 1971 Arson-Homicide on Suzanne Mollinax. When Munch asks where Benson is, Stabler explains she is guarding Tierney after he insisted on going to Central Booking, but his doctor would not let him. Tutuola shows Stabler that Suzanne's ex-husband, Mike, was convicted in 1972 of two counts of Murder Two and Arson in the first.At Sing Sing Prison, Mike Mollinax informs Stabler that on September 17, 1971, he was at McFadden's when the police arrested him for killing Suzanne and the baby. He denied doing it, but no one believed him because he was a mean drunk. He threatened to burn the house down if he ever caught her with another man after she threw him out. When he heard she was set on fire, he expected to be arrested so he moved in with his girlfriend. They had a fight and he beat her up. The next day, she turned him in. Stabler realizes they were only able to prove motive. Since he was a violent drunk, it only took the jury 20 minutes to convict him. He asks if he is really going to get out of jail.Novak informs Stabler she will get Mollinax out because wrongful convictions make the whole system look bad. She will draft a 440 motion and get it on the calendar within a day or two. Since Tierney will not be able to be at the hearing, she will take a sworn statement from him and have it admitted as his dying declaration with an affidavit from his doctors stating he is unable to be there. Stabler does not believe Tierney knew of Mollinax's conviction.Tierney confirms he did not know Mollinax was convicted claiming he would have said something sooner had he known. Stabler confirms the arrest and trial were not covered in the papers. Novak explains she will swear him in and will take a recorded statement. He tries to speed her up as she gets everything ready for his statement. She presses record and attempts to swear him in, but is interrupted by his coughing and constant pushing on his morphine drip. When she finally gets him sworn, he states his name as Judson Martin Tierney. She begins by informing him she wants to talk about the events of February 10, 1971 at the home of Suzanne Mollinax. He confirms he was there after Jack called him. Jack wanted him to help get rid of the body. Before she can go any further, he falls asleep. Benson informs her the morphine causes him to drift in and out. She informs them that even though the morphine does not effect his memory, it makes his statement inadmissible. Without the statement, she cannot get Mollinax out of jail.The doctor informs Benson, Stabler, and Novak that Tierney is in a lot of pain so she increased his morphine that morning. She hopes he will not wake up. When Novak asks, she tells her Narcan will counteract the morphine. She cannot do that without his consent. Stabler reminds her he will not consent as long as he is doped up. He chose the treatment so she cannot go against his wishes. Benson and Stabler confirm Sheila Tierney can request the Narcan.Sheila confirms Stabler's version of Tierney's story before asking why he did not tell her. Stabler believes he was trying to protect her. She agrees to sign the papers stating she does not want an innocent man paying for her dad's mistakes. She asks Stabler to promise to tell Tierney she did not do it for him.Sheila signs the papers where the doctor tells her. The doctor explains she will administer the Narcan and he will wake up immediately if she wants to see him. The doctor takes Stabler's place in Tierney's room as Stabler takes hers in the hall. He asks Sheila if she wants to see him. When she is unsure, he reminds her Tierney kept the secrets from her because he did not want to hurt her. He justifies this adding he has done the same thing with his children. The doctor informs them he is coming out of it. Sheila goes in, but decides against it running back out. When Tierney sees her, Benson tells him Sheila will be back. He does not believe her, but asks where Novak is so she can finish taking his statement. Benson tells him Novak is ready whenever he is. He reminds her she better make it quick.At Sing Sing Prison, Stabler is told they are 20 years too late. Mollinax was involved in a prison fight in 1985 where he killed someone. The prison is going to file on him for the homicide. Stabler explains to Mollinax that he will be charged for the murder in the prison so he will not be getting out. The warden did not believe he should waste the court's time with the charge since he was already in for a life sentence. He asks Stabler to do something.Tierney wakes up gasping for breath. Benson calms him before telling him Mollinax is not out because there has been a complication.Stabler asks him to explain what happened. Mollinax was coming back from a meal. Some Aryans jumped a black guy. His friends join in. A black guy came at him with a six-inch shank as he was walking by. He forces the guy to drop the shiv. While the guy was choking him, he grabbed the shiv and stabbed him in self-defense. Stabler tells him he will help him if his story checks out. Benson tries to calm Tierney. He tells her they better hurry.Novak tells Stabler her hands are tied considering they have him for another murder. Stabler tells her he has six witnesses backing Mollinax's plea of self-defense. She reminds him she does not have jurisdiction outside the city. He asks her to call the DA upstate, but is told he is backing the warden. Stabler recounts the fact that Mollinax served time for a murder he did not commit and now he is going to have to do more time for a murder he would not have committed had he not been there in the first place. Novak tells him there is nothing she can do legally. He asks her to do something.Benson tells Tierney they are still waiting on the word about Mollinax. She promises they will get him out. She tells him he can let go, but he refuses saying he needs to see this through. Donnelly asks Novak and Stabler if they want her to call the governor and ask for a pardon. Novak explains she will do the asking, but she needs her to get him on the phone considering they are old friends. She explains she would have to advise her friend not to get involved. The DA upstate has every right to try Tierney for murder and the governor cannot circumvent his authority. Stabler questions allowing a man to serve time for a crime he did not commit. Donnelly clarifies Mollinax must serve time for the murder he did commit. Stabler reminds her he has already served 35 years causing her to explain she did not mean he should stay in jail. Novak concludes she is suggesting the governor can pardon him for the Mollinax murder if he pleads guilty for the prison murder. He gets sentenced to time served and everyone gets what they want. Donnelly promises to get Novak in to see the governor, but tells her the rest is up to her. While pacing at the Governor's office, Stabler gets concerned that it is taking too long. He is afraid Tierney will not make it. Novak suggests they lie and tell him Mollinax is out so he can rest in peace, but Stabler refuses to lie to him. She reminds him Tierney would not know. Stabler tells her that he would know. They are interrupted to be informed the Governor has granted their request. Stabler calls Benson so she can relay the message. Benson wakes Tierney to tell him Mollinax is out. He is glad. When she starts to pull away, he grabs her hand asking her to stick around since it will not be long. She assures him she is not going anywhere. Stabler shows up with Sheila to Benson sitting in the chair beside his bed. She gets up as Sheila approaches. After exchanging sorrowful looks, Benson takes her place between Sheila and Stabler. Sheila sits down in the chair taking hold of his hand as she begins to cry.The choosing of names was mentioned a couple of times in this episode. These are the meanings and history behind some of the names mentioned. There is some interesting symbolism going on here. Clare (Elizabeth Stabler's confirmation name) is of Latin origin and means \"clear, bright, or famous.\" Saint Clare of Assisi was an Italian noblewoman who was so inspired by the preaching of Saint Francis of Assisi that ran away from home at the age of 17 (along with her sister who was to become Saint Agnes) to devote her life to God. She founded the Order of Poor Ladies, also known as the 'Poor Clares' to organize women who wanted to follow the example of Saint Francis. They wore no shoes, ate no meat, lived in a poor house, and kept silent most of the time. Her feast day is August 11, and she is the patron saint of clairvoyance, eyes (Elizabeth was wearing glasses), gilders, gold, clear weather (which Tierney mentions during one of Olivia and Elliot's visits), needleworkers, Santa Clara Pueblo, telephones, telegraphs, and television.Peter (the confirmation name Dickie Stabler rejected) is of Greek origin and means \"stone.\" Saint Peter (a.k.a. Simon ben Jonah, Simon Bar Jonah, Simon Peter, Cephas, Kepha-original name Simon or Simeon) was one of the Twelve Apostles whom Jesus chose from among his disciples. He and his brother, Saint Andrew, were the fishermen whom Jesus called to become 'fishers of men'. When he acknowledged Jesus as \"...the Messiah, the son of the living God,\" Christ replied, \"You are Peter and upon this rock I will build my church.\" Christ also told him, \"To you I will give the keys of the kingdom of heaven. Whatever you bind on earth shall be bound also in heaven. Whatever you loose on earth shall be loosed also in heaven.\" In Roman Catholic tradition, Saint Peter was the first Bishop of Rome which also makes him the first pope. He was martyred in Rome, and a story in the apocryphal Acts of Peter says he asked to be crucified upside down so he would not be equated with Christ. Among other things, he is the patron saint of locksmiths, the career which Tierney chose to pursue when he went straight. His feast days are February 22, June 29, and November 18.Michael (the confirmation name Dickie Stabler selected) is of Hebrew origin and means \"Who is like God?\" Saint Michael, the Archangel, is the patron saint of policemen, probably because he was instrumental in expelling Satan and his followers from heaven. He is usually depicted killing a serpent. His feast day is September 29th.Sheila (Judson Tierney's daughter) is of Celtic or Gaelic origin and means \"Heaven.\" If there is an afterlife, what Judson Tierney did for her might help him get there despite his crimes. Ashley (one of Tierney's granddaughters) is of English origin and means \"from the ash tree field.\" Lindsey (Tierney's other granddaughter) is of English or Latin origin and means \"from the lake settlement island\". Tierney was puzzled about the girls' names, and they are the only ones in his family that have no symbolic relevance to the story.Jake (the name under which Tierney was convicted of his petty crimes) is a diminutive of Jacob, a Hebrew name meaning \"supplanter\"-one who steals the place of another, especially through force or treachery. It is an ironically appropriate name considering he supplanted Sheila's father by killing him, burning the house down (both acts of force), and keeping Sheila's true parentage a secret from her (treachery). In the Bible, Jacob was the second-born of Isacc and Rebekah's twin boys. He was, smooth skinned, a homebody, a shepherd, and his mother's favorite. His elder brother Esau was hairy, a hunter who was often away from home and was his father's favorite. One day, when Esau returned home from a hunt, he was \"starving\" and sold his birthright (a double portion of his father's inheritance) to Jacob for a bowl of lentil soup. Later, when Isaac was old, blind, and near death, Jacob stole Esau's clothes and covered his arms with fleece (sheepskin with the wool attached) so that he smelled and felt like his older brother and stole Esau's blessing as well. God changed his name to Israel and he became the third Biblical patriarch after Abraham and Isaac.Judson (Tierney's chosen name after 1971, when he took Sheila and quit his life of crime) is of English origin and means son of Judd. Judd, also of English origin, is a diminutive form of Jordan, which is of Hebrew origin and means \"to flow down\". The Jordan River is widely held to be one of the world's most sacred rivers. Jacob crossed it when fleeing from his brother Esau after supplanting him by stealing his birthright and blessing, much as Tierney crossed into an honest life when he supplanted Sheila's father. It was the site of many miracles, and John the Baptist baptized Jesus in its waters. Symbolically crossing the River Jordan was the Hebrews final step to freedom in the Promised Land after fleeing slavery in Egypt and wandering in the desert for forty years. It can also represent death as the spirit crosses over into Paradise or Heaven, which is what Judson Tierney is hoping to do.Jack (the name of Tierney's partner whom he shot to rescue Sheila) is of English origin. It is a nickname for John. Both mean \"God is forgiving.\""},{"episode_title":"Choreographed","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/choreographed-913604\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"As two teens decide whether to go further than making out in Central Park, they hear a twig snap in the bushes. A leashed dog makes his appearance barking. At the girl's request, her boyfriend grabs the leash and they allow the dog to lead them along the path. They see a guy walking away and assume he is the owner of the dog. As he runs away, they find a woman in the bushes gasping for breath. The girl tends to the victim as she takes her last breath while her boyfriend calls for help. The teens inform Stabler the victim's last communication was nodding her head in response to being asked if she was raped. They admit to only seeing the guy's back as he ran away. Stabler reminds them they should not be in the park before asking Officer Mahoney to take them home. CSU informs him an ATM card was found identifying the victim as Danielle Masoner. A coffee cup and a receipt from Caf Gabrielle was also found. He assumes that to be the victim's last stop since the receipt was stamped 9:18PM. Stabler tells Warner the outcry witness said the victim was raped. Warner informs him there are no fluids. He notes the bruises possibly resulting from defending herself. Warner rules out strangulation as a cause of death. He informs her the witnesses stated she was gasping for breath. Warner notes scratches on her neck and the lack of bruising and cervical damage concluding she did not have a broken neck. Warner runs through a possible scenario when Stabler asks for her take. Woman goes for a walk in the park with her dog. Perp jumps out of the bushes and attacks. She has a coronary. Stabler concludes she was literally scared to death.Wesley Masoner, Danielle's husband, tells Stabler she has been modeling since she was little. Even though she felt safe with the dog, he always went with her unless he was rehearsing. He explains he runs a Radialus Dance Company and serves as artistic director and choreographer. Stabler asks for a recent photo of \"Dani,\" but changes it to \"Danielle\" when Masoner tells him he is the only one to ever call her that. Masoner hands him her portfolio before answering the doorbell to let Glenn and Naomi Cheales in. After they express their condolences, Masoner informs them of Stabler's presence. Naomi tells him she was with Masoner at rehearsal when Stabler notified him of Danielle. Cheales tells him he is just a computer nerd. When Naomi asks what happened, Stabler tells her Warner thinks she may have had a heart attack.Warner tells Stabler there was no coronary damage. She does not know what killed Danielle so she asks about medical problems. Stabler informs her the victim was healthy making him question if she may have been using drugs. Warner denies it and tells him the rape kit was negative so the teens must have interrupted him. Stabler comments he would like to tell Masoner something about what killed his wife. Warner promises to keep looking before asking if he is working the case alone. He explains Beck went back to Warrants adding they have run out of partners for him. Before he walks out, he returns asking if it could have been an allergic reaction to something she ate. Warner reminds him she was a model before informing him coffee was the only thing in her system.At the coffee shop, a Barista shows Stabler the security video from the previous night. She tells him Danielle comes in alone, but frequently bought a homeless guy coffee. After he notes how closely the guy watches Danielle, he is told the guy may have had a crush on her.Cragen interrupts Stabler's repeated viewing of the tape to urge him to get some rest. Stabler declines saying he wants to be able to identify the guy when he sees him face-to-face. He plans on looking for the guy at a homeless camp in the tunnel near where the body was found. When Cragen tells him to take someone with him, Stabler asks if he is offering to be his partner. Cragen reminds him he is not his type causing Stabler to remind him the women keep leaving him. Cragen takes the opportunity to tell him Benson is back so he may have another chance with her.As he searches the tunnel in Central Park alone, Stabler spots the guy he is looking for. After introducing himself, he tries to get him to identify himself but fails. When he searches his pockets, he finds a picture of Danielle and shows it to him causing him to elbow Stabler and run. Stabler catches him. After a few swings with a knife, Stabler takes him down on the concrete steps. He forces the knife from his hand. After a few solid blows, Stabler stops hitting him.At the hospital, the homeless man is identified as Keener. He has Broca's aphasia, a speech disorder caused by a stroke. Even though his cognitive function and memory are normal, he cannot form words. Stabler is informed Keener has been treated at this hospital for two years. In that time, he has lost everything. The doctor believes that after living on the street for that long, Keener sees everything as threatening, explaining the reason for his attack of Stabler. When the doctor tells him he can talk to Keener now that the Haldol has calmed him, Stabler wonders how he can if he cannot talk.With the use of a dry erase board, Keener draws a description of a 6 foot tall white man he saw with Danielle. When asking about the color of the man's hair, Benson walks in and asks if it was the color of her hair. Stabler asks if she is there to give him a hand. She explains Cragen sent her to be his handler after his fight with Keener. Stabler defends himself saying he had a knife before they resume their questioning. After noticing Keener acting as though he is shaking salt, Benson realizes the man's hair is salt-and-pepper. Keener continues by trying to draw the man's broken arm. When he gets frustrated when they do not figure it out, he grabs Benson's arm and starts to twist it. Stabler tries to stop him, but Benson backs Stabler off telling him they are getting somewhere. Once they understand what he is trying to tell them, he dumps the markers out of the coffee cup. They realize he is telling them the man with the broken arm was seen at the coffee shop.At Caf Gabrielle, Benson breaks the awkward silence by asking Beck's reason for leaving. Stabler explains she could not handle the victims, but she did not have to handle him. When he asks how she liked working alone, she tells him she did not. Benson notices their guy walk in so they join him at the counter. She asks how he broke his arm, but is told it is none of her business. As Stabler shows him his badge, Benson tells him it is her business.In the interrogation room, Steve tells Stabler and Benson that Danielle was his friend. He was living with the Masoners after he broke up with his boyfriend until a few weeks prior. He claims he met Danielle for coffee and she had an unpredictable seizure. When he claims he dialed 911, Stabler grabs his arm forcing him to sit down explaining there was only one call for help that night. He asks Stabler why he has to be so rough. He bluntly tells him he still has one arm he can break. Benson tells Stave that Stabler has an anger management problem that she mistakenly thought he had under control. Stabler informs them he has had a rough couple of weeks. Benson assures him Stabler will break his arm. Steve claims he left Danielle once he saw the teens believing they would call for help because he had recreational drugs in his system. He tells them Masoner tossed him down the stairs when he caught him having phone sex with someone. Masoner threatened him and told the person on the other end of the line that he would be a free man soon.Benson and Stabler arrive at the Radialus Dance Company to Masoner yelling at his dancers. Stabler gets his attention, but is told to wait until their break. He responds by telling Masoner to come now and it will take longer than five minutes. Benson tells him he has room on his dance card for her as she grabs his arm and helps Stabler guide him out.In the interrogation room, Masoner denies cheating on Danielle. He claims Steve is a pathological liar. They remind him Steve is the one with the broken arm that he gave him when he caught Masoner cheating. He claims he caught Steve doing lines of cocaine on his glass coffee table and he tripped down the stairs. Stella Danquiss, his attorney, interrupts them unsurprised by their proceeding with the interrogation without her. Benson assures her they were just consulting with him about his wife's death. Danquiss reminds them they do not know how Danielle died. When Stabler informs her they know she was murdered, she asks if he used tarot cards or called the psychic hotline for the information. She repeats they have nothing and until they do they are to leave Masoner alone to grieve.Stabler tells Cragen that Danquiss knows they do not have any evidence. Cragen tells them they need his mistress before asking for Masoner's alibi. When Benson tells him Masoner was at rehearsal, Cragen tells them to verify that with members of the dance company. Stabler tells them he already met one  Naomi Cheales.Benson and Stabler arrive at the Cheales residence as they are returning home with groceries. Cheales opens the door using keyless entry. Naomi explains her husband invents gadgets as a hobby. While Benson helps Naomi with the groceries, Stabler speaks with her husband. Stabler asks an affair Masoner is supposed to be having. He denies it saying he feels like he will be breaking a guy's code of silence. When Stabler reminds him he would be obstructing justice by lying, Cheales confirms Masoner was having an affair. Meanwhile in the kitchen, Naomi denies Masoner's affair to Benson saying he was a love-struck schoolboy. She claims it was the perfect marriage. Cheales continues telling Stabler Masoner cheated all the time, but this one was the love of his life. The only thing he knows is her name is Jen.As they are leaving, Benson recounts the fact she received a fairy tale while Stabler got an affair. Stabler wonders what \"Dani\" would have thought. When she questions who he is talking about, he tells her the victim. She reminds him her name is \"Danielle,\" but he does not get the distinction. She denies something is bothering her when he asks. After he opens his car door, she shows him the contact information for members of the dance company with only one \"Jen\" sounding name. The stage manager. Geneva Dworkin.At the dance company, Geneva informs them she is not into guys and no one calls her \"Gen.\" When she asks Benson her name, she is told \"Detective.\" They confirm Masoner was there the night Danielle was killed. He apparently gets action on the side all over the building because there is a new one every season. She believes he is either being more discreet or he is alone this season. Stabler suggests he could be seeing someone outside of the company before answering his ringing cell phone. Geneva tells them Masoner spent the dinner break from 8-9:30PM in his office before Stabler tells Benson Warner has something for them.Warner welcomes Benson back after commenting that Stabler is recycling old partners. She tells them Danielle was poisoned with Dieldrin. It was rubbed into her skin in an area that was covered by a bruise. She informs them Dieldrin is banned in the US. Dieldrin causes violent seizures explaining why the witness thought she was confirming she was raped and why her clothes were ripped. She was poisoned no more than 30 minutes prior to collapsing, which was about the time she got to the coffee shop.While watching the video from Caf Gabrielle, they notice she is wiping something from her arm and guess it could be the Dieldrin. She was poisoned just before going into the caf. The time frame coincides with the dinner break Masoner had. He could have snuck out, poisoned her, and returned before he was missed. She asks why he did not just get a divorce. Munch interrupts them saying there is no money in divorce before welcoming Benson back by telling her he should have brought cupcakes. He proceeds to tell them he ran Danielle's financials. She was making over seven figures from top fashion magazines, but the dance company cannot make payroll without Danielle giving Masoner $10,000 a month. Her estate is worth much more than that and he gets it all because of her death. Munch muses that his lack of an estate is the reason his ex-wives never followed through on their threats. Stabler reminds him he has his Warren Commission memorabilia. Benson excuses herself to call Novak for a search warrant for the loft.As Benson and Stabler search, Masoner tells them they will not find anything because he would never hurt his wife. Stabler comes from the kitchen with gloves and a vial of Dieldrin. Masoner denies they are his before his front door opens. Naomi comes in apologizing for her tardiness only to stop when she sees the detectives. Benson greets her, but asks if she should call her \"Jen\" instead of Naomi.In the interrogation room, Naomi declares Masoner did not kill Danielle. Benson suggests the affair gives her reason to lie being sure to remind her of her use of the name \"Jen.\" Naomi explains Masoner only used the name when he told Cheales about their sex life. She asked him to stop. Benson reminds her she has been lying to them for three days. Naomi clarifies she lied about an affair, not murder. Benson believes the two are related. When Naomi tells her she was with Masoner in his office when Danielle was killed, Benson suggests they killed her together.In another interrogation room with Danquiss present, Masoner denies he or Naomi committed murder. Stabler and Novak tell them the vial of Dieldrin found under his sink and him telling Naomi he would be a free man soon guides them from adultery to murder. After telling Masoner to be quiet, Danquiss asks them to step outside.Danquiss tells Novak and Stabler they have the dots, but they cannot connect them. When Stabler claims the vial connects them, she reminds them it is circumstantial. Novak will take that kind of circumstantial evidence over three eyewitnesses any day. Danquiss suggests Stabler could have planted the vial before claiming it could have been left there by the previous tenants. Danquiss tells Stabler that juries believe her fairy tales as if she were Tinkerbell before confirming they did not find Masoner's fingerprints on the vial or at the crime scene. She reiterates the fact he was with his mistress and they cannot prove otherwise. When Benson joins them, Danquiss leaves to allow them to further dismantle our criminal justice system. Stabler comments to Novak and Benson the temperature in the room goes up five degrees just from Danquiss leaving the room. Benson reports Naomi swears she was with Masoner and warns it will be tough to break the alibi. Novak recounts Warner saying Dieldrin is banned in the US causing her to wonder if Masoner has been to Europe recently. Stabler reminds her he would not have to have been there to purchase something from there. Benson comments she likes to see her tax dollars at work as they go to find out if the Feds have a record of it.At the Department of Homeland Security, Agent Hellerman tells Benson and Stabler they keep tabs on illegal chemical sales around the world because they are cheap and dangerous making them good weapons. He tells them Dieldrin is a pesticide that killed some endangered species and farmers causing it to be banned since 1987. He believes it is hard to get since it is out of production, but can be obtained on the Asian black market or on the internet. They have found it in Jakarta, Bangkok, and Kanagawa, Japan. When Benson asks if he will check for sales to Masoner, he agrees to do anything for her. He locates the sale of one vial from Kanagawa to Masoner and agrees to print the shipping receipt as Stabler's phone announces a call from Kathy. After she thanks Hellerman, he attempts to ask her out but is told to stick to hunting down terrorists before she joins Stabler. He tells her Dickie was suspended for busting a kid's lip open. When she comments on his fatherly pride and her approval of his talking to Kathy, he asks for the receipt.In the interrogation room, Benson shows Masoner the receipt and informs him he became the owner of a two gram vial of Dieldrin three weeks prior. When he denies it, Benson reminds him his credit card was used and Stabler reminds him the shipment had to be signed for. Masoner claims his credit card was stolen and someone forged his signature. Novak calls it the icing on the cake. When Danquiss tells him to be quiet, Novak agrees saying she does not need a confession with their evidence. Danquiss doubts it.Novak informs Benson and Stabler Danquiss will push for Manslaughter Two. Stabler thinks she will use the Twinkie defense while Novak believes she will claim extreme emotional disturbance. When Benson asks if a jury will buy it, Novak tells her they need witnesses to testify to Masoner being a creep. Stabler does not think it will hard to do. When Cheales interrupts them, Novak excuses herself to her office. Cheales thinks he is paranoid after Danielle, but expresses concern over Naomi's failure to return home the night before. Benson is astonished Naomi did not call him. Stabler tells him she is there and he need to talk to her.As they are preparing to listen to Naomi and Cheales talking in the interview room,  Benson compliments Stabler on his decision to let them speak. He explains he figures Naomi is more likely to talk if he confronted her. Cheales asks Naomi how she could do this to him. She explains she felt smothered. She tried to tell him, but he would not listen. When he says he loves her, she corrects him saying he wants to control her and that is not the same thing. He wonders that with the people she is around why she chose him. She tells him she loved him, but he never believed it and pushed her away. She apologizes after he asks if she was going to sleep her way to stardom. She denies sleeping with Masoner in their home before he orders her to shut up saying he does not want to hear it. As he leaves, she asks for him to wait. Benson passes him on her way in and with Stabler behind her she tells Naomi people fall in and out of love all the time. Naomi tells them Masoner said she could dance two leads every season. She feels terrible because she did not want him to find out that way. When Naomi's breathing becomes a struggle, Benson asks if she is okay before she passes out. While Stabler performs CPR, Benson calls for an ambulance.At the hospital, Stabler attempts to hand Benson a soda but is told she does not drink them any more. When he asks if there are any other major changes he should know about, she comments on his change from suits to jeans. He explains it is for comfort before asking if she thinks Naomi was poisoned like Danielle. Benson confirms they had the same symptoms. The doctor interrupts them to let them know Naomi is stable, but she may get worse. She has Alpha-1 Antitrypsin Deficiency, a genetic condition that slowly eats away at the liver. She collapsed because her blood pressure dropped due to an infection in her shoulder from a unsterile injection. When they are shown what was removed from her shoulder, Stabler identifies it as an RFID chip and believes he knows who put it there. The doctor informs them it must have been implanted when Naomi was unconscious because she denies knowing who put it there. Stabler comments it is a high-tech way of keeping tabs on a cheating wife. Cheales invented a ho-jack. Benson realizes he has known about the affair for a while and believes he could get Dieldrin. Stabler concludes Cheales framed his wife's lover for murder.As Cheales explains the necessity of protecting information to prevent a \"back-orifice\" attack, Stabler guesses that would hurt announcing their presence. Benson notes his lack of surprise at their presence before he asks them not to make a scene. Cheales denies killing Danielle. Benson informs him they are there about Naomi.In the interrogation room, Cheales explains he put the chip in Naomi so that he could keep tabs on her. Stabler reminds him Naomi is a human and not a pet. Cheales defends himself saying she was cheating on him. Benson reminds him he had no right to tag her. Cheales believes that in 15 years everyone will be implanted with the chip. Stabler wants no part of it. Cheales dismisses it as someone not understanding the technology.At the Cheales residence, Morales explains the RFID chip reader was installed in the lock mechanism. Stabler tells him they were told it was for keyless entry. Morales informs him it records coming and going times for anything with a chip installed. Benson adds the possibility of it being implanted. Morales tells them that piece was not the only one. Benson wonders where the others are.At TARU, Morales shows them two other chip readers telling them they were found at the dance company and at Masoner's. They kept a record of whenever Naomi entered a door and Cheales downloaded it to his computer or PDA.Benson plugs Cheales's handheld into the station's system. Cheales uploaded and analyzed Naomi's every move. He knew when she was with Masoner. Munch joins the conversation saying technology makes it easier for people to spy on each other. Stabler reminds him that not everyone is a snoop. Munch asks if he uses spy ware to monitor his kids. Stabler defends himself saying there is no way his kids are going to surf the net without him knowing where they are going. Munch considers it parents acting as Big Brother. Stabler reminds him Cheales is a killer who tracks his wife like cattle. Benson adds they have to link him to Danielle's death.Cheales does not believe they can prove anything. They tell him it is adding up since they have the RFID chip from Naomi. Stabler muses a possible second murder charge. Benson comments techies sing the praises of technology without knowing the costs before cuffing him for a field trip.At Mercy General, Benson and Stabler show Cheales his wife in a hospital bed. Benson explains his RFID chip put her there. Cheales complains they did not tell him she was sick. Benson reminds him she is there because of him. Stabler tells him he needs to learn to sterilize needles if he wants to play with them explaining she has an infection in her bloodstream. When Cheales asks to see her, Benson demands he come clean first. He tries to explain her liver condition, but is told they already know. He agrees to tell them everything if they let him see her to explain  understand why he did it so she will understand.Cheales tells Naomi he drugged her tea one night before bed three weeks prior so he could implant the chip because he thought she was cheating on him. She asks if he feels better knowing. He was afraid he was going to lose her claiming he never loved anyone more. She believes he is obsessed. He killed Danielle to frame Masoner. And now he has killed her, too. He manages to express his love for her before she flat lines. Stabler opens the door to yell for a doctor as Benson steps in to move Cheales out of the way. Cheales begs the medical personnel to save her as they work on her. Benson tells him that as long as Naomi is alive he only faces assault charges, but if he does not start talking he will face double homicide charges because they will not be able to help him. He tells her Masoner took the love of his life so he took his. They move out of the room as the doctor says they need to get Naomi to ICU.As they are following the gurney down the hall, Cheales tells them he followed Danielle. He pretended to run into her and spilled it onto her arm. He put it under Masoner's sink after Stabler showed up. When he asks them to tell him Naomi will be okay, Benson informs him he is under arrest for the murder of Danielle Masoner. As they turn to leave, they see Masoner approaching them. Masoner tells them Cragen informed him they were there. He wanted to thank them for catching the right and to say \"Screw you\" for putting him through hell. Masoner greets Cheales and asks if he tried to kill Naomi as well. When Cheales tells Benson and Stabler to get Masoner out of there, Benson informs him they cannot do that. As she moves him one way and Stabler blocks Masoner from advancing, Cheales gets by her to punch Masoner with his cuffed hands. Masoner fights back causing them to fall to the floor. After a few good punches, Stabler pulls Masoner off of Cheales and orders him to leave.In the squad room, Novak wonders what they were thinking by taking Cheales to see his wife. Benson reminds her she got the confession. Novak suspects it will be thrown out because of coercion. Stabler reminds her they were leaning on a suspect. Even though Novak knows Stabler broke up the fight, she believes he took his time resulting in a beaten up suspect Novak questions if Benson is rusty after being gone so long. Stabler tells her she is out of line causing Novak to wonder what his excuse is. When Benson asks if she is done assassinating their characters, Novak asks if she is finished flushing the case down the toilet. Cragen arrives to inform them Naomi's liver failed and will die in 48 hours if she does not receive a transplant from Cheales. Novak reminds them his confession and arrest took his ability to donate away unless they get a special dispensation from the corrections commissioner.Tom Sablone, Corrections Commissioner, confirms Benson and Stabler want him to release Cheales so a doctor can cut him open before denying their request. Benson reminds him Naomi will die. He tells her the guy responsible is in his custody and is a murderer despite Benson's reminder of it being a hospital. Stabler asks him if he wants to be one because his actions determine whether Naomi lives. Sablone believes he is a flight risk because an inmate in Kentucky escaped under similar circumstances. When he tells them he does not have the money or manpower to guard Cheales, they volunteer to guard him and transport him. He admits he fears future requests if he grants this one. Benson tells him Naomi has 48 hours to live and is innocent. He has the power to save her.Benson informs Cheales she heard his surgery went well. Cheales tells them the doctor told him Naomi has a good chance so he can do his time knowing she is alive. He thanks them then as he is wheeled out of the room, he tells Naomi he loves her. When Benson asks how she is feeling, Naomi tells her she is tired. The roses on the table are from her mother. Masoner has not called. Stabler tells her to take care of herself before attempting to leave. She stops them to have them tell Cheales she said thanks.As they leave, Benson and Stabler agree that \"Love's a bitch.\" Benson realizes they have been partners for years and do not know each other's blood type. A positive. When they get in the elevator, Stabler informs her he would give her a kidney. She tells him he will not be able to if she gives him hers first. She smiles and he turns to look at her as the elevator doors close."},{"episode_title":"Cage","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/cage-913605\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"As they are driving from Albany to New York, Eden sings a song she is told to sing while handcuffed to the seat in the van. After Marc is told he is suppose to be singing as well, Eden tells Frank Hovis she is tired but is told to keep singing. He takes his eyes off the road long enough for the van to swerve in front of an oncoming vehicle. Alma Cordoza warns him and in an effort to correct the move he sends the van off the bridge into the river.When Stabler arrives on the scene, Munch tells him the van tried to take a shortcut to Brooklyn but the river got in the way. Munch shows him the marks on Eden's wrist when he questions the reason for having the case. Stabler introduces himself and asks who did it to her, but gets no response. Munch tells him she and Marc refuse to talk. Tutuola calls them over to the van after it is brought out of the water to show them the handcuffs. He believes the driver freed the children before escaping. O'Halloran informs them there were two adults. One male who is missing his hair piece. One female who is missing a shoe. They realize they need the children to talk. When they turn around, they find Beck holding Eden.Tutuola informs Cragen Eden will only talk to Beck, but has only identified herself and Marc. He continues stating the van is registered to Frank Hovis of Albany. Hovis is single with no kids and has been arrested for assault. Munch shows them a picture of the van going through the Lincoln Tunnel proving a woman was in the passenger seat. Cragen wants the picture released to the media claiming possible injuries from an accident. After being told Stabler and Beck are interviewing the children, Cragen tells them to get the picture to them to help with the interviews. Eden identifies the woman as Alma, but she does not know Hovis or Marc. She does not know where her sister Rosemary is. Beck denies her request to live with her. Eden claims she does not know where Alma was taking her.Stabler informs Cragen that Marc is not talking and he cannot guarantee he speaks English. Cragen tells him to let Huang try. He asks Stabler's opinion of Beck before asking if he wants Benson back. Stabler reminds him his partner is not his choice. As Stabler walks away, he asks if Munch and Tutuola have anything. Cragen tells him they went to Hovis's mother's house in Queens.Mrs. Hovis claims she only hears of her son when the police are looking for him. When Munch asks to look around, she denies him saying she is a respectable woman who lives alone and does not want her neighbors talking. Tutuola approaches them saying he found items on her clothesline that may belong to him. She claims she does not know where they came from. When Munch claims he hears someone inside, Tutuola promises to protect her as they make their way inside the residence despite her protests. Upon looking around, they decide to open bi-fold doors to reveal Hovis. When Mrs. Hovis tries to keep up the charade, Hovis tells her to stop. Hovis tells them he risked his life to save the kids. Alma claimed if she did not cuff them they would try to jump out. Alma got out fine and left without worrying about the kids. He rents out his van and was hired to drive them from Albany to Brooklyn. Alma did not give him an exact location because she was not very trusting. When Hovis is put in the holding cell, he asks Tutuola if he will get his van back. He explains it is evidence before returning his hair piece and walking away. He informs Cragen Alma's last name is Cordoza. Munch explains Hovis picked them up on a street corner in Albany. When Cragen asks if they have more information on the kids, Beck informs him Albany school district does not have any girls Eden's age with her name and all the boys Marc's age and race are where they need to be. Beck questions if it could be the result of child porn or prostitution guessing Eden may be too traumatized to talk. Beck tells Cragen that Stabler is with Huang talking to Marc. He orders them to keep digging until they find Alma. When Beck joins him to watch Marc's interview, Cragen reminds her he meant for her to help them. She claims she may get a lead from the interview.When Cragen and beck join Stabler as he watches the interview, he informs them Marc has not talked or made eye contact. Beck wonders what Alma did to Marc. Before leaving, Cragen tells them to let him know if Marc talks.In an effort to get Marc to talk, Huang draws a house and asks Marc to draw the people he lives with or his pets. Marc scribbles hastily over the house. When Huang tries to find out why he is angry, Marc tells him to shut up and lunges at him causing Beck and Stabler to rush in to help. Stabler pulls Marc off of him while Beck helps Huang off the floor. As Marc fights Stabler talking in French, Beck tries to calm him by speaking in French. Marc escapes Stabler's hold long enough to grab the pen from the table. He stabs Stabler in the right side of his chest. While Huang tends to Marc, Beck pulls the pen from Stabler's chest after asking if he is going to faint on her.In Cragen's office, Huang uses first aid to tend to Stabler's wound. He guesses Marc may be suffering from Reactive Attachment Disorder. He explains kids who are deprived of love and affection grow up to be unable to interact with others. Some kids withdraw like Marc while others become indiscriminately affectionate like Eden. Often kids from foreign countries suffer from the disorder and their adoptive families do not know until the kids are living with them. Stabler, Beck, and Cragen deduce Eden and Marc were in the van to be returned to their adopting agency. When Beck questions where the kids will go now, Stabler tells her it is not their job any more. She reminds him it will be when someone else hurts them causing Cragen to remind her they have not found Alma. Munch and Tutuola join them. Munch explains he found the cab driver who picked up Alma at 4AM and drove her to 152 Staines Avenue in Brooklyn. Cragen orders Stabler to the ER and everyone else to Brooklyn.Tutuola knocks on the door announcing who they are. When he fails to receive a response, Munch thinks the driver may have given them the wrong address while Tutuola looks into a boarded up window with a stick figure drawn on it. As he returns to the door, Munch questions where Beck is. Tutuola rams his shoulder into the door gaining entrance. During their search, Munch finds fresh milk in the refrigerator causing him to deduce they left recently and in a hurry. Tutuola finds a teddy bear under one of the twin beds. They wonder where the kids are. In the hall, Beck joins Stabler. He informs her the Gablers were found guilty of criminally negligent homicide and will serve two years at most. Beck tells him Eden was put in restraints to stop her from scratching herself. Stabler tries to remind her it is not her fault. She does not believe she can do this because she fixes things, but she cannot fix Eden. Stabler tells her they do not fix things in their unit. She wanted to fix her and she thought she could. He tells her he keeps doing the job because he has to. She does not understand why since they do not make a difference. He tries to assure her that she can do this. When she asks if he is asking her to stay, he explains she must be there for herself. She tells him bye before walking away as he watches her leave."},{"episode_title":"Underbelly","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/underbelly-907820\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After attending a party on a boat, teens make their way to the dock. As two boys make planes for the rest of the evening, one decides to relieve himself so he climbs onto the rail. He sees the body of Chantal floating in the water when he looks down and alerts his friend. Warner informs Stabler and Beck the 14-year-old victim died from blunt force trauma at least two weeks prior. Stabler notes she could have been dumped anywhere. Warner tells them she is the third rape-homicide victim in the previous six months with a paw print tattoo on her lower back. Sandra Garner, 16-year-old runaway from Wichita, Kansas, was found in the Bronx. The other victim was found in Brooklyn, but has not been identified. They were both severely brutalized so the perp's knuckles should be damaged.Stabler guesses the tattoo could be linked to a gang or cult, but Tutuola tells him there is not a gang using a paw print tattoo. Munch considers it to be because they were fans of Snoopy or future students of Yale. Tutuola suggests they have a good tattoo artist to look at it and see if they recognize the work. Beck mentions she knows one named Miguel Alvarez causing Tutuola and Stabler to figure out she has a tattoo. Stabler offers to show her his tattoo if she will show him hers. She claims it would not be a fair trade.After Beck and Stabler show Alvarez a picture of the tattoo, he tells them it is generic so it could be anyone. Stabler inquires about the enforcement of a sign saying \"No Minors Allowed.\" Alvarez assures them he not only checks the identification, but also copies it so he can keep his license. He informs them Lenny Culp, in Brooklyn, will work on minors because he does not have a license and cannot get one due to his prison record.Beck and Stabler announce themselves as they make their way into Culp's establishment. They interrupt Culp as he tattoos a teenager. After looking at the note the teen brought from home, Stabler informs them his son could forge his signature better at the age of eight. They tell the teen to leave without allowing Culp to finish the tattoo. Culp hesitates when they ask about the paw print tattoo, but opens up when Stabler reminds him they caught him in the act of committing a felony and a parole violation. He claims he was told the girls were college cheerleaders. He shows them a pictures of the victims showing off their tattoos together. Beck points out the writing on Chantal's shirt identifying her school as Saint Ambrose. Chantal's foster mother tells Beck and Stabler that she willingly paid Catholic school tuition because she believed Chantal deserved the best in life. Before she was able to tryout for cheerleading like she wanted, Chantal was returned to her crack addicted biological mother after six years of living with her foster mother. She wanted to adopt Chantal, but was told the mother's rights outweighed Chantal's need to be safe. She suspects her mother wanted her back for the welfare check.Beck and Stabler walk with Chantal's mother and three siblings. She informs them Chantal claimed her boyfriend touched her so ACS told her to kick him out. She did not believe Chantal so she told ACS to take her instead. While she is talking, her scooter riding son rides towards traffic being stopped by Stabler just before being hit by a car. The mother acts as if nothing happened before continuing to say Chantal was placed in a group home called Broder House. As they walk away, Stabler tells Beck he knows she wants to hit her. When Beck asks if he does, he looks back at her before saying she is not worth it. He makes sure Beck knows their goal is to find Chantal's killer and put him away.At Broder House, Beck and Stabler are told Chantal left soon after she arrived like hundreds of others. A police report was filed and a letter was sent to her mother. Most of the girls run away to be with their boyfriends, but they will have to ask some of the girls if Chantal ran for that reason. The girls tell them Chantal spent most of her time with Victor. He drives an SUV and buys her junk food. He wanted her to live with him. Chantal left to work for Victor as a prostitute.Stabler arrives into the squad room to Beck looking at the board. When he tells her to go home, she reminds him they already have three dead girls and the fourth one could be picked out by morning. He asks if she knows where to start looking or if she has called Vice. When he fails to receive an answer, he informs her he called Vice and was told the girls work in East New York and they have set up a sting for the following night. He tells her she cannot get over-involved in the cases or each one of them will break her heart. She asks that he move the sting up. While Beck and Stabler sit in the van watching at the track, a girl appearing to be around thirteen uses the van window as a mirror. He comments she is the same age as his youngest daughter. Beck asks how he can stand watching the scene when he knows what will happen once the girls get into a car. After he tells her to sit tight, she bolts out of the van forcing Stabler to tell the other officers to move in. As some take care of the men in the vehicles, the others gather the girls against the wall behind them. Beck and Stabler show them pictures of the victims asking if any of them know the girls, but come up empty. Beck tells them to face the wall so she can check for the tattoo. She calls for Stabler when she finds one. The girls identifies herself as Belinda \"Passion\" Holt. She denies knowing the girls until she is informed they are dead. She tells them they are not dead. They were adopted.Stabler joins Beck in the interview room while she tries to convince Belinda the girls in the picture are dead. When she tries to prove it by showing her the autopsy photos, Belinda tells them she wants to talk to her boyfriend Victor. After Beck clarifies Victor is her pimp, she tells them she and Victor plan on getting married as soon as she is old enough. She identifies the girls in the photo for them. She explains Victor changed Sandra's name to Amber before confirming Chantal's identity. After she identifies the third one as Monique, she explains they are sisters. She informs them the girls were adopted by a rich guy that comes to the tracks looking for nice girls to live with him. She dated him, but was not good enough for him. After Beck gives her the jacket she is wearing, Belinda tells them Blake is an old, white guy that is kind of cute. He drives a black Benz SUV and lives on Fifth Avenue.Fin informs the team 19 white guys own black Mercedes SUVs, but only four live on Fifth Avenue. Munch adds only one of them has a habit of beating women. Blake Peters. Peters is managing partner at a law firm. His ex-wife filed a bunch of domestic violence reports. Stabler notices the cases were dismissed and Peters was sent to an anger management course. When Beck and Stabler arrive at Wallis Inn, they are told Peters checked in two hours prior with his very young wife. To help them gain entry to his room, they threaten to lock the place down for being a public nuisance for prostitution. As Stabler knocks on the door, Beck tells the guy what to say. When Peters opens the door, Stabler cuffs him while Beck informs him he is under arrest for Statutory Rape. As she begins reading him his rights, she watches Candy frantically trying to get dressed.As Beck escorts Candy into the squad room, Candy swears she is over 18 so Beck asks for her identification. Candy dumps her purse onto Beck's desk making it easier to locate and hands it to her. Beck finds she is 19 so she asks how long she has been working the streets. Candy denies this saying she attends Manhattan Tech with the help of her parents. She explains she works at the restaurant where she met Peters that night and was in the mood to party so she ignored his wedding ring. Beck tells her he killed three girls.In the interrogation room, Peters denies killing the girls before explaining his damaged knuckles as injuries incurred while working on his '72 Ferrari Daytona Spyder. Stabler believes his lack of willingness to allow someone to touch the car may be an attitude he shares about the girls. While Peters admits to having sex with them, he denies killing them. When Stabler describes how he believes Peters killed them, Peters rushes to the corner of the room and pukes before denying killing them again. He tells Stabler he wanted to help the girls to get out of this way of life."},{"episode_title":"Infiltrated","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/infiltrated-897536\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Casey is in New York trying the case of a rapist whom Olivia has had dealings with before. Stabler is on the stand when the defense attorney wants to know if his client ever showed his face during the video of the rape. Stabler says no. The defense attorney then wants to know how the rapist was identified. Stabler tells him by DNA- however it was not DNA from seamen (the rapist had a bit of a problem in that area). Elliot tells the court that he was identified by gum that he spit out on the scene. The defense attorney wants to know who found the gum- Elliot tells the court it was Olivia. The defense attorney then alleges that Olivia planted the gum as a form of revenge which is objected by Casey and Elliot says it's a load of crap. He is dismissed and the defense attorney calls Olivia as a witness. The judge orders them to chambers.Oregon: Liv is still undercover with the eco group that she infiltrated. They show the group standing in a state park protesting a lumber company. The sheriff shows up and orders them to break it up, however they don't. The deputies then proceed to forcefully break up the group. T-Bone (a member of the group) punches a deputy and the deputy starts beating him with his night stick. Liv goes in to break it up however the deputy strikes her on the head- knocking her unconscious. New York: In chambers Casey is outraged and says that the defense attorney has obviously found out the Liv is unavailable and is trying to twist the case- not to mention it isn't his turn to call witnesses. The defense attorney says that he has been trying to  serve her for a month and it's as if she has disappeared into thin air. The judge wants to know exactly where Olivia is and Casey says that shes been under with the feds for five weeks- possibly out of state.Oregon: Olivia is asleep in a hospital bed mumbling Elliot's name. One of her friends in the eco group is in the bed beside her wanting to know who Elliot is. Olivia attempts to change the subject by asking where they are. She finds out that they are in the prison ward of the hospital. Hope  her friend  says that she and T-Bone should sue for abuse. Olivia starts talking like a cop and Hope goes off about her defending the deputy. Olivia agrees saying it must be the concussion talking. Hope then asks again who Elliot is and Olivia says no one, to which Hope says it does not sound that way and then mimics her.New York: Casey storms into SVU wanting to know where Stabler is because she needs to find Liv. Cragen tells her to forget about it because Stabler doesn't know. She then asks Cragen if he knows where she is and he says no- to which Much throws in a witty comment. Casey keeps on about finding her and Cragen just keeps saying no.Oregon: Olivia and Hope are still in the hospital. The doctor is telling her she's fine when another deputy comes into arrest her for assault on an officer. Olivia keeps trying to say she didn't do anything and the deputy just reads her her rights. In the sheriffs office the deputy who struck her takes her down to booking and makes smart remarks because she isn't smiling in her booking photo. Olivia gets mad and starts yelling at him that she didn't do anything. He attempts to take her into an interrogation room to which she replies she wants a lawyer and isn't going into some good ole' boy backroom alone with him. Olivia makes bail and is on her way out of the building when the sheriff asks her to come back in to discuss the murder of a man who works for a pharmaceutical company that the group was recently protesting. He tells her that if she can shed some light on the murder than he will think about dropping the assault charges against her. She looks at a photo and says it's a sex crime and walks out the door.New York: Casey is at the FBI building yelling at an agent who stonewalls her about Olivia. He tells her that Starr isn't her case agent and sends her on her way.Oregon: Olivia is meeting with her case agent- Agent Porter- in a restaurant going over the murder. The case agent says if Edg (an eco-terrorist group) is involved then they could get the entire group on RICO charges. Olivia says that her group isn't involved. The case agent tells her to look into the murder from her group and if the group isn't involved then to let the locals handle it and go back to looking for eco-terrorists. Olivia is next seen in a phone booth where it is revealed that she is talking to Finn in New York. She tells him not to mention it because her case agent will go nuts. Finn wants to know if Casey got a hold of her and then hands the phone over to Stabler for him to explain the problem and Olivia hangs up. T-Bone and Hope are shown walking up wanting to know who she was talking to. Hope makes the comment that it was probably Elliot and Olivia says no that it was her lousy public defender- she wanted to know how much to help with the murder.Olivia then goes to the pharmaceutical company and asks questions about the murder victim. She then goes to visit the victims mother- where she runs back into the deputy that had her arrested. They exchange words. Next she is shown outside the victims house where she notices the tape has been cut and someone is there. It is the victims ex-wife who is trying to take evidence (movies and teen clothes catalogs) out of the house. Olivia figures out that the guy was a pedophile.The next day she is once again meeting with Agent Porter. She tries to tell him the victim is a pedophile; he wants to know if someone in the group told her that, and she admits that she got it from the ex-wife. Porter then accuses the group again to which Olivia adamantly defends the group. He pulls out a stack of papers and and tells her to read page six. It's an email from an untraceable account that was sent to the pharmaceutical company and shows. In the email it has all of the workers home addresses. Porter wants to know if she knew about it and she says no to which he replies I guess you don't know your group all that well then.New York: Casey and the rape victim  Chelsea  are in Casey's office talking about Olivia. Chelsea is obviously upset about the whole ordeal. Casey asks her if she saw the rape crisis counselor and Chelsea says no that she doesn't want to keep talking about it  she will be fine once the guy is convicted. Casey asks her what she will do if the guy walks to which Chelsea replies I guess I will kill myself. Casey calls Huang to talk to the victim and asks him find Olivia. He says he doesn't have much clout with the eco dept. because he is the sex crimes guy and they don't really have a need to work together. Casey replies then what the hell do they have Liv for?Oregon: Olivia shows up at a house that the ex-wife is about to show. She wants to know how many girls the guy has raped. The ex-wife begs her to leave it alone and Olivia figures out the the wife left because she caught him in the act. She tells Olivia about the babysitter.Olivia then goes to the babysitter and gets info that there is a hidden room in the guys garage. It is there that he took his victims. Olivia goes back to the victim's house and finds the room. She calls someone and tells them that she has something they need to see. It turns out she called the sheriff. He thanks her for the lead and tells her to stop playing policewoman and leave. Olivia is next seen a press conference that is jointly held by Agent Porter and the sheriff. They are telling the press about the room and a new discovery: a girl who went missing several years back prints were found in the room. The deputy who arrested her then shows up next to her and tells her they get to go back to the station. The sheriff walks into the interrogation room and tells her that it wasn't his doing- the feds asked him to. Olivia tries to play it off by asking what do the feds want with her to which Porter walks in the room and replies nothing. He then says, \"Det. Benson you are free to go.\" Olivia gets upset about him outing her and he gives her a plane ticket to NY. They are walking out and she tells Porter to let her see this case through since she is the one who broke it. He tells her no thanks (hes tired of working with her). She keeps on saying that she has experoence with victims.NY: Back at SVU, Casey is going insane about finding Olivia. Huang walks in and says that he doesn't know. Stabler wants to know if the feds would know if shes all right- to which Huang replies yes, but they might not tell. Casey, obviously upset says I am sure she is fine, but my case isn't. Huang won't divulge who would know where she is to Stabler and Stabler gets upset saying he just wants to make sure she is okay. Huang says he gave a message to his superior who was passing it along. Stabler tells Casey that if Olivia new about the case then she would be there.Oregon: Olivia got Agent Porter to allow her to go with him. In the car, he wants to know if her partner in NY finds her annoying. She tells him that he (Stabler) is her best friend. He (her case agent) says yeah, but does he find you annoying to which Olivia rolls her eyes and says no. She then figures out that the girl is hiding at a childhood fort. They find the girl and get her back to the FBI building. The girl is extremely upset and won't let anyone look at her. Olivia then sends Porter out of the room because he is just making things worse. The girl explains- after much prodding and reassuring- that she loved her captor and that the reason she killed him was not to escape but because he told her she was too old and was making her go find another victim. She then breaks down about how she was only ten. Porter and Olivia talk about how the girl has Stockholm Syndrome while they watch her hugging her parents. Porter then reveals that he got a message from Huang a few days ago and Olivia's face drops.NY: Olivia is seen walking into court where Casey was thrilled to see her. Olivia asks how Chelsea is doing and Casey tells her she will be fine now. The show ends with Chelsea seeing Olivia and saying I thought you weren't going to come to which Olivia says there was never a chance of that happening.**During the time that Olivia was undercover she was known as Persephone James."},{"episode_title":"Confrontation","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/confrontation-888981\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After Elizabeth Hassenback is raped, she is told by her rapist to get on her knees. He collects the sheets and bags them before leaving with the items. She watches him leave before gathering her clothes and dressing. As she begins following him, she calls Stabler to let him know she was raped again by the same guy. He tells her not to follow him, but is told he will get away again. Stabler calls for help as she is confronted and killed by her rapist. When Stabler arrives on the scene, he calls Beck  who is at Attica. After telling her the situation, she tells him she is a five hour drive away and asks where to meet him  crime scene or hospital. He glances at the body in front of him and tells her the morgue.ME Warner arrives at the crime scene to Stabler checking out the body. Stabler tells identifies the 30-year-old white victim and tells her she was raped 17 days prior with the rape kit being negative for semen. She asks him if the rapist came back for more. He tells her this is what happens when civilians take the law into their own hands. When Warner tells him that does not sound like him, he explains the bruises around her neck are from her impact baton and she was following the guy. Warner explains there are no petechial hemorrhages so she was not strangled. She guesses the cause of death is blunt force trauma because of the cranial injuries. He informs her the victim called the rape crisis center and went to meetings to get her life back.At Elizabeth's apartment, CSU tells Munch and Tutuola there were no fingerprints, no fluids, one hair, but they still have to vacuum and sift. Munch tells her the rapist beat her to it from the marks on the carpet. Tutuola notes he took the bedding and the trash. They notice the broken window. While Tutuola assumes she heard the glass break, Munch tells him most rape victims have to take something to sleep. When CSU tells them they only found the usual over-the-counter meds and a well-stocked liquor cabinet, Munch tells them toxicology will tell them what she took.Stabler informs Huang and Cragen the perp is a white male, 5'11\" to just over 6 foot, 180 pounds, brown eyes, brown hair with no visible tattoos or scars. Beck joins the meeting. Stabler continues telling them he held a knife to her throat and wanted to know how she liked to be touched. Huang informs them he is a power-reassurance rapist. Stabler tells them the foreplay was rough and prolonged and the details were clear. She walked him through it for over an hour with no breaks or tears.  In her interview with him, she tells him she was raped maybe 5 times over 36 hours and 47 minutes. He tells her she did good by surviving. The perp tried to make her squat into a cup; when she could not, he cut her face; she finally gave it up. He made her get in the tub where he scrubbed her raw inside and out. Before he left he told her he would see her later.-- Huang thinks he may have drank her urine. He did not wear a condom because he had plenty of time to play. He knew her habits and took total control over her. Beck tells them there is no way this guy is a first timer. Stabler decides to check 61s and Vi-CAP for similar MOs. Cragen tells them to check the 61s in other boroughs to see if he moved around.While Stabler is coming up empty, Beck finds one case in Park Slope where the suspect description and MO match. She is briefly interrupted to deny charges on a call from Attica from one of her husband's killers. She tells him how her husband died. Two fifteen year olds were pulled over in a stolen car. One had a bench warrant. They shot him in the head while she was sitting in their favorite restaurant fuming. When she got home and saw the brass at the door, she knew he was dead. He was shot by two morons who did not have the sense to ditch the gun. The shooter was killed in a prison fight. When Stabler questions why she would refuse to accept the guy's calls but she would drive five hours for a face-to-face meeting, Beck tells him she went to see the killer's body. They are interrupted by another match Celeste Mott, 27, in Queens and Gina Maylor, 32, in Brooklyn. They leave to see if their stories match.Gina tells Stabler and Beck the perp had offered to help her with her groceries, but insisted when she refused. He was friendly and good-looking. He pulled a knife at her door, stayed for two days, and made her pee in a cup. When he put her in the tub, he bathed, douched, and humiliated her. He told her he would see her around and took the cup with him. He raped her again 10 days later. She woke up to him sitting on her chest. She denies hearing the bedroom window break. When Beck questions if she had taken something or was drunk, Gina thinks she does not believe her like the other cop. She explains he told her rapists do not strike the same victim twice. It made her feel raped all over again so she did not even bother reporting the third rape.Cragen and Stabler confront the detective who caught Gina's case. He informs them her story was not supported by evidence and it kept changing. The window was broken from the inside. He reminds them most rapists do not attack the same victim twice. He tells them he has other more pressing cases to work so do not tell him how to do his job. When Stabler believes the guy is just trying to pass the blame, Cragen reminds him he worked the case by the book. When they return to the squad room, Beck informs them they have another match. White female under forty. Elizabeth was raped twice. Gina was raped three times. Celeste Mott was raped twice that they know of, but she moved with no forwarding address. Beck informs them they were all raped 17 to 23 days apart. Megan Carlisle,32, raped once five months ago. When Cragen points out that does not work with the MO, Beck tells him everything else is the same and she should have been raped three times by now. Stabler guesses she did not report the other rapes. Cragen tells them to go find out, but to go easy on her.When Beck and Stabler arrive at the Carlisle residence,  a pregnant Megan answers the door. She allows them in after they inform her they have not caught the guy yet while calling for her husband. They tell her they have new leads on the case. They believe the guy who attacked her rapes his victims again, except for her. When Megan claims she must be unattractive to the guy now, Stabler informs her rape is about power and rage. When Beck informs them she should have been raped again around the time she conceived, they are promptly kicked out. Before they leave, Stabler apologizes for upsetting them.On there way out, Beck asks Stabler if he has anything to say. When she gives him some examples, he tells her he knows she was lying. Beck tells him Megan is so desperate to have a child she is willing to protect her rapist. When she asks him if that is twisted, he tells her his old partner is a child of rape. She reminds him there were no options then. When he asks if she is trying to say it was easy for Benson's mother, she tells him she means decisions are simple when there is no choice. She reminds him since they have no forensic evidence, then the baby could give them the DNA if he was the sperm donor.At the precinct, Beck fills Cragen and Huang in on her theory about the pregnancy. Cragen reminds her they have to have Megan's full cooperation. Stabler tells them all of the rapes do not occur within the 17 to 23 day time period, because Gina was raped ten days later. Huang informs them the time line coincides with the victim's menstruation cycles. When Stabler questions the suspect's desire to impregnate his victims, Huang reminds him he only collects the urine once and he does not drink it because he is testing it to find out when they will ovulate. When Cragen wonders about the theory, Huang informs him men have a desire to procreate as well. Stabler reminds him there is birth control and the morning after pill. Huang reminds him the guy stays there so he will know what is the their medicine cabinet. Beck reminds them the morning after pill has to be taken within 72 hours. Stabler realizes the perp stays with them to give his sperm enough time to swim upstream. Beck believes the scrubbing is to make sure they do not catch any strays. Stabler realizes they do not look deep enough. When Huang tells them autopsies do not consist of reproductive tissue resection, Cragen tells them he will call Warner. Munch and Tutuola interrupt them to let them know they found glass in the alley under the victim's bedroom window and the buildings are managed by the same company. Cragen sends Munch and Tutuola to find out who has access to the master keys.At Ensor Property Management, Munch and Tutuola are told they have 500 employees and 140 of them have access to the master keys. When they show a list of addresses, they are told they all share the same property manager Ted Wilmington. He is looking at another piece of property.When Munch and Tutuola bring Wilmington into the interrogation room, he tells them over a hundred people have access to the master keys and they have the wrong guy. He tells them people do not have to like him as long as they do as he says after they ask if he has any enemies. He tells them he does not have to rape anyone. He is not relationship material so he takes what he wants. Tutuola tells him that sounds like rape and asks for a hair sample. Since he does not think it sounds like fun, he asks if he needs a lawyer.When Tutuola carries in two boxes with Munch walking beside him, Stabler asks what it is. They tell him it is personnel files from the property management company. Since Wilmington is not their guy, they must check out the 139 employees with access to the master keys. They asks him to join them, but he declines. Beck informs Stabler Warner told her she cannot get DNA from Elizabeth because her body was already released to family and they had her cremated. When he looks at the board, Beck asks what he sees. He tells her the victim pool is dwindling so he will have to go on the hunt again if he has not already. One victim is dead, one moved, and one pregnant. They check the information on Gina and find if he is going to rape her again he has to do so within the next few days.Beck and Stabler catch Cragen on the street. He does not believe the perp will strike Gina since the property management groups knows what they are doing. Stabler tells him he has no other choice it is a compulsion. Beck reminds him everyone knows they are still sorting through over a hundred suspects and that will take time. Stabler adds they do not know they have figured out the time line. Cragen asks how they want to work it. Beck tells him they want to put Gina in a safe house and send in a decoy. Cragen tells them to set it up.Stabler tells Gina they have plain clothes officers doing a sweep. He reassures her safety telling her she will be at a safe house and she will be protected until she takes her life back. He warns her they cannot guarantee they will catch him. When Gina tells them she has every right to be afraid because he has raped her three times, Beck reminds her they are trying to stop him from doing it again. She tells Gina she cannot stay in the apartment for the rest of her life. She needs to get pissed off and take back her life. When Gina goes to pack a few things, Stabler tells Beck she is not qualified to be her counselor and she does not belong in this unit. Beck tells him the victims do not need his shoulder to cry on, but they need information.  Once raped a woman is seven times more likely to be raped again. When he thinks she is blaming the victim, she defends herself saying women need to be better prepared. They need to be aware of their surroundings, watch where they park their car, and look at any guy's approach with caution and suspicion. While Stabler believes that is fear, Beck believes it is survival.At home base, Cragen introduces Patrol Officer Randa Lewis to Stabler and Beck. She looks enough like Gina to pass for her at a distance. Cragen tells her to run a few errands, show her face around the block, then stay in the apartment. Stabler tells her Beck will have her back outside and every room is wired. Cragen asks if she has any questions before Beck and Lewis leave.In the squad room, Munch tells Tutuola he wants to be known as the intrepid Detective Munch. Tutuola accepts Luke Dixon's file Munch hands him and asks about him. Munch tells him the office manager has a degree in microbiology from Columbia so he called his former employer, a biomedical firm, and found out he was fired for sexual misconduct with the promise of bad references to future employers. Tutuola believes since Dixon cannot get a job in his field so he rapes women to get even. Munch tells him they have enough probable cause for a warrant. Tutuola suggests they call Cragen to let him know about the suspect.As Officer Lewis heads in the apartment building, a jogger wearing a hooded jacket stops briefly before passing. After making sure the next officer has her, Beck goes back out to look for the jogger. After getting off the phone, Cragen tells Stabler a picture is on its way of the suspect and office manager Luke Dixon.    While searching Dixon's apartment, Munch and Tutuola find 50 boxes of ovulation kits. After they notice the sofa is not against the wall, they find a hidden door. When they open it, they reveal a chart with the initials of victims, ovulation dates, and rape dates.Beck checks an alley for Dixon. As she looks around, she sees him discard his jacket in a trash can by the road. She runs to him identifying herself as a police officer. He swings at her with a knife. While she is against the building struggling to get Dixon and his knife off of her, Stabler calls requesting her location. When there is no response, he and Cragen run to find her. Beck finally gets him off of her and knocks the knife to the ground. She keeps hitting and kicking him until Stabler pulls her off and Cragen cuffs Dixon. Beck tells Stabler where the knife is before telling him she was going to kill Dixon. Novak yells at Beck about fighting Dixon. Beck tries to tell her he had a weapon leaving her no choice. Novak informs her Dixon is claiming self-defense and she never identified herself. When Beck tells her criminals lie, Novak reminds her of what her jacket looks like. Novak warns if IAB thinks Dixon's story has merit then she will not have her in the unit. Before Gina will do the line-up, Novak tells her the trial will give her life back to her. Gina confidently identifies Dixon as her rapist.Stabler and Novak walk into the interrogation room to Dixon's lawyer announcing he will put photos of his client's injuries into his exhibits. When they ask Dixon if he has access to master keys, he clarifies a lot of people do. Stabler interjects saying they do not have ovulation kits and a rape calendar. Dixon claims he is performing an experiment checking the effectiveness of hormone tests. When Stabler tells him his calendars coincides with the victim's statements, he claims it is a coincidence because the women volunteered. When he claims the incident at his former employer's was a misunderstanding stating unattractive women cry wolf, Novak reminds him wolves are predators. Dixon claims the victim's identification of him was a case of mistaken identity. He willingly volunteers a DNA sample.When Beck and Stabler arrive at the courthouse, Novak informs them Gina is not there and she is not answering her phone. Stabler tells her they will check it out. When they arrive at her building, they are told water is leaking from her apartment. When they gain entry, they find Gina in a tub full of red water with her wrist slit. As soon as Beck sees her, she backs away.In Novak's office, Stabler informs her Gina did not leave a note. Novak blames herself saying she pushed her too hard. Beck tries to tell her it is not her fault and reminds her Dixon is a rapist and murderer. Novak says she can try to get Gina's statement in, but they will have to prove Dixon directly caused her suicide. Stabler suggests Megan. When Novak tells him she could not identify Dixon as her rapist, he tells her Dixon's calendar proves Megan lied because he is the father of her baby. Novak informs him the only way they can compel a sample of amniotic fluid is to charge her with obstruction and perjury. Beck tells her they have to because there are other victims out there and they cannot let him walk.Novak and Stabler meet with the Carlisles and their attorney, Lorna Scarry. Megan confirms she has to be positive before identifying her rapist. Stabler reminds her she was raped on May 21st and asks if she was raped again on June 17th. Novak shows her a copy of the chart in Dixon's apartment. She tells her the dates June 17th and July 11th are beside her initials. Scarry claims the initials belong to someone else since Megan cannot identify her attacker. When Novak suggests Megan is obstructing justice because her rapist impregnated her, Mr. Carlisle claims his wife would not allow her rapist's child to grow inside her body. Novak asks for a sample for testing. When Megan does not cooperate, Novak shows Scarry an arrest warrant for obstruction while Stabler places Megan under arrest. When Mr. Carlisle grabs Stabler's arm to stop him, Stabler warns him not to make matters worse causing him to release his arm. Scarry tells Mr. Carlisle they will make bail and fight this before telling Novak she is making a big mistake.Novak tells Judge Taten Megan has wanted a baby so badly she will perjurer herself to have this child. When Scarry tells her the people insist her client was raped more than once. Novak tells Taten she wants to compel an amniocentesis to establish paternity. Between the calendar saying she was raped twice and an obstetrics expert, they will prove the rapist is the father. Scarry cites Megan's difficulty getting pregnant increases the likelihood this test will harm the baby. Judge Taten tells Novak she will have to wait because the health and welfare of mother and child takes precedence.Beck catches Megan as she leaves her home. Beck informs her another victim is dead. She explains she knows she was raped twice and when he came back the third time she begged for her baby's life causing him to stop. Beck tells her if she will let them do the test, they will go away. When Megan tells her she does not know the baby is his, Beck tells her to find out explaining whether they find out now or in six months they will know who the baby's father is. Megan tells her they will be long gone by then causing Beck to tell her that her rapist will go free.Mr. Carlisle comes down the corridor of the hospital asking Beck where his wife is. She informs him she is in an exam room. After the nurse hands Beck the sample, Megan tells her husband she had to. He tells her as long as he did not know they would have been alright. He leaves his wife standing there to ask Beck if she is satisfied.Novak informs Dixon and his lawyer they have his pubic hair from Elizabeth and his DNA from the amniotic fluid of a pregnant victim. He acknowledges Megan is the pregnant one and asks the sex of the baby. When she tells him he will never know, he threatens to sue for his parental rights. She tells him to keep talking because that will prove Rape One. Dixon tells her birth defects, genetic disease, and mediocrity have become normal. It has to stop. You put the right genes into the right womb, nurtured by the right people. Novak offers 15 to 25 for each count if he provides the names of the other victims on his calendar.Mr. Carlisle comes to the squad room at Stabler's request. He shows him the pictures of Dixon's other victims saying that is why his wife came forward. There will not be a trial so none of it will be on the public record so he can move on with his life. When Carlisle tells him it is not that simple, Stabler tells him it can be done if he wants it. He warns if he makes his wife give up the baby, she will resent him for the rest of his life. Carlisle asks if he could raise a rapist's child. When Stabler tells him to go talk to his wife, he asks what is there to say before leaving. Stabler tells Beck that Carlisle is not ready to deal with it and may never be ready. Beck tells him Carlisle cannot move forward until he does. She asks Stabler to take a ride with her.When Tracy Monroe asks who the bull is, Stabler tells him he is there for his protection before he introduces himself. Monroe introduces himself to Beck and admits to killing her husband. Beck asks if he is admitting guilt so she will not protest his release on parole. He denies that as his reason. She explains she knows everything about him, but she realizes if she fixates on him, she will disappear. She tells him her husband loved her with everything he had and he would be mad if she did that to herself so she has to let it go and forgive him somehow. She shows him pictures of the life he took so he would know how much that life meant to everyone who knew him."},{"episode_title":"Uncle","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/uncle-881124\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Beck and Stabler are greeted by a patrolman Eric Bruny, explaining he was in an area close by when he received a call telling him to come to this location. He explains a co-worker called it in saying she had not made it in to work. As they enter the room, he tells them the victims are mother and daughter. Stabler lifts up the sheet noting they are wrapped in clear tape. Beck notes the breasts and genitals are slashed. After seeing them covered in sheets, Stabler asks if the officer found them this way explaining it is not typical behavior. The officer tells them he got the sheets from the linen closet out of respect. When Stabler notices the girl is holding something in her hand, he tells Beck to help him. Beck reluctantly complies asking if they should wait for the ME. As soon as he tells her no, he tells her to hold the wrists. As he pries the hand open he estimates the time of death being 12 hours prior. He pulls out a crucifix from her hand. Beck locates a picture showing the necklace on the mother. She assumes the girl was reaching for her mother and praying for the help that never came.When Cragen arrives, Beck quickly explains she needed some air. She explains the building does not have a doorman, but the perp would have had to be buzzed in. When Cragen tries to explain a theory of the attack, Beck interrupts him poking holes in his theory and adding her own. She tells him the victim was a quiet single mother with no boyfriends and she worked for a law firm for businesses as a receptionist. She shows him all of the hardware thinking she was trying to keep someone out. Stabler explains the hardware is normal for a single mother in the city. Cragen theorizes the girl might have known the perp. Warner chimes in saying she does not see how anyone that would do this would be a friend to either one of the victims. She explains the vaginal trauma was worse on the girl, but that was probably due to her age. She tells them both females were assaulted in the exact same manner. When Beck asks if there could have been two perps, Warner informs them the perp cleaned them up so they will not have DNA to find out. Stabler approaches Beck quietly and tells her everyone loses it with their first kid case. When she tells him she will get used to it, he tells her when she does she needs to transfer out. They find a past due bill and a pay-stub from Folsom, Young, and Klein.Munch and Tutuola speak with someone at the firm. They are told Gabby's daughter was hospitalized with asthma. The bills were turned over to a collection agency so she borrowed from $500 a month from petty cash, but replaced it before the accounts were reconciled. She also informed them Gabby's landlord offered to subsidize her rent, but she never took him up on the offer.Beck and Stabler haul in Gabby's landlord. Beck asks if he offered to give her free rent in exchange for sex. He tells her in America it is called quid pro quo. Stabler informs him the NYPD calls it solicitation. He tells them that since she never did him then it was no harm no foul. When he asks Beck if she was ever with a guy who paid everything for her, she tells him no. Then he asks if she was ever married. Without an answer from her, he continues saying she banged a guy for a couple of years and is now getting alimony. She takes out her gun and walks over to him putting it sideways in his face telling him her husband's killer is in Attica. She removes the clip and tells Stabler she is going to put it in her locker. When Stabler asks how much he was knocking off her rent to bang her daughter, he tells him he is not a pervert. He informs him the only reason Gabby turned him down is she found a sugar daddy named Williams.When they go to the tennis club to speak with Mr. Williams, he tells them he and Gabby never had a relationship. Beck and Stabler suppose a relationship between the receptionist and a lawyer may be frowned upon. Mr. Williams explains she is probably worth more than he is. Beck informs him she needed money. He tells her Gabby never asked him for a penny. When he informs them another associate at the firm set up this tennis match weeks ago, Stabler tells him to ask for a rain check so he can come to the station and answer some questions. He reminds them he went to law school and he does not have to come with them before heading to his game. After Stabler tells Beck they will wait for him, Beck tells him she is not patient and tennis is boring. She walks to the microphone and asks Mr. Williams if they would  find his DNA on any of her clothes causing him to run back up the stairs to them. He tells them they had sex once in his office. When Beck tells him they have a witness placing him at her apartment, he explains Gabby wanted him to meet her daughter so he took them on a picnic where she told him she loved him. Before he could break up with her, she panicked about a homeless guy hugging her daughter. And her daughter's friend, Lupe, told them not to hurt him because he is their friend.Stabler and Beck speak with Lupe. She tells them they took the guy everyday. She explains he thanks them by hugging them. Stabler asks her to take them to meet him. Lupe's mother tells them they should lock up all of the homeless. Stabler tells her they do not know if the guy did anything or not. Lupe makes sure they are not going to hurt him before telling them they followed him to the spot where he sleeps as she points to a tunnel. They decide to search the cardboard box and find an old man. Stabler explains the guy does not fit the profile because of his age and the fact the perp was organized. Beck forces the guy awake and notices his hand is bleeding. While she searches him for weapons, Stabler looks over the box and notices he has clippings of SVU cases hanging up.In the interrogation room, Beck asks the homeless guy if he is a pervert or if he is a fan of Stabler's. While she goes through the clippings, Stabler tells her a little about the cases. Huang dictates his profile while copying pictures saying the perp likes to inflict pain to cause the victim's suffering that arouses him. When Beck shows him a picture of the little girl, she slides his chair back quickly being stopped by Stabler pushing him back to the table. A sadistic killer draws out his kills to last. He is most likely a white middle forbidden>Stabler arrives at the psychiatric hospital and asks Beck if Munch has arrived. She tells him he is already inside. Beck tells him she cannot go inside. Stabler reminds her Munch reached out to them. When she refuses, Stabler enters alone. Munch asks him to tell Andrew he was not responsible. Stabler tells him he had a psychotic break. Munch tells Andrew he will have to stand trial, but they will find him not guilty by reason of temporary insanity and send him back there to get better. Stabler tells him to take his medication. Andrew tells them he does not want any medication. He tells them he is responsible and must pay for what he did. He tells Munch he just wants to say goodbye. He tells him goodbye and walks off down the hall."},{"episode_title":"Recall","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/recall-875075\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Beck and Stabler are forced to stop chasing a running perp from their car when they come to a fence. With the perp still in their sights, they continue the pursuit on foot through a parking lot where he temporarily takes shelter before running through the streets and losing them. When O'Halloran arrives, Stabler has him dust the Jaguar and the Chevy the perp was hiding between for prints. Beck and Stabler meet up with the victim, Nikki, at the hospital. Stabler tells her they are there to help her.When Beck and Stabler arrive at the precinct, Munch informs them the victim requested a Ginger Ale, but he cannot find one. When he inquires as to how bad the attack was, Stabler tells him \"M to P and P to V\" before having to explain their meaning to Beck. Beck questions about how many perps they actually catch and how many are serial rapist before Stabler asks her if she is ready to interview the victim. Beck tells him she will run the MO through the system while he interviews the victim.Nikki tells Stabler he forced her to get on her knees and perform oral sex on him before slamming her against the wall and raping her from behind. When he was finished he wiped her down with wet naps that have alcohol in them. In the next room, Tutuola tells Cragen no evidence was found at the scene. Nikki then tells Stabler the perp was probably in his 40s, has a backwards L-shaped scar on his hand, and she will try to describe him to a sketch artist, but it was dark. After Stabler informs Cragen the uniforms could not find the perp, Cragen has him close the door and asks about Beck. When Stabler tells him they are in sink with each other, Cragen warns him to keep an eye on her. The talk is that Beck was overzealous in Warrants so she was kicked off the team. Beck interrupts them to let them know O'Halloran called with a hit from the prints. They belong to Barry Cole, an ex-con. Cragen sends them to pick him up.Beck tells Stabler she was born in Denmark. She explains that she met her husband while she was studying in Germany while he was stationed there in the military. When they were married, she moved to the states. He explains he and Benson had been partners for seven years, but she was pulled to do an undercover assignment. When she tells him she was in Warrants for 3  years, he asks if she just got tired of it. With the question left unanswered, they arrive at Cole's apartment. After a few pounds, the occupant allows them access to the apartment. She denies Cole was there, but Stabler sees him running away when he looks out the window. Once they catch Cole, Beck tells Stabler his attire slows him down.When Beck and Stabler arrive at the station, O'Halloran pulls Stabler aside to inform him Beck left out part of his conversation with her. He told her he was not finished processing the prints. He called the car rental agency the Jaguar belongs to and found Cole is one of their employees. Cole's prints were found on the passenger side of the Jaguar, while the perp was on the driver's side holding on with all ten fingertips. When he ran those prints, he found they belong to Martin Trenway, a former ADA. Stabler thanks him for saving them and goes to confront Beck. Stabler tells her to cut Cole loose before Cragen finds out.Trenway explains he rented the car for a deposition in Jersey. He tells them he has receipts from the Holland Tunnel if they want to see it. When Stabler notices his bandaged wrist and asks about it, he claims he hurt it playing basketball with his son. When Beck complains Trenway has an answer for everything, Stabler tells her he just wants to check for the scar. In the squad room, Beck tells the team Trenway looks a lot like the sketch. When Cragen clarifies the sketch probably resembles about 10,000 other guys as well, Beck reminds him Trenway was the one whose fingerprints were found on the Jag. Cragen tells them if they go after Trenway, they have to have everything in order. Beck informs the team Trenway is 54 and grew up in Douglaston, Queens. He attended Cardosa High School, Cornell, Duke Law School. He has been married to the same woman for 30 years and has two sons. He currently lives in Stanford, Connecticut. Beck reminds them he is a lawyer so he knows how to get rid of evidence. Cragen tells her middle-aged men do not suddenly start attacking women. When Novak tells them she wants Trenway in a line-up, Beck suggests a hand line-up since Nikki did not get a good look at his face. Stabler and Novak take Nikki into the line-up. Stabler tells the men to make a fist and keep their hands still. Nikki stops in front of Trenway's hand before Stabler escorts her out.Trenway explains the scar is from tendon transfer surgery, but many people have one just like it. He claims he left work around midnight and they can check the security tapes. Beck tells him the security guard says he left at 9:45 and returned around 11. Stabler informs him that is the time frame of the rape and chase. He explains it away saying many people are out at that time of night. They tell him his prints were on the outside of the Jag, but he tries to say he tried to say he dropped his briefcase and bent down to pick it up, but Beck demonstrated that would not have been possible.As Beck, Stabler, and Novak make their way down the courthouse steps, Beck complains that$25,000 bail is a joke. Stabler hopes he will rape again before he goes to trial. When Beck notices the media, she goes over and tells them of Trenway's charges sending them running to get their story. Trenway tries to explain it away as a case of mistaken identity.While Stabler looks at the newspaper with Trenway on the cover, Tutuola introduces Heather Stark to Beck. When Beck brushes her off, Stabler steps in and takes her to an interview room. Heather gives Stabler details of her rape 5 years prior. She claims she knows Trenway was the man who raped her.When Stabler walks Heather back to the squad room, she sees Beck taping pictures of her beaten body to the board. Stabler has Munch take her to make a call in private while he goes to the board and takes them down explaining she does not need to see how she looked that night. Cragen tells Stabler the MO's of Heather and Nikki's attacks are similar. Novak tells them Heather's ID will be considered tainted since she pick him out of the newspaper instead of a line-up. Stabler informs them her rape kit was inventoried and the statute of limitations for Heather's rape expires in 4 days. Cragen sends Stabler and Beck to obtain the rape kit and tells Novak to get a warrant for Trenway's DNA.At the property clerk's warehouse, they are told the building leaks so bad they constantly have to move things from their designated spot and it will take several weeks to find it. When Beck insults the clerk, he tells her she can find the evidence herself. As soon as they get outside, Stabler asks if she has a friend that can undo her mess for her. He gives her a few rules to go by to get their job done: get inside people's heads, not every perp is the same, and never turn your back on a victim.In court, Heather tells she had a fractured skull as well as a broken nose and eye socket. Even though she is unable to tell the court why she did not call the police any of the other times Trenway was in the paper, some ground is recovered when Novak has a defense expert agree that since Heather's composite after the event could be Trenway. When the judge breaks for lunch, Stabler notices Trenway get agitated when he sees a woman sitting in the back of the courtroom.Warner tells Novak, Beck, and Stabler that because of the evidence getting wet mold had formed on the biological material. She informs them she was able to get enough of the biological material to get DNA. When Novak gets prematurely excited, she disappoints her saying Trenway's DNA did not match that of Heather's rapist.After they let Heather know the DNA did not match, she yells at Trenway when he tries to approach her. Stabler tries to tell her they will find her rapist, she reminds him it is too late. Novak informs Beck the only way to get Trenway now without making him look like a martyr is to find another victim who can say he raped her.Cragen asks Stabler how far back they need to go to find this witness Novak wants. He tells him they need to go as far back as they can and that all Novak wants is a witness to put on the stand under Molineaux to establish he has raped before. Munch and Tutuola meet them at the squad doors and tell them Beck has been there all night. When Stabler inquires, Beck tells him they have Trenway. She explains that between 1970 and 1974, there were 14 attacks on women in Ithaca. The attacks stopped when Trenway left Cornell to go to Duke Law School. From August of '74 to May of '77, there were 11 rapes in North Carolina and they stopped when Trenway left Duke to return to New England. She further explains she believes they will find more attacks closer to New York because Trenway visits clients in New Jersey and lives in Connecticut. Beck tells the team she pulled 2 assaults from '67 to '70 when Trenway was a teenager in Douglaston. One is ruled out because a man was attacked. The other is Lorraine Delmas who suffered a broken nose, cheekbone, and jawbone. Cragen notes the photos could be carbon copies of Nikki West.When Stabler and Beck arrive at Miss Delmas's home, Stabler realizes she is the woman in court that freaked out Trenway. She explains Marty's mother and she were best friends growing up. They met brothers and moved to the states, but while Marie got married she did not. She tells them she promised Marie on her deathbed that she would watch after Marty. When she claims she and Marty lost touch when he went to college, Stabler informs her he knows about her attack and he believes she knew her attacker. They take her to the station to ask her more questions. While observing Stabler's interview with Delmas, Huang tells Cragen she went to court to see Marty get justice. He then tells them she will not talk to a man. Beck interrupts Stabler's attempts and begins talking with Miss Delmas in French. When Stabler leaves, Beck tells her that her husband was murdered in the line of duty 4 years prior. She tells her once she started talking about it, she felt much better. Delmas tells Beck Marty was the one who attacked her.In court, Miss Delmas announces Marty raped her for the first time. After the judge tells Miss Delmas she cannot allow her testimony because there is no evidence to support her story, she tells them she hid her clothes in a box between the beams in her basement. Stabler locates the box and takes them to Warner, who confirms Trenway raped both Delmas and Nikki West. Delmas tells the court if she had spoken up Marty may not have harmed Nikki. She goes on to apologize to Nikki. Novak tells them Trenway will plead guilty and name all of his victims in exchange for the maximum sentence. Beck tells Delmas if he ever gets out of prison, he will be too old to rape anyone. Nikki asks how she can repay Miss Delmas. She tells her to move on with her life. After she thanks Beck, Miss Delmas walks out of the courtroom with the pep back in her step."},{"episode_title":"Clock","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/clock-870986\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Stabler and Tutuola talk to students at the museum where two of their classmates turned up missing. The children tell them the missing girl, Janey, gets picked on a lot and the missing boy, Connor, acts as her bodyguard. When Stabler speaks with their teacher, she is upset that she did not know the students were missing until the curator of the museum tells her their recorders were missing. She explains that Janey looks younger than she actually is because she has Turner's Syndrome. The detectives use the museum's tracking system for the recorders and locate Connor's outside in the bushes along with a bloody shoe. Cragen informs them a ransom call has been received by Connor's parents demanding $300 to be delivered to an arcade.Outside the arcade, Munch brings Cragen coffee to the car and tells him that Janey's parents have yet to receive a ransom call. He also tells him her father left for Vancouver. Tutuola informs them the money is still in place just before Stabler describes a possible suspect. Tutuola watches at the boy fakes tying his shoe and reaches for the bag containing the money. They both approach him. He states that he is to be paid $50 for picking it up and delivering it. After being threatened with jail time, he tells them where he was to make the delivery. Tutuola and Stabler bust into an apartment containing three boys, one of which being Connor. Once they threaten the boys with 5 years in jail, they find that Connor set his kidnapping up in order to obtain the money he lost in a bet. They escort Connor to the station to continue their questioning. He tells them Janey stayed at the museum. He further tells them Janey did not have problems with her father and she has not seen her mother since she was little. He says her problem revolve around the kids at school. The detectives, Cragen, and Huang watch a video of student elections that illustrates the torment Janey went through. Huang tells them Turner Syndrome patients are intelligent, but they are trapped in the bodies of children. Cragen tells Stabler that Munch will work with TARU to view the museum's tapes and sends him to talk with Janey's grandfather. Stabler tells him he will take Tutuola along as he leaves his office. Cragen rushes to catch up with him to let him know they are looking for a new partner for him. Stabler insists he is fine with the way things are until Benson gets back. Stabler turns in time to see his daughter. Kathleen tells him he ruined her relationship with Kevin. He tells her he does not want her seeing him again. She informs him that her mother thinks he is overreacting. He simply says he will discuss it with her mother later, but she is going to be late for school so he will drive her. She takes off into the elevator as she says, \"I hate you!\"Tate Speer, Janey's grandfather, informs Tutuola and Stabler that he usually keeps Janey away from field trips, but he allowed her to go this time because she begged him and he thought she would be safe at a museum. Mr. Speer shows them to Janey's room. While they look around, he tells them the only enemies the family might have now would be from a recent layoff, but all of the people were given severance packages. When they ask him about Janey's mother, he says she is a drunk. Stabler takes Janey's laptop even though Mr. Speer informs him she is only allowed 10 minutes a day on the internet. He is adamant that someone kidnapped her while they ask questions as if they believe she may have ran away. Tutuola receives a call requesting their presence with TARU. When they arrive, Munch shows them a tape of Connor leaving through the back of the building. Then he shows them tape of Janey being approached by a stranger and receiving a package from them before following the person out the door. Morales enlarges the picture to reveal the logo on the woman's work shirt. Tututola and Stabler locate the woman at work and ask if she knows Janey. She informs them that she is her mother. As far as she knows, Janey is at school. When she begins saying Janey's father must have done something to her, they escort her to the station for further questions. At the station, she states that Janey asked her to bring baby pictures to her at the museum for a school project. They inform her Janey's father left for Vancouver alone. She tells them she filed for joint custody after 3 years of sobriety. She says that Janey told the judge in the case she wanted to live with her mother. She also lets them know Janey's father took her to Vancouver to check out schools.Cragen informs them a witness called believing she may have seen Janey being pushed into a silver Lexus SUV, which is what the family owns. Tutuola and Stabler find out from her grandfather that Greg Hartley last used the vehicle to drive her to school. They go to the parking garage and verify the vehicle is there. When Stabler spots the security camera, he states he wants to verify if it has moved since taking Janey to school. Upon viewing the tape, they find the vehicle had been moved by someone unknown to the family. This arms them with a suspect's picture before the lab calls requesting their presence.Siper states they found Janey's backpack, but there were a lot of fingerprints. Inside the backpack, they found a tube of experimental testosterone gel. Warner informs them Dr. Alexander Shulman is the one running tests on it. She requests to tag along so she can find out why a 17-year-old has possession of a drug used to increase her sex drive.Dr. Shulman states he is trying to help girls with Turner's Syndrome because they have less time to procreate than normal girls. He also informs them Janey was involved in the study with her mother's consent. When they approach her mother with this information, she defends her position stating her father wants to keep Janey a little girl. She just wants to show Janey the real world safely under careful supervision. When she tells them Janey uses her laptop instead of going out with boys, Stabler takes it for TARU to check. He shows her the picture of the suspect and she denies knowing him.Morales finds that Janey was running her mother's computer through her dad's. She visited sex and lingerie sites. He was also able to locate e-mails she exchanged with Connor planning his fake kidnapping. She located a guy named Dan online to help her with running away. When they locate Dan, they learn Janey sent him a copy of the key to the vehicle and told him where to pick her up. He was paid $200 to take her to another location. After dropping her off, he returned the vehicle, but she never told him what to do with the key. He gave Tutuola and Stabler the key as well as the money he was paid.Tutuola, Stabler, and Cragen update Huang on the case and ask him what he believes is going on. He says that while it may look like she is the one doing the planning, he believes someone is manipulating her. They discuss that only a pedophile would enjoy having sex with a 17-year-old who looks 12 because he would be living his fantasy only legally. Huang tells them to start with those closest to her. Janey's father, Nathan is brought to the station and is met by his lawyer, Van Allen. When Stabler confronts him with pictures from the web sites Janey visited, he claims they must have popped up when she was researching another subject. When told about the testosterone, he says her mother got her started in all of it. He states she was happy with her life until her mother showed back up in her life. He also tells him that Janey's mother forced her to tell the judge she wanted to live with her. As he and his lawyer were leaving, Janey's mother walks in asking what he did with Janey. They get into a heated argument before Nathan storms out saying she will never get her hands on Janey. Novak informs Cragen that Van Allen is an immigration lawyer and specializes in custody cases where one parent is a foreigner. Munch interrupts them saying phone logs from the Speer home shows several calls to Annabelle Paz, a travel agent.When Tutuola and Stabler question Paz, they find Mr. Speer is planning a trip with his daughter to an island under French or British control, but when they show her a picture of the family she points to Greg Hartley saying he is Mr. Speer. When they arrive at the Speer house, Hartley had left. They try his apartment, but the only thing they find is a pair of boots with a yellow powdery substance embedded in the sole. While at the station, they get the lab report stating the substance on the boot is marble dust from marble imported from Italy. After calling the grandfather, they learn one of the family's hotels is being renovated with a marble floor. When they arrive at the hotel, they find her hurt and crying. As she is taken away in the ambulance, they spot Hartley in the crowd of spectators. Stabler makes his way behind him while Tutuola approaches him from the front. When they arrest him, he asks if she is alright. Upon returning to the station, Stabler is told Kathy is there to talk with him. She tells him Kathleen locked herself in her room and wants to know why. Stabler reminds her they agreed the guy is no good for Kathleen. She, then, reminds him they were suppose to talk to her together. She inquires as to why he has not signed the divorce papers. All he can say is \"I don't know.\" Before she leaves, she tells him to call Kathleen.While Tutuola and Stabler question Hartley, he claims the sex with Janey was consensual. She visited the sites on her own. She bought lingerie on her own. She asked him to have sex with her. He states he loves her and would never hurt her. Novak reminds them that sex with a 17-year-old is legal.  At the hospital, the doctor informs Stabler and Janey's parents they had to remove an ovary. He also tells them Janey had been taking Menopur, a fertility drug, and abuse of the drug will make it harder for her to get pregnant. When they ask Janey about the drug, she tells them she wants to have a baby because she does not have much time left to have children. When her parents get into a fight, Stabler asks them to leave. Janey tells him she loves Hartley and he loves her for her. She tells him Hartley had left her at the hotel to get her some pain pills. Huang is the only one to agree with Janey. Tutuola receives a call saying a patrol was sent to the Speer house. When they arrive, Hartley was there saying the family tried to buy him off. Janey told her grandfather she was going to go live with Hartley when she's better. Stabler and Tutuola tell her father to petition the court for a PINS (Person In Need of Supervision) order that will be good until she turns 18. When Nathan asks if they will testify, Stabler tells him they will need something to testify about and inquires about any checks they did on him when they hired him. In court, Stabler testifies that Janey should not be allowed to have a relationship with Hartley because she does not know him. He was fired from his last job because of a relationship with his employer's daughter. Janey's lawyer reminds him no charges were filed in the case so it was not relevant. She states that he is prejudiced because of his daughters. The judge asks Janey what her plans are. When she tells him of finishing her education, getting a job, and living arrangements, he allows her to leave with Hartley.Outside the courthouse Dani Beck spots them kissing and places Hartley under arrest when Stabler informs her it is legal. She introduces herself as his new partner. He tells her, \"Welcome to the world of gray.\""},{"episode_title":"Informed","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/informed-866776\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"svu","corpus":"While arguing with a patient about the order in which patients are scene in the ER, the nurse is interrupted by a woman in a hooded jacket. When the woman removes the hood, she reveals a gash on her head with blood coming down the side of her head apparently the result of her head being shaved with a razor. Once taken to an exam room, a social worker (Tonya Majeski) is sent in for her refusal of an exam. Tonya notes that she is bruised and bloody and asks if she has been raped. After confirming her suspicions, she asks if she has notified the police. She offers to place the call for her. The woman refuses all of Tonya's help. Tonya then tries to talk her in to having a rape kit done. When the woman starts to walk out, Tonya concedes and informs her that a doctor will give her the morning after pill and antibiotics.Benson gets out of her car as the woman leaves the hospital. She begins questioning the woman about the attack, but she will not have it. The woman asks her to identify herself. When Benson does, the woman gets angry saying she told the social worker not to call. Benson lets her know that it is not too late to go back in and have a rape kit done and that many women regret not doing it. The woman refuses again. Benson offers to drive her home. The woman then steps to the curb and yells for a taxi. Benson offers the woman her business card, but she refuses it stating she will throw it away and will be needlessly killing trees, which she is against. Benson asks the woman for her real name as the taxi drives off.When the woman answers her apartment door to Benson's knocks, Benson informs Haley that she located her through the taxi and her building super told her the woman's name. Benson informs her that she does not want to cause any harm, she just wanted to check up on her. Then she informs her that many battered women return to their abusive partners and asks for contact information for Haley's boyfriend. Haley assures her that her boyfriend didn't do it and she has not told him about what happened. Once they disturb Haley's neighbor, Haley allows her to enter her apartment. Haley tells her that she still does not want to do anything about the rape. Benson informs her that the perp may be raping and beating someone else. Haley informs her that she does not know who he is and she did not see anything to help identify him. Benson notices the tub full of water and Haley asks her to leave before stepping into the bathroom and shutting the door. As Haley gets ready and get in the tub, Benson explains that once the evidence is washed away it is gone forever. Haley tells her again to leave. Benson looks around noticing a closed door. She opens the door and sees a pile of clothes on the floor. She picks up the panties and deposits them into a plastic evidence bag. Before Benson leaves, she tells Haley she is leaving her business card in case she changes her mind. Haley assures her that she will not.Benson takes the evidence to Melinda Warner in the Medical Examiner's office. Warner explains the evidence is usually logged in at the desk by uniform officers. She surmises the victim must be a V.I.P. for Benson to be the one bringing it in. Benson asks her to make it a priority. Then she explains the perp is a sexual sadist. He beat the victim and shaved her head without a safety razor and she is concerned. Benson then explains that the victim refused a rape kit. Warner is thankful for the evidence obtained. Then she explains how the French Resistance treated their female collaborators. Benson walks out as Warner asks her if she has ever told her about the time she lived in Paris. Captain Cragen walks into the bullpen looking at the newspaper when he notices Benson at her desk wearing the same clothes as the day before. Benson tells him she caught a case and has not returned home. She informs him she has not completed her paperwork but decides to brief him verbally. He asks if she ran the M.O. She had but came up with nothing matching, but she found a picture about The French Resistance on the internet. He is astonished to find that the rapist may have came up with his idea from the History Channel. Benson reminds him that the women tortured in the picture are ones that were doing what the enemy wanted. He asks if the victim's boyfriend could have done it, but she tells him no and there has not been any violent calls received from them. Benson tells him the victim worked at a food co-op. Cragen asks her who the enemy is if the victim is collaborating.Benson goes to the victim's place of employment to question her co-workers. She is told Haley works in vitamins and homeopathics. He tells her all of the employees are co-owners and the objective of the store is community. Benson asks if anyone had given Haley a hard time. He refers to another worker who informs them Haley left early to go to a meeting of a group Haley's boyfriend, Justin, runs.Benson goes to Justin's bookstore to ask him if Haley made it to the meeting. The only response she gets is a lecture about the intrusion of government and The Bill of Rights. She notices a pamphlet on the table, picks it up and asks Justin what CAUSE (Community Activists United Saving Earth) is saving the earth from. He informs her it is about saving the earth from the abuses of human, animal, and environmental rights. She then informs him that Haley was raped the night before. Justin and Benson take their conversation outside the store. She asks him when he last saw Haley. He tells her they split up after the meeting so he could do inventory and another member had taken Haley home. He refused to tell her any names because no one in their group would attack anyone. She asks him for a DNA sample, but he quickly refused citing it as being the ultimate invasion of privacy.Benson returns to Haley's apartment building and speaks with the neighbor they had disturbed. She asks Mr. Delphy if Justin had been there the night before. He explains that he was not and he would have known because of he is always going off about something. She then asks if Haley had any visitors besides her. He says no and he would have heard the dogs barking if she had. He then tells her Haley gave her dogs away and he would not know if she was home or not without them.When Benson reaches Haley's apartment, she notices the door is ajar. She pulls her weapon and enters carefully. She searches the apartment noting the damage that had been done as the result of an intruder. Once she decides it was safe, she re-holsters her weapon and begins looking at a stack of pictures of dead animals. While she is preoccupied, someone walks up behind her, points a gun to her temple, and tells her she wants to see her hands. When Benson tells her she is not there to hurt her, Star Morrison asks if it is her. Benson turns around, recognizes Star, and asks her why the F.B.I. is there. Star tells her that she has to tell her why she is there first.Benson and Star survey the damage done to Haley's apartment. Benson notices the obvious presence of a knife considering the furniture had been slashed. Star notes that there does not seem to be evidence of foul play dues to the lack of blood splatter. She believes the guy was looking for something. When Benson attempts to call CSU, Star informs her the ERT guys are coming to process the scene. Star believes Haley left before her place was trashed since she gave the dogs away. Benson suspects Justin because he will not give his DNA and he seems paranoid. Star informs her the government is watching Justin because of they believe his group CAUSE is helping an eco-terrorist group called EDG (Earth Defenders Group). Benson and Star make their way to a meeting room where a projector is set up. Star shows Benson examples of the trouble EDG has caused while explaining the pictures being seen as an arson spree on SUVs and vandalism of the homes of a pharmaceutical company's employees. She informs her that no one has been hurt yet, but the threat is still there. Then she shows a picture of a new development on Long Island where they put up a sign \"If you build it, we will burn it.\" Star also informs her that EDG is not a group to advertise their membership, there is not an official leadership, and they all act independently. All of this makes it hard to infiltrate, but Haley did as an informant. Benson surmises this as the reason Haley's head had been shaved.While in a diner eating, Star informs Benson that Haley started as an informant when she was doing cocaine at 18 and dating a distributor. She helped the feds take down the crew of her boyfriend and a Colombian supplier. Haley had worked that off, but was caught releasing animals from a lab returning her to acting as an informant. Benson believes Haley is informing out of blackmail. Star warns her that sooner or later someone is going to get killed because of these groups playing with explosives and fire. Benson tells Star that Haley was raped because of someone found out she was an informant, making it Star's fault. Benson asks her for the member list, but she refuses saying she will ruin over a year's worth of work. Star reassures Benson she will find the guy who raped Haley. Benson tells her that she has DNA evidence and all it will take is someone finding out they are investigating a rape.Benson and Star pick up Justin and bring him to the precinct under the guise Star works there. Their plan is almost foiled by Fin Tutuola, but he catches on quick. Benson asks Fin to find an empty interrogation room when she spots Warner leaving the squad room. Benson makes her way to Warner only to be greeted by hostility. Warner tell her to let her know what is going on next time before she risks her lab's reputation. She tells her she found a DNA match in the system, but cannot tell her. ADA Casey Novak tells Benson that she told her not to before Cragen yells for Benson to come to his office. Novak holds up Benson's paperwork as she and Cragen inform her of the problem. They inform her it is suspicious the victim is too traumatized to give her statement, but not to give up her panties for evidence. Cragen confirms his suspicion that Benson stole them before he informs her Haley called to complain telling him of the way she had treated Haley. Benson tries to defend herself saying Haley's attacker threatened her into not reporting it and at least they have DNA evidence. Novak informs Benson that Warner cannot release the DNA results because the evidence was obtained illegally. Cragen tells Benson Haley is threatening to sue if the case goes any further. Benson tells them the feds put Haley in with dangerous people. Novak asks why the feds are not handling the case. Benson raises the blinds revealing Star interrogating Justin and tells them they have been working together. Cragen tells Benson to get Star out of there.Benson, Star, and Cragen go upstairs to discuss the situation. Benson informs him of the condition Haley's apartment was in and expresses concern for her safety. Star informs him Haley missed her last check in. Cragen wishes Star luck in finding Haley, but she is not getting Benson's help. Star asks him if they can finish with Justin. He tells her to take him to the Federal Building. She informs him she cannot because Justin thinks she works for SVU. Cragen says to let him go then returns downstairs. Star reminds Benson that Haley's rapist is in the system, she will check it out from her office, and will let her know if she finds anything. When Star returns, she walks out of the elevator to see Stabler discard a can in the trash and calls him on it. He removes the can immediately. Star confirms Cragen's absence before asking if Benson is there. Stabler told her Benson was sent home for sleep. Star decides to fill Stabler in on what she found. Mitchell Hissam had been convicted of statutory rape and he took Haley home. She plays a tape found at Haley's apartment where Mitchell and Haley discuss some plans for Saturday. Stabler asks if she knows where to find Hissam. Star tells him she does and she has a warrant.Star picks the lock on Mitchell's cabin, but Stabler enters first. She thinks he is at a midnight tree hug. Stabler notes the lack of places to hide Haley, but Star hopes to find other things hidden. When Stabler opens a deep freezer, he finds vegetarian foods before picking up a napkin. He opens the napkin carefully revealing dynamite. Star instructs him to return it to its place and informs him if the temperature changes even a little, it will blow. He returns it and they run out. As soon as they are far enough away and think they are in the clear, the cabin explodes throwing them both to the ground. Star notices Stabler is unconscious. After she attempts to wake him, she calls for an ambulance.As the EMTs take Stabler to the ambulance in a neck brace and on a backboard, Stabler tells Star she is a jinx. Every time she comes around he almost gets killed. Star says if she was not around, he might not have lived. Star and Benson go to the local Sheriff's office. The sheriff informs them Mitchell is unlike others in the area and he believes he has set fire to a hunter's cabin before, but he cannot prove it. Benson asks if he has ever seen Mitchell with Haley. The sheriff informs them Mitchell has a girlfriend, Persephone, with an organic greenhouse down the road.Persephone informs Star and Benson she sells seeds over the internet to 200 varieties of heirloom. She ignores Benson's questions telling them she uses organic compost tea to water her plants. After allowing Star to try one, she informs them corporate hybrids are flavorless. Benson shows her a picture of Haley and asks if she has seen her. Persephone pauses her information session long enough to answer no before proceeding to tell them they are now producing square tomatoes and watermelons. Benson informs Persephone of what they suspect Mitchell had done to Haley. She does not believe Mitchell would hurt anyone. Benson tells her about the dynamite. Star tells her she would not like prison because they do not serve organic food there. Benson then informs her she would be going to jail for harboring a domestic terrorist. Star tells her if she goes to jail, her plants will rot. Benson tries again and asks for Mitchell's location. Persephone tells them she was to meet him at Gen-Eng Foods.Benson and Star arrive at Gen-Eng Foods to a demonstration where Star joins in. They locate Justin. A few minutes after they locate Mitchell, federal agents take him away to the precinct. Benson asks where Haley is. He admits he has not seen her since he left her a block from her house after the CAUSE meeting. He informs them he saw Haley get into an SUV with some other guy. Star informs him the FBI has been watching EDG for a while. While they may not make themselves known, they use the internet to brag and post pictures. They show him a picture of  EDG members and show him it could be him. The device used in the explosion was dynamite and they may be able to link it to the one that exploded his cabin. Star informs him that would get him 40 years to life. He informs them they will not be able to miss the upcoming destruction because it will light up the sky. While watching the interrogation, Cragen informs Novak he never looked at the DNA results. Based on the statement Mitchell made, Cragen and Novak head for Warner's office to check the DNA results to see if EDG's plan was motive for Haley's rape. Star calls to have Persephone picked up hoping Mitchell told her what was going on. Benson thinks it would be better to find Haley since she probably knows something. Star says she needs to find out the DNA results. They attempt to go talk to Cragen, but he already left with Novak. At the morgue, Cragen asks if the DNA was Mitchell's. Novak tells Warner if it was not his then no one will ever know they looked. Warner shows them the body of gun shot victim Zander Owens and informs them it was his DNA.Cragen brings Benson into his office to share his new found information with her. Benson and Cragen realize Haley did not want them to do anything about her rape because she wanted to kill him. Benson asks if Zander could be a member of EDG, but Cragen did not find anything in his file to support that. When Cragen informs her Zander was recently released from the federal pen, she realizes he was the one Haley had sent to jail.Benson goes to the FBI to meet up with Star. Star introduces her to Agent Lockwood. Star confirms Zander was Haley's boyfriend. Lockwood informs her Haley did not testify against him. Star tells him he messed up because of the situation Haley was in. Lockwood informs Benson Haley did not know Zander was being released. Star tells her they do not tell each other classified information. Lockwood tells Benson Zander's DNA was in the system for a prison gang rape. Haley calls Star requesting to meet her.Star meets Haley at a health food juice bar. Haley says she had something personal to take care of before she contacted Star again. She claims her haircut was in protest of a shampoo manufacturer. Benson comes up behind her and tells her she is not bald because of a protest. Then she tells her she is under arrest for the murder of Zander Owens. Star stops Haley as she gets up to leave. Benson tells her to tell them about EDG's next attack.In an interrogation room, Haley lets them know she at least partially blames Star for her rape. Star apologizes for it. They both ask her why she would not let them handle it. She informs them she had taken some drug money when Zander was arrested and gave it to charity. The only reason Zander let her live was because she led him to believe she could get the money. Star tells her that since she took a life, she know Haley wants to make amends. In order to make things right, she needs to tell them what EDG has planned since the tape recorder went out before Mitchell gave details. Haley informs them the details are not given ahead of time only pick up points are given. Benson asks how Persephone was involved. She tells them she supplies the fertilizer before telling them she has to bring the diesel fuel and she is willing to wear a wire. Star tells her they will follow her. Novak comes in and tells them she is not releasing her because she committed murder. Benson tells her this is their only way to find out where they are going to attack next. Star informs her the mixture of fertilizer and diesel creates an explosion as bad as Oklahoma City. Novak wants Haley to wear an ankle bracelet, but Star says Haley will have a cop with her. Haley assures Benson no one has met Persephone as they walk up to a bearded guy named Russ beside subway stairs. Haley introduces the two. At the bottom of the stairs, Mitchell asked to see what Persephone brought. She opens her backpack to reveal a bag of ammonium nitrate. He tells them Andy Dell, one of the founding members of EDG, is already at the target. They walk to another set of stairs and up to get into a waiting van. The van stops outside of Gen-Eng Foods. They all climb out and are let into the building by a security guard, who gives them fifteen minutes to accomplish the task. Benson, Haley, and Russ take the elevator to the floor containing the CEO's office. Russ tells them how to get to the office and tells them to meet him in the lobby in ten minutes.As they walk towards the door, Benson calls for the feds to arrest the guys downstairs, but before she could finish her transmission, Haley hits her on the head knocking her to the ground. Haley picks up Benson's weapon before she goes into the office. When Benson regains her footing, she calls back to the feds to get upstairs because there is a problem. Benson enters the office with caution to see Haley beginning to assemble the bomb on the desk. Benson asks where Andy Dell is. Haley informs her that he was the security guard. While Benson tries to calm her down, Haley tells Benson Dell infiltrated Gen-Eng. Mitchell was the bomb expert but you learn how to do it on the internet. Haley tells Benson to go back downstairs as Star enters gun drawn. Star tells Haley to put the gun down. Haley tells her she is making a statement because the company's food is unsafe and they test on animals. Benson keeps trying to talk her into stopping. Haley tells them she will not let them take her to jail. Star tells her she cannot let her set the bomb off. Haley tells them to leave again. When she does not stop, Star shoots and kills her. Benson tells her they could have stopped her without killing her. Star tells her to never second-guess a terrorist.To keep up the charade, Star led Benson out in make shift cuffs. Star reassures Benson Haley never had the chance to tell them she was a cop and the proof of that is that no one ran. She helps Benson into the van with the members of EDG to be taken to Federal lock up. Benson tells Russ the feds killed Haley. Russ tells Benson Dell got away.Once out of the holding cell and in an interrogation room, Star asks Benson if she had any information on Andy Dell. Benson informs her he is heading back to Oregon. Star tells her Persephone and Mitchell are in isolation in prison. When Benson asks why, Star tells her they want her to keep up the undercover operation. Benson tells her she has a job. Star plays the guilt trip of Haley to get her to agree.Stabler walks into the squad room to Munch and Fin welcoming him back. He looks at Benson's cleaned off desk and asks Cragen where she is. Cragen cannot tell him anything except she has been temporarily reassigned and he is getting a new partner. Stabler clarifies it will be a  temporary partner. Then he calls her and hears her phone has been disconnected."}]}