{"episode_recaps":[{"episode_title":"Head","nth_episode":25,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/head-322391\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"After a video voyeur's hidden camera in a public restroom records a middle school principal sexually assaulting a teenaged boy, Novak learns that the pedophilia arose from a brain tumor that is successfully treatable by surgery, but can grow back, which they find out from another case.Novak agrees to a plea bargain, but only if the principal agrees to register as a sex offender, just in case the tumor grows back. She then finds out that she is pregnant and violates her plea bargain by contacting the boy and letting him know he is the father."},{"episode_title":"Poison","nth_episode":24,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/poison-319433\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Bound","nth_episode":23,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/bound-317275\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Painless","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/painless-312978\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Criminal","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/criminal-306681\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Lowdown","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/lowdown-310631\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Sick","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/sick-303036\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Careless","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/careless-299997\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"The boy had health problems that didn't allow him to communicate very well and was always very hard to handle because of hi issues which led the immature foster father to take the boy to a midnight exorcism. The detectives first think the xorcism might of gone wrong and the boy died but the case takes a twist. When the detectives find blood on a pillow at the foster home, they start to suspect the foster parents. They also find out the boy was killed by a cheese grater. They charge the father but soon learn he had called the social worker many of times asking for her to take the child away because he couldn't take care of him. The social worker never answered the calls which led the police to arrest her and charge her for depraved indifference. The social worker somehow gets off but feels so bad about what she did that she commited suicide. The detectives then learn that the foster parents had stuck one of their former foster children in a mental institution to hide her away when she saw the murder of the little boy. The detectives track down the girl and she tells them that the foster mother killed the little boy."},{"episode_title":"Mean","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/mean-299996\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Home","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/home-298995\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"When Jacob Nesbit, a fatherless young boy, is found rummaging through garbage cans looking for something to eat, Benson and Stabler want his widowed mother Marilyn investigated for neglect, but are stymied by her lawyer and Child Services and forced to return Jacob to her. After Stabler responds to Jacob's call for help, he finds the boy at home shot dead, and his mother and older brother Adam gone. Adam freely confesses to the murder when Stabler and Benson finally locate them, and reveals that his mother terrifed her sons about the world around them and especially about being put into foster care, telling them that they'd be better off dead than in foster care. Marilyn is arrested for facilitating a homicide, and insists upon testifying before the Grand Jury, where she slips up and mentions DYFS (the New Jersey State Child Protective Service Agency).  Benson and Stabler cross the river and discover that under another name, Marilyn lost custody of her eldest son, named Daniel, to the foster care system there. Daniel, now an adult, tells the detectives that his mother's mental illness intensified after his father's death. Since his father was murdered during a robbery on a trip to the store to get milk for Daniel, his mother held him responsible for his father's death and began to physically abuse him so severely that he was removed from her home.When Benson and Stabler introduce the brothers, Adam is in complete disbelief and shock, because Marilyn had told him that Daniel had been raped and beaten and murdered in foster care.  Adam then confesses that Marilyn had urged him to shoot Jacob and then commit suicide so that they would not suffer the same fate as Daniel."},{"episode_title":"Families","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/families-302368\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"The investigation into the death of a young girl reveals she was impregnated by a male family member prior to death.  Through the investigation, the detectives learn her father lived a double life.  Her father's other son was the girl's current boyfriend. The father was murdered by the boyfriend's mother and she was arrested."},{"episode_title":"Ritual","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/ritual-299492\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Hate","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/hate-293164\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"A couple is talking on the sidewalk when a screaming woman staggers toward them, her clothes totally ablaze.  SVU is called in after the patrol officers first on the scene find the victim's torn underwear in the alley.  She'd been doused with fuel oil and an accelerant, and sexually assaulted with a metal pipe.Although most of the victim's body is burned beyond DNA testing, her feet are intact because she was wearing tall leather boots.  On her foot is a henna pattern which Warner recognizes as a Muslim design.  The lab salvages part of the label on the victim's burned purse; Olivia and Elliot determine that the label originally read \"Atlantic Avenue Brooklyn.\"  Among the Middle Eastern merchants in that neighborhood they locate the henna artist who did the pattern; she identifies the victim as a Mira Elbisi.  Mira's husband and his mother publish a newspaper called The Arab-American, whose office is located nearby.Olivia and Elliot visit Mira's husband at the newspaper office.  Until prompted by Elliot he doesn't ask why they're asking questions about his wife, and then he asks if she's made a new complaint against him.  Later, Munch and Fin interview the mother at the family home.  Neither of them saw Mira the night she died, don't know where she was, and don't explain very well why they weren't particularly concerned about her.   Their accounts of their whereabouts that night don't match, either.Word of Mira's death by burning leaks to the press.  Elliot learns that three weeks ago, Mira called the 7-4 precinct and said she was afraid of her husband; when officers responded, she apologized for getting the police involved.  A week later a neighbor called the 7-4 because he heard loud arguing inside the Elbisis' home; that time, Mother Elbisi sent the responding officers away.  The neighbor tells Olivia and Elliot he suspected Mira's husband had hit her.  He also says that Mira felt stifled living with her mother-in-law, and definitely wanted more freedom.  Asked if Mira had any confidantes, the neighbor responds that she was friends with a Jewish man named Joshua Friedman, who works at \"some religious do-gooder group\".The religious group is the Interfaith Council, which works to \"build bridges\" between Muslims and Jews.  Mira had kept her work with the group a secret from her husband.  Friedman admits that he and Mira had fallen in love, and that Mira had told her husband she was leaving him for Friedman.  That gives husband and Mother Elbisi a logical motive for killing Mira, so SVU brings them both in.  While SVU is interrogating them, a report comes in of a second Muslim killed in the same way as Mira Elbisi.  Victim #2 is a man, Tariq Assad, also doused with fuel oil and an accelerant and sexually assaulted with a metal pipe Since the fuel oil aspect of Mira's killing was never publicized, clearly Assad's murder wasn't the work of a copycat.  Or the Elbisis, since they were at SVU's office at the time.Olivia and Elliot learn from Assad's brother that Tariq also had been  involved with the Interfaith Council.  They visit Joshua Friedman again, who tells them that the previous week Mira and Tariq had participated in a Council-sponsored panel discussion about Islam, an event which had been open to the public.  The Council office has heavy security, including cameras.  The video of the reception following the discussion shows one attendee who seems to pay particular attention to Elbisi and Assad.  A close-up of the attendee reveals a label on his jacket:  \"Donaghue Heating Service.\"  Heating service = source of fuel oil.Donaghue's owner identifies the attendee as his employee Sean Webster, who bolts when his boss calls him over and says the police want to talk to him.  Sean is arrested, and explains that he ran because he'd had some trouble with the law before, as a kid. Police records show that Sean has a juvenile conviction for attacking a fellow student, a Pakistani.  Also, Sean's father died when Sean was 10; afterward his mother had a nervous breakdown and later moved herself and her son from Long Island to the city.During further interrogation, Sean displays an unmistakable hatred of Arabs which is clearly influenced by 9\/11.  The accelerant used in the burnings was benzene, and a search of the Webster home turns up a can of cleaning fluid containing benzene.  When Sean kills a Muslim prisoner at Central Booking, Casey has to include a hate-crime charge she'd rather have left out.  Enter Oliver Gates for the defense, the attorney specializing in insanity and mental defect defenses.  He's also a fierce opponent of New York's hate-crime statute, and Sean's case provides a perfect soapbox opportunity.  Gates hires an eminent expert who's done substantial research into a genetic basis for hatred and violence.   Under her theory, Sean isn't responsible for his actions because he was born with a genetic predisposition toward hatred and violence.At trial Gates' expert makes a very impressive presentation, while George Huang's prosecution testimony winds up possibly working both ways.  When Sean takes the stand, Casey gets him to acknowledge that he hates only Arabs, not also other ethnicities such as black non-Muslims and Asians.  Casey then asks him why he hates only Arabs.   Sean begins explaining calmly enough that Arabs \"study engineering and aviation, then use it to attack us…We fought for Muslims in Bosnia…My father fought for them in Desert Storm and died for his country….\"  From there Sean totally loses his cool and goes into an absolute anti-Arab tirade.  The judge stops the trial until Sean can collect himself.  Casey tells Olivia and Elliot to find out how Sean's father died; she needs to know whether Sean killed out of hate, or revenge.Later Casey calls on Gates while he's visiting Sean at Rikers, and offers a plea bargain.  When Gates refuses, Casey presents Sean's father Seth Webster, who is in fact alive and well and living in Detroit with his second wife.  When Sean sees his father, the real reason for his hatred of Arabs comes spewing out like water from a burst pipe:  Seth Webster had left his first wife and Sean for an Arab woman he met in Kuwait during Desert Storm.  Sean's mother had told her son that his father died a hero in the war, but when Sean applied for college financial aid he learned his father was alive.  Totally enraged at his father's abandonment and the hardship it caused his mother, Sean screams that if he had a gun right now he'd shoot his father, then go and set his second wife and their kids on fire.With this revelation, Gates' genetic predisposition defense goes down the drain.  Later SVU gets word that the Muslim whom Sean killed at Central Booking had friends:  Sean's just been stabbed to death in the yard at Rikers."},{"episode_title":"Brotherhood","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/brotherhood-291417\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Escape","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/escape-286988\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Shaken","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/shaken-285120\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"It's morning at the playground and Sarah Rendell is discussing jobs with Veronica Nash as she buttons 20-month-old Lucy Prichard into her coat and sends her off to play. Sarah complains to Veronica that Lucy is unmanageable because Mrs. Prichard will not allow discipline to stifle the young girl's \"creativity.\" Veronica, who is a more experienced nanny, offers to show her how to handle Lucy, but when Sarah calls for Lucy to come, there's no answer. Lucy has disappeared.A uniform cop greets Stabler at the scene, and tells him that one of the nannies had noticed a \"creepy\" guy hanging around, and the uni thought SVU would like to get a jump on things if this turned out to be a pedophile snatch. Cragen arrives and says since Benson is testifying on another case Stabler will be working with him for the duration. As they walk the scene, Stabler notices something in the bushes. Yelling for Cragen to call a bus, he picks up an unconscious Lucy and starts heading for the street, as he murmurs to Lucy to \"stay with me\" and \"it's going to be all right.\"Stabler speaks with Dr. Morella at the hospital. A CT scan had indicated Lucy had an intracranial bleed, but no fracture, although she did have a cut on the back of her head.  Lucy was rushed to surgery to try to relieve the pressure on her brain before a rape kit could be done. However, a quick Lumi-Light revealed no evidence of semen and her clothing was intact. Cragen arrives on the ward and says he's spoken with the mother who works in advertising, so it may take her a while to get to the hospital. Lucy's father had died last year from a heart attack. Stabler says, \"Hits just keep coming, huh?\" With no family to interview, the detectives turn to the nannies.Stabler and Cragen interview Sarah in one of the hospital's stairwells. Sarah has never seen the creepy guy Veronica saw, and she has never seen anyone she doesn't know. It's always the same people. While Sarah lists the different places to which she takes Lucy, Evelyn Prichard arrives.  Distraught, she asks how Sarah could let this happen and then collapses and weeps on Stabler's chest after Cragen takes Sarah away, and asks why God is punishing her. Stabler suggests she see the hospital chaplain.Outside the chapel, Cragen says he will stay with Evelyn and Stabler should interview Veronica Nash to see if she can describe the creepy guy in the park. Stabler interviews Veronica at her charge's home. She takes pleasure in telling him that Sarah is just a babysitter and Veronica, as a certified nanny, would not have found herself in similar circumstances. She describes the man in the park as a \"white guy, mid-40s, short dark hair, very stocky.\" She originally thought he was a father who wanted candid shots of his child. Stabler takes her back to the park so she can show him the location where the man had been shooting, and then sends her to the precinct to work with a sketch artist. Stabler and Siper examine the scene, and Stabler finds an empty film box.Back at the precinct, Dr. Huang points out nowadays it is very unusual for a pedophile to use film. Most have gone digital to avoid being reported when they send the film to be developed, which might indicate the perpetrator is a risk-taker. Cragen walks in with a match for the fingerprints on the film box: Dennis Papillion, who works at a local drug store.At the Sav-Mart on Broadway, Cragen and Stabler find out Papillion works in Photo Finishing. Because he picks up the film to sell it to the customers, the fingerprint is easily explained and he has an iron-clad alibi: he has been in the store since it opened, under surveillance by a security camera. He is, however, able to identify the park photographer for them, Ronny Ickles.Ickles is very upset to find himself in an interrogation room as an accused pedophile. He claims he is a PI, but is unable to produce a license. Although it was a legitimate job, he had left the scene because he knew his client wouldn't like for him to get involved. Cragen threatens him with prison, and Ickles reveals a rich man named David Jeffries paid him to spy on his nanny - to see how his son was treated when he wasn't around.Stabler is at a board sorting the PI's pictures when Benson walks in with the rest of the photos. Cragen comes in and says Jeffries has confirmed Ickles story. Stabler tries to make sense of the photos, but something doesn't add up. No one is anywhere near Lucy around the time of her disappearance. Cragen says maybe there is no crime; maybe this was an accident. Stabler adds kids fall down all the time and get hurt, but they don't end up in the hospital in surgery. Olivia gets a call from the hospital and tells Stabler that Lucy's doctor wants to see him.Stabler goes to the hospital. Dr. Morella says Lucy is out of surgery, but she's still unconscious. Lucy has bilateral subdural hematomas with retinal shearing. Stabler says Shaken Baby Syndrome, and Morella agrees. It's hard to say what Lucy's chances are. Even if she recovers, she will probably have permanent brain damage. Stabler asks if she's sure about the diagnosis, and Morella says she is, \"Someone shook Lucy so hard it damn near killed her.\"Dr. Warner reviews Shaken Baby Syndrome with Stabler and Novak at the precinct. Lucy's injuries fall into the constellation of injuries that make up the syndrome. She will have no problem testifying that this is the only possible cause of Lucy's injuries.  In addition to the bilateral hematomas and the retinal shearing, she has compression fractures of the ribs from where the perpetrator grabbed her. Novak can't understand how no one noticed this at the playground. Warner says, due to the amount of bleeding, somebody shook Lucy between 12 and 48 hours before her collapse. Lucy would have been lethargic, sleepy, and maybe even vomiting. Novak says that means the perp could be anyone who had contact with Lucy in the last three days.Stabler goes back to interview Evelyn at the hospital. She and Sarah are the only adults in contact with Lucy; she hasn't dated anyone since her husband died. She had worked late on Monday because she needs all the overtime she can get. She wishes she could afford someone more qualified than Sarah, but she can't, even working overtime. She says she has caught Sarah yelling at Lucy, but if she had ever seen her hit her daughter then Sarah would have been fired immediately. Stabler asks if she's seen any marks on Lucy. Evelyn says only a few, but Sarah always has a good explanation like a fall or another child hit her at the playground. She goes quiet as the implication hits her.Stabler and Sarah talk at the precinct. Stabler is very sympathetic, and draws out Sarah's complaints about her work hours, low pay, and what a horrible child Lucy is. She tells him Lucy threw a toy at Sarah a couple of months ago and she spanked her. Sarah swears she did not cause Lucy to be hospitalized. Stabler points out she was the only adult who had been with Lucy on both Monday and Tuesday. Sarah tells him Lucy falls down a lot, but Stabler says the falls don't explain the injuries. Stabler asks if she is willing to take a polygraph. She says she isn't sure because she is afraid. Stabler urges her to come clean now before it's too late. Sarah then confesses to taking $5 to $10 at a time from Evelyn's purse because she is paid so little and works so hard, and this causes her to be angry.Stabler tells Novak his gut tells him that Sarah is innocent. Novak tells him his gut is inadmissible. Besides, she fits Huang's profile, perhaps she is just a clever sociopath. Cragen walks into the squad room saying he hates to rain on Stabler's parade, but he just got a call from Ian Felson at the Tribune. Felson has an eye witness who says Sarah abused Lucy.Stabler tracks down Felson, who gives up his source for an exclusive on the arrest. It turns out that Veronica Nash left some things out of her original interview. Back at Nash's place of employment, her superior attitude is still firmly in place as she points out that Stabler didn't ask, so she didn't volunteer the information because she thought it was the creepy guy who'd attacked Lucy. Now she says Lucy is willful and defiant and Sarah is unable to control her, which makes her frustrated and abusive toward her daughter. When asked for a specific incident, she tells them about a trip to a museum where Lucy was out of control, staff had complained, and Sarah had belted her across the face.At the Children's Museum, Stabler discovers it was Veronica who had hit Lucy, and not Sarah. Angry, Stabler returns to a defiant and unapologetic Nash, who tells him that Lucy needs discipline. Unfortunately, she also has an airtight alibi for the relevant time period, so the most they can charge her with is assault. Cragen points out the papers will crucify her and she'll lose her job. That's something. Munch walks in with Sarah's polygraph results; she had passed. This leaves only one suspect.Stabler returns to the hospital to talk to Evelyn again. With no one but herself left as a suspect, Evelyn finally confesses to having a boyfriend. Lucy was with him for 20 minutes on Sunday night after she had sent the sitter home, but she had to go out unexpectedly. She admits that was reluctant to confess to the affair because the man is married.Stabler discusses the case with Cragen and Huang. Evelyn has been having an affair with her boss, Drew Farmer, for the last couple months, which explains all of Evelyn's overtime. Cragen wonders why it happened if Evelyn was gone such a short time. Huang says the sound of a baby screaming can trigger an extreme stress response in some people and it doesn't take much time at all. He postulates that possibly Farmer was just trying to make her be quiet.Drew Farmer is brought to the station, where he maintains that Evelyn is just an employee. Stabler trips him up, and Fuller admits he was at Evelyn apartment on Sunday night, but he won't go beyond that. Farmer says, \"Look, if my wife finds out, she will cut my balls off!\" Stabler counters, \"You keep jerking me around, criminal court's gonna do a lot worse to you!\" Farmer swears he did nothing to Lucy. He finally admits she wouldn't stop crying, but when he picked her up she vomited on his jacket. He didn't want to spoil the mood, so he didn't tell Evelyn. Stabler becomes more and more frustrated because he feels he is failing Lucy. She can't speak, but every adult in her life is lying their asses off. Cragen decides to go back to the medical evidence and let it tell the story.Dr. Warner sets up a timeline with Lucy's physical symptoms and the people who were with her. Lucy had vomited on Sunday night. She was lethargic and clumsy on Monday, and she collapsed on Tuesday. The timeline fits with Drew Farmer's account, which means Evelyn most likely shook Lucy earlier on Sunday, but they have to prove it. Warner mentions Lucy's rib fractures and says different hands create different fracture patterns. She demonstrates by using her own hands and Cragen's hands. Stabler and Warner go to the hospital where they measure Evelyn's hands. Warner declares her to be a match, and Stabler arrests her for assault and attempted murder. Evelyn protests, saying she'd never shake her baby. She loves her. She is a good mother.At the precinct, Evelyn will not confess and asks for her lawyer. Novak looks forward to convicting her, but Stabler says any parent will sympathize with her. Sometimes babies just won't stop crying. You cuddle them, you pick them up… hell, you'll beg them. Sometimes nothing works. Evelyn's lawyer, Rebecca Balthus, arrives. She severely chastises Novak for accusing an innocent woman. Novak has little sympathy for someone who shook the life out her child. Balthus maintains her client's innocence.In the courtroom, Evelyn's attorney challenges Warner's assertion that Shaken Baby Syndrome is the only cause of Lucy's symptoms. She asks if Warner is familiar with hemophagocytic lymphohistiocytosis or HLH. Balthus asks if it isn't true that HLH also causes bleeding of the brain and eyes. Warner acknowledges that it is true. Balthus asks if Lucy's blood was tested for HLH. There is no blood test for HLH, but Warner points out that HLH could not have caused Lucy's rib fractures. Balthus is able to make the fractures due to the CPR performed and Stabler's grab and run. Balthus returns to the possibility of HLH, and Warner states an autopsy is the only way to distinguish between HLH and Shaken Baby Syndrome. Balthus finally gets her to admit that HLH is a possibility.Evelyn takes the stand where she says the day Lucy was born was the happiest day of her life. Evelyn says that she neither spanked nor shook Lucy. She knows what shaking can do to a baby. Novak gets Evelyn to admit that Sarah was the primary caregiver and then confesses that Lucy was crying that night and Evelyn didn't know what to do to make her stop. Since she was ruining a rare romantic date, Evelyn had shaken her out of desperation. Evelyn begins to cry and says she would never hurt her baby. Novak closes for the prosecution.A triumphant Novak meets Stabler in the hall, and is positive that the jury has seen through Evelyn. Stabler is not so sure. \"I've worked enough battered kid cases to know: giving birth doesn't make you a mother, but juries… they believe what they need to believe.\" His phone rings. He learns that Lucy has suffered a stroke and isn't expected to live.At the hospital, Morella tells Novak and Stabler that a massive brain hemorrhage has destroyed Lucy's cerebral cortex and she would already be dead without the life support. Stabler asks her how long she can be kept alive, and Morella says she doesn't know - days, months. Morella says Lucy's persistent vegetative state means all she feels is pain and the only thing that will end her suffering is an infection or turning off the machines. Stabler asks Novak to take Lucy's condition to the jury. She says summations are over and the judge is almost ready to charge them. Stabler says, \"This baby's suffering is not irrelevant.\" Novak tells him she will see what she can do.At the court rotunda, Novak argues to the judge that Lucy's change may make a murder charge. Balthus points out that Evelyn will not pull the plug and new evidence would only be relevant if offered by the defense. The prosecution only gets one bite at the apple. The judge agrees and Novak's motion is denied.Novak pages Stabler to the courtroom and he asks about the verdict. She tells him the jury was hopelessly deadlocked and a new trial begins Monday. The jury will hear that Lucy is brain-dead, but Evelyn is so sympathetic that, although she is a murderer, Evelyn will get away with everything again as long as Lucy is technically alive.At the hospital, Stabler sees Evelyn reading a story to Lucy. Evelyn asks why he has come, and he says, \"To see Lucy.\" She asks if he has any children.  When he tells her he has four, she asks what he wants from her. He says he just wants to see Lucy put out of her pain. Evelyn says she believes it is up to God. Stabler says he believes that as well, adds, \"I love my children, and if one of them was sick I would do anything in the world to make them better, but I would also pray to God that if all hope were gone that he would give me the strength just to end their suffering.\" Evelyn does not back down, and tells him, \"I love my daughter. If I lose her, I might as well be dead myself.\" Elliot leaves Lucy's hospital room.Stabler has asked Cragen to arrange a meeting with DA Arthur Branch. Stabler says he thinks the DA's office should fight to turn off Lucy's life support. Stabler talks about a couple cases he's read about in the paper. One case is in California where the DA was successful, and one case is in Florida where the parents prevented the machines from being shut off. Branch queries his motivation: is he concerned about Lucy or is this about finally nabbing Evelyn Prichard? Stabler tells him that he doesn't know whether Evelyn is truly a grieving mother or manipulating the situation to beat a murder rap. What he does know is Lucy is in constant pain and she will never get better. Branch agrees to the motion, but warns him that they must tread lightly or the police and DA's office will be painted as baby-killers.Novak comes to the precinct unhappy that Stabler went over her head, although she admits she has been ambivalent about how to proceed because she is not a mother. Cragen says, \"Welcome to Special Victims. It's not always black and white.\"In the judge's chambers, Novak defends her motion against a bitterly derisive Balthus who claims the prosecution is using the motion in order to beef up the charge against her client to murder. The judge agrees Evelyn's right to control her daughter's fate is compromised by the charges she is facing, but Novak will still have to prove that Lucy is better off dead before the judge will grant the motion.At the hearing, Dr. Morella explains Lucy is in excruciating pain and her bones are demineralized. They have become so brittle that just yesterday one broke during a diaper change. A simple touch can cause a seizure. Balthus counters this with tales of people who have recovered from persistent vegetative states. She believes miracles are possible. During redirect, Novak focuses on how much pain Lucy is experiencing. Suddenly, Evelyn breaks down and cries, \"Enough!\" Over her lawyer's objections, she says she wants the machines turned off and for Lucy not to suffer any more. The judge asks Balthus to explain to her client that she will face murder charges if she does this. Evelyn says she doesn't care and finally confesses that she did it. She tells them that on Sunday night, she had just wanted a chance at a normal life again with the man she loved; a night to herself. Lucy had been sleeping peacefully at first, but then woke up and wouldn't stop screaming. Evelyn admits she was so angry that she shook her over and over until she stopped crying. When she put her down, Lucy had smiled up at her; and everything seemed to be all right. Even after the doctor told her that Lucy had been shaken, Evelyn kept telling herself that it couldn't be her fault. Sobbing, she says, \"I never meant to hurt her.\"Cragen enters a bar where Stabler is hunched over empty shot glasses. Stabler asks if it is over, and Cragen tells him that Lucy went peacefully 10 minutes after the machines were unplugged. Evelyn has been taken to the Bedford Hills women's correctional facility. After Stabler slugs back another drink, Cragen asks for his keys and says he'll drive him home. Stabler picks up a photograph from the bar and looks at it. The image shows Maureen when she was about Lucy's age. He recalls to Cragen that he had just gotten out of the Marines, he was unemployed, and Kathy was pregnant again. Kathy went out one night, and he was home alone with Maureen. His daughter spilled grape juice on a brand new carpet they had just bought, although they couldn't afford it. He had grabbed Maureen's arm to spank her, but she twisted away and he slapped her on the face. As his arm goes up for a second blow, a voice in his head told him, \"Stop!\" He continues,  \"So I'm standing there in the middle of this room, holding the limp body of my little girl, and she starts crying. And I pick her up, and I just keep saying over and over, 'I'm sorry, I'm sorry.' I could've killed my kid over a lousy carpet.\" Cragen walks him toward the door."},{"episode_title":"Control","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/control-281560\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Abomination","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/abomination-281559\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Choice","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/choice-281558\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Coerced","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/coerced-278996\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Serendipity","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/serendipity-278851\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":"While conducting routine tests, inspectors from the Centers for Disease Control find the body of a dead newborn girl in the sewer. The umbilical cord was tied off with dental floss, suggesting a home birth. Freshly laid maggots indicate the body had been dumped no more than three hours before.Elliot and Olivia canvass the immediate neighborhood and locate expectant mother Brianna Morris. Her landlord tells them that even when Morris' condition clearly showed, she still denied being pregnant. They find her dead in her bedroom, delivered of her child. Someone else dumped the baby.A neighbor heard someone knock at Morris' door early that morning, then nothing. Prescription prenatal vitamins lead to obstetrician\/gynecologist Dr. Curtis. He tells Elliot and Olivia that while Morris had been eight months along, she had been his patient for only the past three. Although Morris underwent every medical test in the book, she had been very emotionally detached from her pregnancy.  A man named Ron Wolcott paid the doctor's bills, except for the latest one on which the credit card was declined.Ron Wolcott and his wife Kelly were to have adopted Morris' baby, after trying unsuccessfully for ten years to have a child of their own. Ron, who works at a food flavoring institute, says his credit card was declined because it was maxed out. The adoption was privately arranged by Marcy Cochran, the wife of one of Ron's colleagues. She does volunteer work, and Morris had called her hotline.Cochran says that Morris had been considering suicide after finding out she was pregnant. Her own life was a wreck, and she feared that her child's would be no better. The father was \"the man of her dreams\", until she discovered the phone number he gave her was fake. Cochran had taken a special interest in Morris, talking with her on the phone every night. During their last call four days ago, they had a fight. Cochran had told her husband, in confidence, that Morris had changed her mind about giving up her baby.  Mr. Cochran then told Ron Wolcott.Warner determines that the baby bled to death through her umbilical cord. The cord wasn't tied off until after she had lost over half her blood.  Morris had been injected with drugs to paralyze her first, then to induce labor. After the birth, she was suffocated to death.Elliot and Olivia confront Wolcott, a chemist, at his workplace. He admits he stopped paying Morris' medical bills, to convince her to go through with the adoption. SVU obtains a search warrant for the Wolcotts' home, where Kelly Wolcott says her husband hadn't told her that Morris had changed her mind. A small case of pharmaceuticals is found in the kitchen. As the search continues, new SVU prosecutor Casey Novak arrives. A former white-collar prosecutor, Novak is accustomed to being very hands-on with her cases and visiting crime scenes herself.Novak's visit to Morris' apartment turns up library books on child care, and another title \"Skin Diseases of the Elderly.\" Library staff remembers Morris, who had been interested in a dermatologist named Archibald Newlands and how to file a paternity suit.Dr. Newlands tells Elliot and Olivia that Morris, whom he'd never seen before, came to his office a week ago and made a huge scene. Apparently he bore a strong resemblance to an ex-boyfriend. His wife, also a dermatologist and his business partner, vouches for his alibi the day of Morris' death. He volunteers to take a paternity test.Ron Wolcott's alibi for the day of Morris' murder is verified. The pharmaceuticals found in his home were from a sales representative, and none of them could make the drugs used on Morris. The paternity test reveals that Newlands isn't the father of Morris' baby. However, the test has cleared a cold case.Newlands is brought in for raping young Molly Stratton some five years before. He denies being a pedophile. Novak clashes with Elliot and Olivia over their interrogation of Newlands, because the statute of limitations on the crime expired three months ago. In hopes of locating other victims, the detectives talk to the now 11-year-old Stratton. She remembers that her rapist had used honey during his attack.SVU finds another, recent young victim of a rapist who used honey. Against Cragen's advice, Novak insists on bringing in Newlands for a lineup. Novak then learns firsthand just how ugly and emotionally draining sex crimes can be. Olivia reassures her that everyone thinks at first that they can't handle it.Novak visits Mrs. Newlands, who stands by her husband until told that his DNA was found in the earlier victim. Archibald Newlands fails to appear at his trial, and his attorney is at a loss to explain his client's absence. Newlands is later found at his home, shot in the back of the head.Cragen wonders if the wronged Mrs. Newlands killed her husband, when he receives word that six-year-old Courtney Jones went missing from a public park early that morning.  Although his home is near the crime scene, Archibald Newlands was killed at about the same time Jones disappeared. A honey stirrer is found in a nearby trash can. While performing the autopsy on Newlands' body, Warner finds a plastic tube of blood in his upper arm. He was the father of Morris' baby, but he wasn't the Honey Rapist. He put the tube with someone else's blood in his arm to beat the paternity test. Unfortunately for him, that someone else was a previously unidentified child rapist.The real Honey Rapist must be one of Newlands' patients, who now feels footloose and fancy-free. To keep everyone thinking the Rapist is dead, he'll have to kill Courtney Jones. Mrs. Newlands checks their patient lists, and finds that they drew blood from only one male patient during the timeframe in question.SVU raids the home of Peter Nestler. He isn't there, but they find jars of honey and stacks of child pornography. Novak arrives with a search warrant, and to see if she's really cut out to handle sex crimes. She sees fishing gear in a closet and realizes that Nestler is a saltwater fisherman. Olivia finds a framed newspaper photo of Nestler posing on his boat, the Honey Do, at City Island Marina.The three of them go to the marina and spot Nestler headed for his boat slip, wheeling a large portable cooler. When Elliot and Olivia give chase, he drops the cooler and runs. Elliot catches up with Nestler and knocks him into the water, while Olivia continues on to search the boat. Back down the pier, Novak checks the cooler and finds Courtney Jones inside, unconscious but alive.Later, Novak asks Arthur Branch to take her off Special Victims. Although she slam-dunked her first case, she's still an emotional train wreck from Courtney Jones' ordeal. Branch says that he'd had his eye on Novak for SVU prosecutor when she was still in the white-collar crime division. The Jones case proved that he made the right choice for the job; and while Novak may not want it now, eventually she will."},{"episode_title":"Loss","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/loss-277416\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Mother","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/mother-275701\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Manic","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/manic-275520\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Tragedy","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/tragedy-272296\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"svu","corpus":""}]}