{"episode_recaps":[{"episode_title":"Rhodium Nights","nth_episode":23,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/rhodium-nights-2458387\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Strange Beauty","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/strange-beauty-2448139\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Learning Curve","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/learning-curve-2436503\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Father Dearest","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/father-dearest-2444221\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Street Revenge","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/street-revenge-2440528\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Valentine's Day","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/valentines-day-2425700\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Justice Denied","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/justice-denied-2429935\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Child's Welfare","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/childs-welfare-2386928\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Hunting Ground","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/hunting-ground-2386927\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Home Invasions","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/home-invasions-2262953\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Father's Shadow","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/fathers-shadow-2061599\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Official Story","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/official-story-1741936\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Theatre Tricks","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/theatre-tricks-1741149\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Spiraling Down","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/spiraling-down-1561571\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Lost Traveler","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/lost-traveler-1560777\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Educated Guess","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/educated-guess-1559380\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Rollins and Fin are in Central Park where they find a mentally unstable man. The man, Eric, is talking to his imaginary girlfriend and convulsing on the ground, naked. He's taken to the psychiatric ward of the hospital. While he's there, Eric sees another patient, Gia, being raped and tells Fin and Rollins about it. Both are a little wary since Eric had imagined his own girlfriend. Eric gives them a description of Gia and it turns out that his description actually matches. Benson and Rollins go to question Gia. She tells them she was heavily sedated the night before after being very upset. While she denies being raped, she allows the officers to give her a rape kit.Amaro says that the rape kit shows traces of male DNA and that Gina may have been raped. She was in the psychiatric ward for chronic suicide attempts, possibly because of chronic rape. Rollins and Benson go to question Gia's mother, Diane. They learn that Gia has a history of accusing innocent men of raping her but she is also mentally ill – just like her father. Benson and Rollins also meet Gia's aunt and uncle, Bella and George. They tell the officers that they're worried about their niece's well being.A few days before Gia was supposedly raped, she had gotten in a fight with one of the other patients named Jay. The officers go to ask Jay about the incident and he flips out. He eventually breaks down into tears and says that he had been protecting Gia from a guard at the facility named Charles Lee. The guard is known to force patients to have sex with him. When they go to question Charles, he tells them that Gia had asked him for a gun and that she had given him consensual oral sex. Gia confirms that she did give Charles oral sex but only so that she could get the gun which Charles ultimately reneged on. She says that she felt she needed protection. It was her uncle George who had come to visit her and raped her. She tells the officers that George had been raping her since she was 14 years old. George is later arrested for impersonating a doctor to have access to the facility.The officers question George and he tells them that he is in love with his niece. Because they are not related by blood, he thinks that it is acceptable. He also tells them that he needed to impersonate a doctor so that his wife would not find out about his visit. He tells them that it is true love, and shows them a love letter from Gia."},{"episode_title":"Russian Brides","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/russian-brides-1557669\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":"The horrifically disfigured body of a woman is found next to a restaurant dumpster. With her face mauled and her teeth and fingertips gone, the only identifying details on the body are a couple of tattoos: a butterfly and a woman accompanied with the words \"Mother, forgive me\" in Russian. This is usually how prostitutes are marked in Russia. The sand on the body comes from Brighton Beach, an area with a large Russian population. Cragen doesn't want details on this murder to go public, because the Russian mafia might be involved.Amaro and Fin find out that the butterfly tattoo belongs to a woman named Lena. She recently got engaged to an American named Daniel. Benson and Amaro go to speak with Daniel, who panics when he sees the two detectives. He's taken in for questioning, and reveals that Lena was a Russian mail order bride. He found her profile online and he traveled to Russia to meet her, where they really hit it off. He says that Lena worried about someone from her past coming back to hurt her. Lena wasforciblytaken, and her kidnappers demanded a $100,000 ransom. Daniel paid, but it looks like Lena turned up dead anyway.The team looks at footage of Daniel and Lena in Russia and notice someone lurking in the background of some scenes. Amaro and Fin discover that the Russian bride website where Daniel met Lena is operated by a travel agency. They go to arrest David, who runs the agency. David ID's the man in the background of the videos as Liev Bodrov, a powerful Russian mob boss.Benson speaks with Daniel, who shows her that Lena is on another Russian bride website, but with another name: Irene. Is this whole thing a scam? To lure Lena out, Cragen goes undercover as a rich man who is looking for companionship. He expresses interest in Irene and they meet. Cragen gives Irene the sad story of his first marriage, but Irene doesn't reciprocate with a sad tale of her own. Cragen tries to get her to spend the night with him, but she tries to run instead, and Rollins grabs her.The team wants Lena to lure out Liev, but she doesn't want to. Liev has her daughter and Lena says that if she ever tries to go against the mob boss, he'll kill her daughter. Liev uses the mail-order bride site as a front for an extortion scheme. Lena brings men in and then Liev acts like he kidnaps her, demanding huge ransoms from rich male victims. After the ransoms are paid, Liev kidnaps an innocent woman, kills her, and then gives her tattoos like Lena's.Lena finally agrees to be the bait. She and Liev talk, and then SVU comes in. When Liev pulls out a gun, Rollins shoots and kills him. Lena panics, knowing that Liev's death means that her daughter is going to be killed as well. She takes the team to one of Liev's safehouses, claiming that her daughter is being held inside. But there's no girl, and Lena tries to escape. The detectives chase after her and arrest her.Benson finds out that Lena did have a daughter, but she's long dead. Liev found her daughter's killer and murdered him. Lena has been paying off her debt to the mob boss by being a part of his scheme. Cragen tells Daniel that he should testify against Lena."},{"episode_title":"True Believers","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/true-believers-1510924\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Missing Pieces","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/missing-pieces-1403224\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""},{"episode_title":"Double Strands","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/double-strands-1401733\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":"A ballet dancer is sexually assaulted, and she recalls that her attacker had a yin-yang tattoo and was calling her \"mommy\" as he rapped her. Amanda is stunned because this crime is exactly like a case she worked on back in Georgia. There was a man known as the Atlantic Coast Rapist who perpetrated serial rape across several states.The sketch of the culprit gets released publicly and a man named Gabriel is a reasonably good physical match. He is positively identified by two of the victims, but he remains surprisingly calm. Amanda believes they've finally caught the serial rapist but she needs to learn not to jump the gun. Olivia and Nick question Gabriel, who denies the crimes. Strangely, however, Gabriel admits to being in the same states the rapes occurred in at the exact same time. Gabriel is taken to Rikers Island. The suspect attempts to commit suicide in his cell, but he fails. His wife gives up a little more inforamation on Gabriel. His parents died while he was away at college. She can also give Gabriel an alibi during one of the nights the crimes occurred. He was at her side while she was having a miscarriage.The detectives discover that Gabriel is adopted and has a twin brother he didn't know existed. Brian witnessed his adoptive mother set his adoptive father on fire. Ever since, Brian had to struggle through life. The public is led to believe that Gabriel has been released from prison, in the hopes the this would lure Brian to commit another crime. Amanda sets herself up as the victim. Nick is supposed to keep an eye on her, but he loses track, though he finds her just as Brian climbs on top of her. Later at the station, Brian speaks with Amanda, and he confesses that he was jealous of how much more his brother Gabriel had, so he wished to frame his twin brother for these terrible crimes."},{"episode_title":"Blood Brothers","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/blood-brothers-1400857\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":"Ella, a 13 year old student at a Catholic school, faints during an assembly and one of the nuns calls for help. Detective Amaro speaks with Monsignor Kiata who makes some small talk before revealing that Ella is pregnant. After a conversation with Ella's grandmother, Amaro is told that Ella's mother wasn't exactly the best role model. Benson has a chat with Ella who tells her that she's never had sex – this was her miracle baby. Benson confirms that Ella is indeed pregnant and 18 weeks along.Fin and Rollins speak with Ella's estranged father. He doesn't care one way or another that his daughter is pregnant. Amaro goes back to speak with Ella's classmates. They tell him that Arturo, a boy in her class has a crush on Ella. Benson and Amaro go together to talk to Arturo and when they ask him if Ella talks about any older men in her life, Arturo gets a bit anxious and needs to use his inhaler. The duo, along with Munch, talk to one of the science teachers, Mr. Cordova. City records show that Mr. Cordova has been dead for fifteen years and he admits that he's actually Diego Ramirez and he's a registered sex offender. He earned his spot on the registry when he was 19 and had sex with his girlfriend when she was just 16. Benson revisits Ella and she tells Benson that Cordova had sex with her. Benson immediately finds some holes in her story and asks Ella to tell the truth. She also sees a bouquet with an anonymous note in her room.Benson and Amaro track down the florist who took the order for the bouquet. After going through records, they learn that Ambassador Andrew Raines had the bouquet sent to Ella. Fin and Rollins speak to the Raines' son, Tripp. He brags to them about having sex with her but he's taken off into a town car. Benson and Amaro find Ella in a heated argument and she says that she doesn't want to have an abortion. She reveals to Benson that Tripp had raped her at a house party in his parents' home and then sent her flowers the next day. Benson pushes to prosecute but because Tripp is also a minor and with his parents' status and legal team, he would be easily off the hook. The Raines' agree to let Benson and Amaro talk to trip so long as they are present for the conversation but once they go up to his room, he's gone. The pair go to talk to Arturo's mother who had been working as a housekeeper for the Raines for many years so its apparent that they would do anything to protect the Raines.Tripp's credit card records show that his card had been used. Rollins and Fin find the man who had used the card – Chase, a gay man who had found the card in a meeting place for gay men in Central Park. The detectives search the park and find Tripp's dead body. Once reporters get wind of the news they corner Andrew Raines and ask if his son was gay.The Raines' fired Inez, Arturo's mother and Andrew claims it was an immigration issue, especially with his upcoming run for office. Records show though that Inez is a citizen. He did give Inez a very nice severance package and paid for her housing. They realize though that Andrew wasn't paying the housekeeper but he was paying child support because Arturo is his child. Arturo tells the detectives that he had brought Ella to Tripp's party. Tripp had gone to Central Park to meet with Ella to tell her to get an abortion. He had given cash to Arturo to make sure it happened but he was so upset that he beat Tripp to death with a rock. Arturo admits that he was jealous of Ella's love for Tripp based simply on his status. All Arturo wanted was for Andrew to admit that he was his father."},{"episode_title":"Personal Fouls","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/personal-fouls-1397900\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":"This week, SVU is working on a case where Stevie, a former basketball player claims that he was molested by Ray Masters. Masters is a well respected and known basketball coach that runs training programs for children and professional players. Stevie is now living as a homeless junkie and talks to Nick Amaro, the new detective, about the abuse that he suffered as a child. He tells Nick that he was paid off by the coach in order to remain quiet about the molestation but everyone else on the team is unable to find any evidence or support to back up Stevie's claim.According to Stevie, his roommate Prince Miller supposedly received worse treatment than Stevie had. Prince won't admit that any of this actually happened to him and as a result, he resents Stevie. Later, the team finds Stevie dead. He had overdosed on heroin. It is suspicious that Prince Miller's manager, Supreme, had forced a hot s hot of heroin into Stevie. Supreme knew that Stevie was a recovering addict and he needed to ensure that his client's image did not get tarnished by the bad press.Prince confronts his old coach and decides to testify against him in front of the jury. Ultimately, Ray Masters is arrested and Prince encourages the other victims to come forward with their stories."},{"episode_title":"Scorched Earth","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-special-victims-unit\/scorched-earth-1396410\/recap","nth_season":13,"source":"http:\/\/www.tv.com","show":"svu","corpus":""}]}