{"episode_recaps":[{"episode_title":"Rubber Room","nth_episode":23,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/rubber-room-1336612\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"Lt. Van Buren listens to a complaint brought up by parents who have discovered their daughter in a topless photo on a blog called Fighter Boy. The detectives investigate, noticing that Fighter Boy blogs a lot about bombs, and has posted a video with a pipe bomb explosion. Lupo notices that the video also contains footage of propane tanks in the trunk of a car, and the car's license plate indicates that its registered in New York. Bernard and Lupo track down Fighter Boy, but he insists that he didn't make the video. He only found it and posted it because he thought it was cool. The detectives still need to find the real person who made that video, because the car bomb would be powerful enough to take out an entire city block.Later, a scared Van Buren gets an MRI, and the scan should indicate a change in the degree of the cancer, and whether it has spread. The bomb video has been traced to a spot on Staten Island, and the detectives head over there. The police find the remnants of a pipe in the area, and mention that a pipe bomb was discovered in the restroom of a gas station a couple of weeks back. The bomb was old and rusty and probably a dud. Van Buren receives a call about getting a line of credit to pay her medical bills, with Lupo accidentally getting the gist of the call. Lupo talks to Bernard and suggests they throw a fundraiser for Van Buren, but Bernard doesn't think she'd go for that idea.The bomb is traced to a couple of kids who also tracked down the place where the pipe bomb video was filmed. The found a piece of pipe and kept it for awhile, but finally ditched it in the gas station bathroom. One of the boys shows the detectives the website with the video, called Moot's Countdown. On the website is a blog entry which says that Moot is going to blow up a school.The detectives decide to take the threat seriously, but they have no idea which school is being targeted. Skoda is trying to profile Moot, but is having a hard time since the blogger doesn't share too much personal information online. Lupo posts on Moot's forum, saying that he wants to do a copycat bomb in LA. Skoda thinks that Moot is a depressive, but seems less psychopathic than the Columbine shooters.Meanwhile, Cutter and Rubirosa try to talk to a fed, as one of Moot's weapons (displayed on his site) has been traced to a gun dealer who stole Moot's carbine from a gun store.. The Fed blocks the attorneys' attempt to get to talk to the thief, saying that the federal crime outweighs a piddly state crime. ATF will not be too cooperative in helping them. And then Van Buren receives a call from her doctor. The first scan resulted in a lot of corrupted data, so she has to do the MRI over again.Moot has figured out that the police are now reading his blog, so he says that he will now have to be more careful in what he reveals on his site. The detectives notice that Moot writes a lot about teachers on his blog. Maybe he's a disgruntled student who wants to get revenge? One teacher in particular got Moot's attention, a science teacher who seemed to be very religious and had been claimed to have branded crosses into his students' arms.Lupo, Bernard and Rubirosa talk to a department of education rep, who claims that he can't discuss the specifics of the teacher's case. Rubirosa mentions that there is a credible bomb threat against a school, but the rep thinks that the teachers' union's lawyers would be an even greater threat. Someone else at the department of education clues the team in to a secret website where teachers can log in and complain about their jobs. She gives the detectives info on how to access the site, and maybe they can track down this particular teacher. Meanwhile, a very antsy Van Buren gets an MRI scan done for the second time.Lupo finds what he needs from the secret website. The teacher is Ron Koslowski. The detectives track Ron down, and he says that the accusation was exaggerated. He was doing a scientific demonstration with a Tesla coil and ended up leaving marks on the students who willingly helped out with the coil. He doesn't recognize Moot, however. Ron was suspended for four months, but he decided not to stay in New York to teach. He took a lower paying job in an out of the way county, but at least he could still teach science to kids.Cutter tries to get the grand jury to accept to subpoena the department of education so that they could get the case files open. They would have to open up the records of all the students at John Locke High school, but the jury refuses to give them the permission to go through the school records of minors.Van Buren finds out that the rest of the team are planning a fundraiser for her, and she tells them that she doesn't want their pity, and that they should cancel the event. But Lupo isn't going to.Using the teachers' website, the detectives match up identities to the teachers who are mentioned on Moot's blog. Most of the teachers can be found at a temporary reassignment center, or \"Rubber Room\". The Rubber Room is a place where teachers who have had complaints of misconduct or incompetence filed against them stay while their cases are investigated. Their union requires that every case gets looked at, so while the teachers are taken out of their classroom, they have to stay in the Rubber Room during regular school hours. It seems that many of the teachers are in the room because of exaggerated claims. A teacher who touched a student's hair was charged with assault. A teacher was reprimanded because he called a student a bastard, but that was after he was physically attacked by the student.The detectives ask for the names of the problem students, but none of them match with Moot's names. Bernard starts to think that maybe Moot was a teacher who had to stay in a Rubber Room and had heard all these other stories of teachers being attacked by students. All of the teachers Moot mentions on his blog are in rubber rooms, except for a woman named Moira Scott. The detectives believe that Moot worked with Moira.Moira and the lawyer supplied to her by her union meet with Cutter, but he's not able to get anything useful from her because of her lawyer. McCoy has watched the exchange and as Moira and her lawyer leave, he approaches her and pleads with her to talk to them. The lawyer strongarms McCoy, but McCoy gives him a piece of his mind. He argues that many innocent lives are threatened and Moira might know valuable information which would stop the massacre from happening. Moira finally speaks to Cutter. She explains that Moot is a teacher named Rick, who was great at his job but he couldn't handle the kids. A student who wanted a bathroom break ten minutes before class ended was told by Rick that he just had to wait. Instead, the student walked up to the front of the classroom and urinated in the trashcan. When Rick tried to stop him, the student accused him of trying to molest him. Rick was sent to a Rubber Room, but the charges were dropped. However, Rick's teaching career was already tainted by this incident, and his girlfriend decided to break up with him after that.The detectives go to Rick's house but discover that he isn't there. Rick's parents explain that he had a substitute teaching job in Queens. In Rick's room, there is evidence of ammo and the ingredients needed to make a pipe bomb. The detectives identify the school and try to get it evacuated. Rick carried a backpack into the school. In the cafeteria, the detectives discover a bomb. Rick shoots at Lupo, saying that he has nothing to lose. But as he's distracted, Bernard sneaks up and disarms Rick.At Van Buren's fundraiser, the detectives and attorneys celebrate the close of the case. Van Buren arrives, announcing that Frank is her fiance. She then receives a message on her phone, and she anxiously makes a call to her doctor. After the call ends, she whispers something in Frank's ear which makes him smile. Apparently, her cancer is in remission."},{"episode_title":"Love Eternal","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/love-eternal-1341228\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Immortal","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/immortal-1341227\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"The Taxman Cometh","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/the-taxman-cometh-1340447\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Crashers","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/crashers-1339483\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Brazil","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/brazil-1333566\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Four Cops Shot","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/four-cops-shot-1332900\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Innocence","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/innocence-1331195\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Brilliant Disguise","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/brilliant-disguise-1331033\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Boy On Fire","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/boy-on-fire-1319635\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Steel-Eyed Death","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/steel-eyed-death-1318292\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Blackmail","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/blackmail-1318277\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Fed","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/fed-1310895\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Shotgun","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/shotgun-1307875\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"For The Defense","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/for-the-defense-1307348\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Doped","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/doped-1306838\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"Brenda Sawyer's driving her minivan. Brenda's son & 3 other kids are also in the minivan. The kids are eating ice cream. Brenda asks her young son to get her nasal allergy spray out of her purse. When Brenda goes the wrong way on a highway ramp, she crashes into an oncoming car. Detectives Bernard & Lupo show up. Everyone in the other vehicle died. Also, two of the kids from the minivan died. Brenda, Brenda's son, & a girl are at the hospital. This is a terrible incident. It's really sad because Brenda & the sweet children got into an accident. A bottle of grain alcohol's found in the van.The detectives talk to Brenda's husband Matt, who explains that Brenda was taking their two kids along with their two nieces upstate for the weekend. Matt was supposed to pick the kids up, but he had to stay late at work, so he called his wife to get the kids instead. He claims that she sounded fine on the phone, and he insists that Brenda wasn't drunk. Brenda's blood alcohol level was .09. The girl from the minivan died at the hospital. The detectives talk to the girl's parents Sandy & Bob, who say that there didn't seem to be anything wrong when Brenda came to pick up their kids. Brenda told them that she was going to take the kids for ice cream. When Matt arrives, Bob attacks him because Bob feels that Brenda was drunk. The detectives have to separate the two men.Van Buren goes over the various witness reports, and says that the minivan was going north on the southbound lanes and was doing 55. Lupo doesn't believe that a person with a blood alcohol level of .09 would drive that erratically. Van Buren tells the detectives that they have to wrap the case up quickly, because the news media already knows what her blood alcohol level is. Brenda will be torn apart if she ever gets out of the hospital.The detectives go to Brenda's workplace, Woodmoor Pharmaceuticals, where they interview her boss Zach Marshall. Brenda was a member of their sales team. When asked if she drank, Zach says that he'd seen her take a glass of punch at the Christmas party, but that was it. Later, a coworker mentions that before Brenda left on Friday, she said that she was going to be trapped in a minivan with four kids over the weekend and she'll probably need a stiff drink. At first, the coworker thought she was kidding, but now she's not sure. Bernard and Lupo search Brenda's desk, but they don't find the telltale signs of someone trying to hide an alcohol addiction: no breath mints or liquor bottles. The detectives decide that since she mentioned getting ice cream for the kids, that they should check ice cream places along the route.The worker at the ice cream shop remembers seeing Brenda and the kids, and according to surveillance footage at the shop, she was drinking something out of a cup. She threw the cup away in the trash but the trash has already been taken by sanitation. Matt still insists that Brenda never drinks, but now his in-laws are giving him a very hard time. His mother, who is ill with cancer, is staying with them, and she vouches for Brenda's character. The detectives and Matt receive a phone call at the same time. Brenda has died in the hospital.The records on Brenda's cell phone indicate that she got a call from Matt, and then she got a call from a number registered to Woodmoor. A broken nasal spray dispenser is found and Lupo takes it as evidence. ME Rodgers has taken inventory of Brenda's stomach contents. Grain alcohol was discovered, along with orange juice and some fruit. When the detectives ask about the nasal spray, Rodgers says she didn't find anything but whatever's on the report. Someone spiked the fruit smoothie she was drinking. Rodgers also checked her nasal mucosa, and Brenda did have allergies. The spray contained something called propofol, an anesthetic which also can cause memory loss. It would not show up on any tox screens. Not only did someone spike her drink, they spiked her allergy medication.After tracing the lot number on the spray, they tell the health department to pull all the nasal spray from store shelves. It's discovered that Woodmoor also makes propofol. They inform Matt that someone has tampered with Brenda's nasal spray, and Matt says that Brenda was under a lot of stress at work. She'd been staying late and he and Brenda have not had that much time to themselves. The detectives go back to talk to Brenda's coworker, who says that Brenda was always using the nasal spray, and that she and Zach were having secret conversations with each other. They'd stop when she walked by, so she believes that something was going on between them. They decide to talk to Brenda's son, to see if he knows anything about the call his mother received from Woodmoor. The boy says that Brenda answered the phone, but couldn't hear the person on the other end, so she hung up. The son also says that Brenda's boss is very nice to her, and he bought her the smoothie she had when she went into the ice cream shop.Eight smoothies were delivered to Woodmoor Pharmaceuticals on Friday, paid by Zach. Van Buren suspects that Zach had spiked the smoothie and the spray, and planted the alcohol bottle in Brenda's car, to make it look like she got drunk. All of the 911 calls about the minivan came at around 5:25, except for one. A call to 911 at 5:16 was made by someone all the way in Tuckahoe, 10 miles away. Zach is brought in again and he says that he buys his entire sales team smoothies every Friday. Lupo brings up the fact that Brenda received a call from him, and he says that he must have pressed speed dial by mistake. The detectives keep pushing Zach, but Zach starts getting elusive. They have the 911 call from Tuckahoe, and the voice is clearly Zach. They then say he called 911 because he knew Brenda was driving while under the influence of the propofol and needed to get her off the road. Zach becomes anxious and pleads to go to the bathroom. They escort him into a stall, but while in there they discover that he tried to kill himself by stabbing a pen into his neck.Zach is charged with seven counts of murder in the second degree, but pleads not guilty. Rubirosa wants Zach formally detained, but Zach's attorney says that he wouldn't be a flight risk. However, Zach's suicide attempt could be seen as admission of guilt. The judge agrees to remand Zach. Cutter and Rubirosa discuss the case, saying that a confession from Zach would be better than just the suicide attempt. A foil wrapper from the nasal spray was found in Zach's apartment, and they can trace the spray to a warehouse in White Plains. Rubirosa heads there. She asks whether it's normal for a manager to visit a warehouse very often, and the only reason for this is because of a problem with distribution. Brenda was looking at the sales information for a drunk called Lextenda, which can supposedly prolong the life of cancer patients. Brenda's mother in law, Matt's mother, was being treated at a clinic which used Lextenda.Rubirosa goes to talk with Matt's mother, who realizes that she's not going to survive her battle with colon cancer. She was getting Lextenda for treatment but Brenda had her stop the medication. At the clinic, Brenda spoke with Nelson Quintana, whose father Albert was also being treated for cancer. When she told the man that she worked for the company which made Lextenda, the man became upset.Later, Nelson tells Rubirosa that Lextenda is a very expensive drug, costing upwards of $1000 per day. The price exceeded the amount of money in Albert's health insurance, so Nelson had to start paying for the drug out of his own personal funds. His father did not get better, however, but his mother kept paying for the drug and now has no money in her savings. He did get angry when he learned that Brenda worked for Woodmoor, but when they started talking, she promised him that she would investigate Lextenda. She even got into an altercation with one of the clinic doctors, Dr. Price. Rubirosa speaks to Price, but the doctor explains that when families learn that their sick relatives aren't getting better, they will put the blame on the doctors and the drugs. Brenda was trying to argue that Lextenda wasn't working, but Price thought it was just a sales pitch for her to sell him another type of drug. Rubirosa presses Price on how many terminal cancer patients are on Lextenda, but Price isn't forthcoming with the answer. She mentions that she could get a subpoena on all his medical records, and Price agrees, but that he needs to talk to his lawyer. Rubirosa notices photos in Price's office of him at a bunch of Woodmoor sponsored golfing events.Meanwhile, ME Rodgers has gotten the records from Price's patients through the available morbidity studies from the state. Price prescribed Lextenda to all his terminal patients. Although the drug seems to prolong the life an average of 36 days (according to Woodmoor's own marketing), most seem to live around a week longer than without the drug. The attorneys discuss the case, with McCoy saying that perks for doctors from the drug companies aren't new. However, if Brenda was going to whistleblow, Zach might have found out and wanted to keep her quiet. Since he's the sales manager, sharing the truth that Lextenda doesn't work would have catastrophic effects on his department. Woodmoor makes a lot of money off selling Lextenda.Zach is appointed a new lawyer by Woodmoor, who claims that all the evidence against Zach is circumstantial and then starts the procedure to bail Zach out. Meanwhile, the attorneys say that Lextenda is the reason why Brenda was killed. All the research on the drug and its true effectiveness was on her laptop, which was confiscated by Woodmoor.When a request to obtain the computer doesn't work, McCoy ends up talking to the CEO of Woodmoor, Austin, who made a generous contribution to McCoy's political campaign. Austin claims that Lextenda is effective, but McCoy counters that Brenda believed Woodmoor was trying to sell hope to desperate people at $1000 a day. Austiin counters that without big companies and their profits, then politicians wouldn't be where they should be. McCoy agrees, saying that the complex relationship between the drug companies, the health care industry, and government is why a decent health care bill can't be passed through Congress. McCoy returns the money Austin donated to him, and tells him to grow a conscience. Or at least hand over Brenda's computer.Brenda's computer has been wiped clean of most of the needed information. Only her address book, her clock, and her calendar are left. However, Brenda had an appointment with a person who was not in her address book. J. Wigand. Jeffrey Wigand was the whistleblower who took on the tobacco industry for their misleading advertising. Maybe J. Wigand was a pseudonym for a meeting with the FDA, and Brenda was about to tell them everything about Lextenda. The FDA says that someone from Woodmoor was going to meet with them, but she never arrived for the meeting. Brenda never said which drug she was concerned about. But when the lawyers mention Lextenda, the FDA worker admits that they received a call from a doctor who was concerned about the drug. They can't give out the doctor's name due to the whistleblower laws, however, without a court order. But the worker admits that he's not surprised to see more than one person bringing up Lextenda. Whistleblowers can get a lot of money for their information.The court order for the doctor's name goes through and the FDA turns over someone named Dr. Sharon. Cutter wishes to talk to Sharon, and if they can get some more information about the drug from him, then maybe McCoy could talk to his \"friends\" at Woodmoor about Zach.Cutter and Rubirosa go to a mailbox store, which was the mailing address of Dr. Sharon. The counter person says that he hadn't seen Dr. Sharon in awhile, but that he had something sent to him via registered mail. He had to get Sharon's DEA number because the shipment contained medication. But when Rubirosa shows him a picture of Zach, the counter person identifies the man as Dr. Sharon.Rubirosa tells Zach and his attorney about the propofol sent to his PO box. The attorney says that this evidence is still circumstantial, but Zach decides to confess anyway. Zach wanted Brenda to be given a DWI so that it would taint her reputation as a whistleblower. Zach and Brenda were going to serve the evidence to the FDA together, but Brenda wanted to give all that reward money away. The money was something Zach sorely needed. He only thought she would get in a small car accident. He called her and learned that she had the kids in the car with her, so he called 911 to get her pulled over and off the streets.Cutter and Zach's attorney plea bargain: seven counts of depraved indifference murder, which would get 20 years to life in prison. Cutter still needs the evidence Brenda and Zach were going to hand over to the FDA. Though his attorney says that it's immaterial to the case at hand, Cutter mentions that they have to hand over the evidence or else there is no deal. Zach tells them where to find the flash drive with the data.Matt speaks to Cutter and Rubirosa about Zach's plea deal. Matt thinks that 20 years is fair. He says that his mother died last week, and his son is doing better. Matt wants to give Brenda's share of the whistleblower reward money to her sister and the family whose relatives died in the car Brenda crashed into. The rest of it should go to cancer research, as Brenda specified."},{"episode_title":"Boy Gone Astray","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/boy-gone-astray-1304890\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"A woman (Nina Wilshire) is found shot to death in her apartment, and Detectives Bernard and Lupo are called in to investigate. A neighbor called the police after she heard gunshots, and she also heard the fire alarm go off, which means that the killer might have exited through the fire escape. The detectives find that Nina has several expensive paintings in her apartment, and Lupo thinks that Nina might have been shot when she opened her door, judging from the wounds on her body.The detectives inform Nina's mother about her death, and they question whether Nina was involved in anything illegal like drug deals. Nina's mother doesn't think so, since she owned her own interior design business. Her mother then shows the detectives photos of her daughter, which both Bernard and Lupo figure out is a waste of time.Later, they speak to Van Buren about having to look at photos for two hours and not getting anywhere with the case. Ballistics have figured out that two different guns were used, so they know that there were two killers. They go over the security camera surveillance video and watch as Nina goes to the front door and struggles with someone. There may be a print from when the stranger hit his hand on the glass door. They ID the print as belonging to Dr. Lucas Nevra, who is a chiropractor and whose office Nina was scheduled to decorate. He says he did talk to Nina but she canceled three appointments they had after he gave her $5000 to keep her on retainer. Nevra adds that the $5000 wasn't that big of a deal, but he seemed really upset on the video.The detectives find that Nina barely had any banking accounts, just a single account for $10,000 which was never touched. Perhaps those expensive paintings were her way of laundering cash.Meanwhile, Van Buren is having dinner with her son - home visiting - and her boyfriend, Frank. Van Buren has no appetite because of the chemo and her son offers her some medicinal marijuana he got from a nurse in the cancer ward. However, medicinal marijuana is still illegal in New York, so Van Buren is upset by the offer. Later Frank says that her son only wanted to help and that he didn't fall in love with a stupid woman. The marijuana would help her a lot if she took it. He leaves her alone with the bag.Lupo and Bernard go to the gallery Nina used to procure the paintings. The woman at the gallery explains that Nina had another apartment in the same building which she could have used for storing paintings. They search the apartment and find paintings, a lot of money, and marijuana. The DEA had been tailing Dr. Nerva for some time. He was a dealer and the DEA was trying to track down the name of his supplier. Lucas made to Nina right before she was shot. Lucas mentions something about getting ten grand to her, and Nina says that there's a kid at the door who needs help. Therefore, the killers might have used the kids as a ruse to get her to the door so that they could shoot her. But as the video shows, the kids weren't just a distraction, they were the killers.A man who runs a fruit stand near Nina's apartment building says that he remembers the kids were playing soccer nearby. They didn't go into a car after they left, but there was a limo double-parked in the loading zone. The limo belongs to Riverdale Limo. The driver was waiting for three hours, and his dashboard camera caught a view of the kids as they climbed into a car, a Maserati. Bernard rattles off a lot of detailed info about the make and model of the car, and when the other detectives look at him in surprise, he explains that in Compton, he picked up a lot of info about expensive cars from the guys who stole them. They try to track down the Maseratis in the area, and then the Chief of Detectives starts to talk to Van Buren alone. He mentions that she smells of marijuana smoke, but when Van Buren tries to explain, the Chief says to save it and gives her some advice on how to mask the fact that she's smoking pot. He also gives her the name of a man who sells medicinal marijuana. The Chief explains that he had testicular cancer and is offering some sound advice.At the car dealers, the detectives find out that the Maserati was sold to a guy named \"Joe\", who paid in cash. They get the salesman to help with a sketch of the man's face, and the salesman also explains that he got a message from the guy a couple of weeks back because he needed a mechanic. The detectives get the address that \"Joe\" gave to the salesman. Lupo and Bernard go to the address, where a car of girls pulls up. The detectives try to find out if they can bring the driver of the car in for anything.The woman, Vasquez, is wondering why she was brought in for a traffic violation. The detectives try to pressure her with questions about her drug possession, but she asks for a lawyer. Later, Bernard, Van Buren and Rubirosa talk about the girls. The hundred dollar bills in Vasquez's purse all tested positive for cocaine residue. If she's a prostitute, then she was hired by the owner of the house, which leads the detectives to suspect that there's drugs in the house.There's a police raid on the house and the kids living inside are taken in. They find a gun on one of the couches, but when they ask the kids about \"Joe\", the kids all deny ever knowing a \"Joe\" and that this was their house. Lupo counters that if this is their house, then these are their guns, and arrests them.The three boys, Raphael, Samuel, and Carlos are in court and being arraigned for second degree murder. At first, a woman lawyer from legal aid says she is representing all three boys. Rubirosa says that she has no objection to all three boys having joint representation, but a new lawyer (Marcus Woll) comes in, saying that he's been hired by the families of the boys. Rubirosa recognizes Woll, and she knows that he's not the type of lawyer to work pro bono; someone must have retained him. When pressed for this info, however, Woll says it's not relevant to the case. These three juveniles had no criminal records. Woll also tells Rubirosa that there is a motion in court to suppress all evidence found in the house.Rubirosa tells Cutter and McCoy that the guns found in the house are linked to the murders of drug deals in Philadelphia and Newark. The DEA says that these dealers were put on a hit list by a Mexican drug cartel, the Vella family. The kids were trained as assassins and retained in the house to go and kill as needed. But there's little proof which says why Nina was killed, since she didn't have that much power. Cutter wonders if they could get one of the kids to crack and tell them who Joe is, which could be the key to their case.The lawyers say that since Vasquez is a known prostitute, then she was in the house to offer its occupants sex, and that since there was cocaine residue found in the money she received as payment, then there was cause to believe that there was drugs in that house. Woll counters that cocaine residue is found on 90% of all currency in circulation. The judge agrees with Woll and refuses to take evidence from anything found in the house. Woll wants to dismiss all charges against the kids, but since Raphael and Samuel are easily seen in the surveillance video, Cutter objects. The judge agrees with Cutter, but dismisses the charges against the other kid, Carlos. Rubirosa suggests that they should start talking to Raphael's parents.The lawyers are in the parents' home, and they inform them that their son was trained as an assassin in Mexico. Mrs. Alvarez doesn't want to say much, but Rubirosa gets her to open up a little by talking about birria, the dish Mrs. Alvarez is cooking. Raphael didn't seem too upset about that girl, laughing about her. And he also sang a song about having no fear. Mrs. Alvarez is still reluctant to talk to them, but Mr. Alvarez was a little more open. Cutter wonders why Raphael was singing about the crime, but then they figure out why the stereo in Nina's apartment was hiked up to full volume.The detectives and the lawyers are listening to a Hispanic song which was on Nina's iPod and as well as in the house the kids were staying in, about the exploits of a Mexican drug cartel. Drug ballads are apparently fairly popular in Mexico and Latin America, where the songs are about various crimes the families have committed. The cartels are somewhat seen like folk heroes. McCoy says that Nina was killed by the Vella family because she was featured in a song about a rival cartel. Rubirosa hopes that an old boyfriend may be able to identify the other cartel.He says that the song is about the Ramon family, who are so cowardly and weak that they use a woman to do all their work for them. But now she's dead, with 4 gunshots to the face. This detail was not released to the public, so whomever wrote that song either did the killing themselves or knew about it. The name of the group is Los Guereros, which is the band for the Vella. The song was uploaded onto the internet the very night Nina was shot. And the band is about to hold a concert in New Jersey. Rubirosa, Lupo, and Bernard go to the club, only to find that the band has been shot dead.They found the lyrics in a knapsack in the tour van, but the handwriting on the paper is different than for the other songs. They hope to be able to get some fingerprints from the paper. The prints are from a man named Eddie Blanco, who is fairly high up in the Vella family. Eddie's picture matches with the sketch of \"Joe\" which the salesman described earlier. They arrest Eddie, who immediately demands that he talk to his lawyer, Marcus Woll. Rubirosa wonders whether Woll would be able to represent both Eddie and the kids, but since Raphael is a minor, it's really up to his parents to choose who gets to represent him. Cutter tells the Alvarezs that Woll doesn't care anything about the kids, and would probably decide on just representing Eddie. Woll argues that Raphael is emancipated from his parents, so he should be able to choose who represents him. However, Cutter argues that then Woll would be representing all three defendants in the case. The judge rules in favor of Cutter and asks that a court-appointed lawyer be brought in for Raphael.Raphael, however, wants no part in the planning of his case. Rubirosa goes to Dr. Burkhart for advice on house to deal with the boy, who has pretty much been brainwashed into loyalty to the Vella drug cartel. Burkhart tells her that sometimes a breakthrough can be triggered by a very small detail of the person's past. Later, Rubirosa is with Raphael and his lawyer, when Rubirosa suggests that they have lunch. The lunch she takes out is birria, made by Raphael's mom. She offers a plate to Raphael and he eats, and soon starts to cry.Later Raphael takes the stand, giving testimony about being taken to Mexico and trained as an assassin for the drug cartel. He says that Eddie was the person who gave them their missions and he told them to go and kill Nina. He confesses that he did the killing, but never felt anything about it afterwards. The grand jury indicts Eddie Blanco, but McCoy mentions that they've found a song on the Internet which threatens Rubirosa. So she and Cutter have to be guarded at all times.Lupo, in court, identifies the two boys who were on the videotape. Cutter brings Raphael as the next witness, but Woll counters that the boy shouldn't be brought in as a witness because he is a minor, and also has been under a coercive environment for the past two weeks and could be influenced by psychological manipulation. Cutter explains that he was in mandatory therapy, but the judge sides with Woll. Woll is given 24 hours and court is adjourned. Cutter says that the defense is stalling for time, and they should make sure Raphael has extra guards on him. Blanco and Raphael exchange glances, with the boy becoming very anxious in the older man's presence.Rubirosa panics after she walks out of her place the next morning to discover that her security detail was not there. She's called to the juvinile detention facility. Samuel's throat was cut open and he bled to death before anyone could find him. Cutter talks to Raphael and tries to assure him that he won't meet Samuel's fate. But Raphael doesn't believe them.Back at court, the judge denies Woll's motion to keep Raphael off the stand as a witness, but Cutter wants to give Raphael time to compose himself after the death of Samuel. Woll says that this shouldn't matter, because the argument doesn't change because of the death. The judge agrees and gives Cutter two hours to bring Raphael to the stand. Cutter and Rubirosa go talk to Raphael in his cell, who seems to have completely shut himself off. They talk to him, but he doesn't answer. He just keeps bouncing a ball on the wall."},{"episode_title":"Human Flesh Search Engine","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/human-flesh-search-engine-1304371\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Dignity","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/dignity-1302207\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"A doctor who performs abortions is killed while attending a church service, though it seems as if no one saw the actual culprit. Lupo and Bernard are put on the case. First, they speak to the doctor's wife, who says that she pleaded with her husband to stop performing abortions but that he claimed he was doing God's work anyway. Later, at the women's clinic, they speak to a security guard who is marking off tires with chalk. He says that since the right-to-life protestors keep taking up their parking spots, he has to enforce the two hour limit on cars. A nurse at the clinic worries that with the doctor dead, they might have to close down. The detectives note a list of messages from a man named Jonah Leland, who seemed very upset about something. His girlfriend was going to come in for an appointment tomorrow.Meanwhile Van Buren receives the bad news that her chemotherapy isn't helping to shrink her tumor. She can take other, stronger drugs, but the side effects would be worse than what she's experiencing now. Van Buren decides to go through with the stronger chemo.Leland tells the detectives that he never called Benning's office because that would have made his girlfriend angry. The baby has a genetic disorder but he doesn't have insurance to cover the medical care the baby would need once he was born. He and his girlfriend Blair broke up, and she said she was going to have the abortion because she couldn't take care of the baby. Afterwards, Lupo and Bernard argue their sides of the abortion debate. Bernard reveals that he was born premature because his mother threw herself down a flight of stairs in an attempt to get rid of her baby.Blair says that her baby would have a genetic skin disorder which would cause the skin to tear at the slightest touch. That would mean that he would need 24 hour medical care, and she can't afford that. Her father has told her that he'd somehow work multiple jobs to get the money to help the baby. The detectives look at Blair's father's car and note that the tire has a chalk mark on it, like the rest of the cars at the clinic.Her father (Kevin) is brought in for questioning and he denies killing the doctor. He says that one of the protesters followed him to his car thinking he was a doctor, but he set him straight, saying that he was there to prevent an abortion, not cause one. The man told him that his grandson will be fine. Kevin is then shown videotape taken outside the clinic, in an effort to ID the man.Mission for Life claims that this man is not a part of their organization. He did brag that he got arrested for breaking into a nuclear power plant, and that his name was Wayne. The detectives locate Wayne's ex-wife and their son Will. She claims that she has no idea where Wayne is but agrees to get in touch with him by claiming that their son has been hurt.Bernard and Lupo are undercover at the hospital as they wait for Wayne to show, but instead they encounter attorney Roger Jenkins, who is there as Wayne's official representation. The detectives wonder who tipped Wayne off to the sting, and then Will confesses that he told his dad about the cops at the hospital. Wayne's girlfriend lives out in the middle of nowhere, and she claims to have not seen him for over a year. She enters her home with the detectives, and they stumble upon Wayne in the middle of trying to escape. Bernard chases him down.Jenkins requests for 10 years for manslaughter for Wayne, claiming that he was seduced by the right-to-lifers' message. Cutter says no to the deal. Wayne admits to killing the doctor because all those innocent babies had to be saved. Jenkins argues that Wayne's impetus was in defense of a single baby, Blair's. The disorder the baby would have is survivable. Therefore, Wayne wished to protect that life.Cutter, Rubirosa and McCoy discuss the case in McCoy's office, and they realize they're in for an uphill battle. It's difficult not to get swept up in the legalities of the abortion debate even when they're trying to focus on the murder of the doctor. The defense pivots on the assumption that Wayne knew about Blair's abortion, so the lawyers would need to prove that Wayne was going to kill the doctor even before he'd learned about Blair.Rubirosa talks to a nurse at the clinic, who says that Wayne was bothering them more than the other protesters but that he didn't make any specific threats. It's hard to keep a job at the clinic, and one nurse had already left for a position in a neonatal ICU. Rubirosa then speaks to the nurse who quit. She claims that a woman came into the clinic pregnant with a fetus which would develop encephalitis. Her fetus's brain wasn't developing normally. When they went through with the abortion, there were complications and the baby was born alive. The doctor asked the woman whether she still wanted to go through with the abortion, and after she said yes, the doctor stabbed the baby at the base of the neck with a pair of scissors. The nurse could not work at the clinic again after she witnessed that. Rubirosa gets the name of the patient. Later, Rubirosa goes to visit the woman, but the woman is extremely upset and refuses to speak about the incident.Rubirosa tells McCoy and Cutter about the incident and says that this went against the rules for late-term abortions in New York. They'd have to report it to the DA. McCoy counters that the doctor is already dead, so they should wait until after the trial. Rubirosa thinks that this is information they'd have to tell the defense, but Cutter says that Wayne didn't know about what happened to that baby. And Jenkins would only exploit the information. So it would be best if they never heard about this piece of evidence.Kevin is on the stand at the trial, telling about how he tried to talk to the doctor to plead with him about not giving his daughter the abortion, but he couldn't get past the protesters. Wayne talked to him about Blair's situation and told him that his grandson would be okay. Cutter brings in a doctor who claims that the disorder Blair's child would have would mean a lifetime of suffering, and the responsible thing to do was to perform the abortion and avoid all the pain. That child would be living without dignity. However, Jenkins draws out the doctor's bias against pro-lifers, which causes the prosecution team to worry a little.Jenkins brings in a woman who's child was diagnosed with a genetic disorder but she opted not to have an abortion. She carried the baby to term, even knowing that her child would die, but she wanted the baby to die with dignity. Her child only survived 21 hours after birth. Cutter manages to get her to agree that not all women are as strong as her, and that doctors who do late-term abortions are still giving a service that is medically essential to many women. Cutter claims that Roe v. Wade was passed in an era where science hadn't yet caught up with people who didn't wish to become pregnant. Now that there are many more options with contraception and medical science can treat more genetic defects. He argues that Roe v. Wade should be reexamined. The prosecution finds out that Jenkins knows about the woman with the botched abortion and the nurse who quit the clinic because of it. McCoy wonders if Cutter tipped off Jenkins, though Cutter denies it. Rubirosa admits that she told the defense about the botched abortion, thinking it would be a violation of ethics if the other side wasn't informed. The nurse is on the stand and she explains in detail what happened when the baby was delivered. The jury is horrified. Cutter gets the confirmation that it was Jane Doe's decision to terminate the baby, even when the baby was born viable. The nurse also says that the baby would have only survived a couple of days after birth.Closing arguments consist of Jenkins showing the jury a picture of Blair's newborn baby. Cutter counters that he could have shown the pictures which were in the doctor's wallet, stained with blood, but he won't. The jury needs to ponder the mysteries of when life begins. Everyone should agree that all life is sacred and that they should consider that when pondering what Wayne did. The jury finds the defendant guilty of murder.Later, McCoy tells Cutter that Rubirosa asked to be transferred to the white collar crime division. McCoy doesn't really want her to leave, but Rubirosa claims that this is what she really wants. However, McCoy doesn't want to have to find a second chair for Cutter, so that means that the two of them will have to work out their differences."},{"episode_title":"Reality Bites","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/reality-bites-1299798\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"Larry Johnson, the father to ten adopted special needs children, tells his kids to stay in their van as he enters their house to fetch their mom. But instead, he finds Joy's lifeless body on the floor.Bernard and Lupo are called in to investigate. Joy was killed by blunt trauma force to her head, and the murder weapon could be a Special Olympics trophy. Larry explains that he was out to pick up the kids from day care. The Johnsons started adopting once they figured out that they couldn't get pregnant, and they now have ten children in their care. A Hispanic woman was spotted leaving the house before Joy's death.The Johnsons' oldest son, Tim, who's autistic was sent home early from school and spotted his mom on the floor. Blood got on his hands when he tried to check whether his mom was still alive. Tim is taken in for questioning. He claims to have not called the police first because on television, the suspect is always someone who is found close to the body. Bernard points out that not calling the police could also be a clue that the person is guilty, and Tim says that he'd hadn't thought of that.As they watch the interrogation, Van Buren speaks with Larry, and Larry points out that Tim wants to be a detective when he grows up. Tim would not suddenly snap and become violent. Tim explains that he left school earlier because he was being bullied. The detectives press on with Tim, wondering how he got into the house, and he says that he has a key. The questioning becomes a little too severe and then Tim confesses that he killed his mom. Van Buren then tries to talk with Tim, who eventually says that a boy from school (DJ Lovell) stole his fanny pack, and his house key was in that bag. DJ already has a record for theft and petty assault.Lupo and Bernard go talk to the Lovells, and DJ eventually says that he just threw the pack into the trash. DJ's mom mentions that she was over at the Johnsons' home earlier, and she saw Joy arguing with someone over the phone. Bernard has pulled the Johnsons' phone records and there were three calls on the day of Joy's death: from the school, from the Fraternal Order of Police, and from a woman named Belinda Alvarez, who might be the Hispanic woman the neighbor saw leaving earlier.Belinda has ten kids too, septuplets and three others. She seems very media-savvy and explains that she and the Johnsons were both vying for a spot on a reality show. Joy told her that she didn't want to do the show, and just about gave up the show for Belinda. That made her jump around happily, which was what the neighbor saw.The detectives return to the Johnson home to find that a reality TV crew has already started to film. They're asked to sign a release to be on the show, but they refuse to add their signatures to anything. Larry has apparently signed the contract to do the show. Joy was a hold-out, and as long as they were married, the reality TV company would have needed her signature on the contract in order to start the show. Now that Joy is dead, they only needed Larry's go-ahead. Larry claims that Joy wanted to do the show.Van Buren is busy taking a look at her insurance coverage, and worries that with the cost of chemo her lifetime cap will be reached in three months. So if she's cured in three months' time, then everything will be okay. Otherwise, she can give the detectives a really great deal on a used Toyota. The detectives go to speak to the producer of the show.The producer (Artie Cramer) says that he always knew Larry was willing to do the show, however Joy had misgivings. Larry was apparently holding out for more money. Larry is a real estate developer, so Lupo and Bernard go to his office, and they speak with his female accountant. Things have been slow at the company and a lot of staff have been laid off already. She and Larry have been going through the books, but she says that Larry wasn't in the office in the afternoon when Joy was murdered. Meanwhile, Larry's sister has flown in to help him with the kids.The detectives find out that Larry was having an affair with their nanny, Suzanne. Suzanne admits that Larry was at her apartment that day and stayed until it was time to pick up the kids. Bernard discovers that there is a man's shirt in the laundry hamper. Suzanne claims it's Larry's, and that he always changes clothes before leaving the apartment. The shirt has bloodstains on it.Larry explains that in the morning of Joy's death, one of the kids lashed out and cut Joy. That was probably where the blood came from. ADA Rubirosa and Van Buren go through the details of the case, but there's no hard evidence to convict Larry of the murder. Lupo mentions that Suzanne went through the kids' daily routine. When the kids come home from day care, they get out of the car immediately and run into the house. However, on the day of Joy's death, Larry told the kids to stay in the car while he went to get their mom. It looks as if Larry wanted to keep the kids from seeing their mom dead, which meant that he knew what had happened to her beforehand. Rubirosa thinks that this is enough proof to arrest him if they can corroborate the story with the kids.The detectives are back at the Johnsons, and they try to talk to the kids about that day, but they're having a hard time communicating. Tim comes in to help and the kids mention that their dad told them to stay in the car. This is confirmation enough and they end up arresting Larry while the reality show cameras are rolling.DA McCoy, EADA Cutter, and Rubirosa watch footage of Larry's arrest. Rubirosa admits that Children's Services will take the kids away from Larry if he can't make bail, so McCoy says to drop the bail to $100k, with the condition that Larry Johnson stop appearing on TV.Rubirosa is approached by the reality show producer, and they turn out to have gone to the same university. The producer suggests that they take the case to the court of public opinion. In exchange for Rubirosa appearing on the show and allowing them to tape footage of the trial, he offers tapes of interviews with Joy and Larry, with Joy expressing her misgivings about going on TV. Cutter and McCoy agree that getting the tapes would be beneficial to their case, and Rubirosa agrees to be on-camera.In court, Cutter explains that Larry's failed business dealings have made him desperate for cash. When he realized that Joy wouldn't agree to do the show, he snapped and killed her. Larry's defense lawyer argues that there is no evidence that Larry killed Joy. Belinda and DJ had motive and opportunity, and Tim actually did confess to the crime. So no one can prove who killed Joy.Rubirosa brings in the tapes of Joy showing her concern about being on camera all the time and what this will do to the children. McCoy says that she didn't actually say that she didn't want to do the show. But Rubirosa points out that there was a witness that Joy said that to.In court, Belinda is on the stand, and she repeats what she told the detectives. Joy told her that as far as she was concerned, Belinda could have the reality show all to herself. However, Larry's lawyer argues that Joy might have said it to make Belinda leave and that Belinda herself said that she would kill to be on the show, which is evidenced by a taped interview.Next on the stand is the producer, who admits that he doesn't think Belinda said that statement literally. He also says that he didn't think Joy seemed too eager to be on the show, and that he mainly dealt with Larry when it came to negotiating. He did tell Larry the day before Joy's death that the contract needed to be signed or else he'd take the show to someone else. The producer also says that Larry's accountant called him and \"he\" asked about payment. However, Rubirosa says that when the detectives spoke to Larry's accountant, it was a woman, not a man. Afterwards, Rubirosa tries to talk to the producer, who still has cameras on him.Later, Rubirosa says that the callback number the accountant gave the producer is actually a finance company which fronts for a loan shark named Sammy Shiner. Larry must have owed a lot of money, which was why Shiner was checking up on any cash coming Larry's way. If they can find Shiner and get him to testify, then they could convict Larry. If Larry says he didn't do it for the money and doesn't need it, they could bring Shiner in to rebut.Larry takes the stand, and he claims that he and Joy both agreed to do the show. On the day of her death, he says that the regular routine was broken up because Joy was tired and she went to take a nap, and Larry didn't want any of the kids to wake her up. He says point blank that he did not kill his wife.Cutter cross-examines Larry and brings up his affair, but everything else in the timeframe seems rock-solid. Larry stopped by to get coffee in between leaving his office, going to Suzanne's, and then going to pick up the kids. Once he says he didn't need the money, Cutter asks Rubirosa to get Shiner in as a material witness. However, Shiner appears to be out of the country at the moment. Wondering how the defense got tipped to their plan, Rubirosa realizes that she had her notepad open and exposed to the cameras the whole time. Anyone could have read her notes from the taped footage.Without the witness, Cutter goes through with bringing up Larry's arrangement with Shiner anyway, but Larry denies knowing the man and claims that his dealing with Uptown Finance was above the board and legitimate. Cutter mentions that sometimes Shiner's clients end up dead if they don't pay, which leads the defense to request that Shiner be brought in. The jury is deadlocked and the judge declares a mistrial.They're still in the middle of searching for Shiner when Cutter mentions to the rest of the attorneys that the production company switched up \"Larry Plus 10\" a little bit. Now Larry and his kids are moving in with Belinda and her kids in a large mansion, where they'll compete to win prizes. A human lie detector is also going to move in with them, so that maybe the public will find out the truth about who killed Joy. The audience will get to vote on whether Larry is guilty of the crime. And Cutter jokes that they asked Arthur Branch to be the judge."},{"episode_title":"Great Satan","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/great-satan-1299735\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Just A Girl In The World","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/just-a-girl-in-the-world-1296094\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"Daisy Chao, a CSI, is found dead on her kitchen room floor by her fiance, Jim. Lupo and Bernard are called in to investigate. Jim was out of town the weekend of the murder. He was at his parents' house but has no alibi since they weren't at home. It's discovered that Daisy's wallet is missing, and Jim states that Daisy had a gift card to Victoria's Secret as his wedding gift to her and one credit card.Meanwhile, Lt. Van Buren is at the doctor's to discuss her cervical cancer. It's stage 2, which usually can be treated with chemotherapy. She was infected from HPV, which is a sexually transmitted disease, and since it takes more than a month for the cancer to appear, it looks as if it was her ex's fault.A suspicious ATM withdrawal pops up on Daisy's account, happening when she was at work. When it seems that she was getting antsy about the wedding (and feared that her fiance was having an affair because she found a feminine hygiene wipe in the trash which wasn't hers), Jim is brought in for questioning. He says that Daisy told him to take the money, and the detectives are suspicious, thinking they have him. However, a similar attack has come up in the 4th precinct.The victim, Emma Kim, says that she barely escaped her attacker, who seemed to have the same MO as Daisy's murderer. Emma is also Asian, also was attacked by a knife, and was also in a livery right before she was attacked. Emma suspects that her attacker has a thing for Asian women. Lupo doesn't think that Emma is safe in her apartment since her attacker knows where she lives, and that she should stay at the precinct instead.The detectives search for the driver based on Emma's description of him and of the Tweety decal on the back of his car. The driver denies that Emma ever rode in his car. They impound the man's car based on a charge of unpaid traffic tickets. Later in interrogation, the driver still insists that he didn't do anything to Emma and requests a lawyer, but Daisy's blood has been found in his car. In a police line up, Emma (while holding Lupo's hand), identifies the driver as her attacker. Lupo then offers to accompany Emma home.Bernard calls Lupo on his growing infatuation with Emma, saying that his personal feelings will start to mess up the case. The suggestion comes true when, during the hearing, Marquez points out that Emma and Lupo were holding hands when she IDed the driver. This could have meant that Lupo sent a secret signal to her about which suspect to point out. The line up evidence is thrown out because it could have been tainted. Later, Lupo and Emma spend the evening together, but Lupo becomes suspicious when he finds a piece of Victoria's Secret lingerie in Emma's closet.Jim is back to being questioned, and it's discovered that he and Emma worked for the same magazine. Jim breaks down and says that Emma asked him for money for her kidney medications. He took money out of Daisy's account to pay for them. After he confronted Emma about the money and told her that she would have to repay him, Jim went to his parents' house to cool off. Emma told him that he shouldn't mention anything about the money, and that she would get the detectives from investigating further. Lupo suddenly realizes what Emma meant by that.The detectives debrief Van Buren and she says to bring Jim in for larceny and obstruction of justice. When she asks about the lingerie, Lupo says that it's still in Emma's closet. And when pushed about how he knew that it was there, he admits to seeing it in her closet. Van Buren calls him on getting too personal with a witness. Lupo is suspended, and he rushes back to Emma to tell her what happened. However, Lupo is also wired, and Bernard and Van Buren are listening in on the conversation. Lupo attempts to push Emma but she keeps insisting that she was never with Jim. Emma is taken in for obstruction of justice.Emma blames Jim for the whole thing, saying that he was completely infatuated with her, but she told him that she wouldn't want to sleep with him while he was still engaged. Then he offered to pay her medical bills instead. The only thing that links the livery driver to the crime is the sample of Daisy's blood in his car, but it turns out that one of the CSIs working the scene took a blood sample from Daisy in order to frame the driver. The wipe which Daisy found suggests that Jim wasn't being faithful to her. Testing the wipe is positive for Emma's DNA as well as Jim's. Also, the sample reveals that Emma doesn't have the kidney disease she claims to have.Emma has conned several men out of thousands of dollars by saying she has various diseases. Daisy had been trying to track down Emma after Jim took out all that money, which was motive enough for Emma to kill her. Later on the stand, Emma claims that Lupo was pressuring her to sleep with him. Cutter, however, brings in all the testimony from the other men she conned. Emma tries to say that the judge had offered his help, so that this would force a mistrial, but then Cutter points out that even if there was a mistrial, she might do the exact same thing over again. Emma then tries to turn on Cutter, but Cutter refuses to break. The jury finds her guilty, and even as she's being taken away, she starts up a conversation with one of the guards, while Lupo looks on from a distance."},{"episode_title":"Memo From The Dark Side","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/memo-from-the-dark-side-1296093\/recap","nth_season":20,"source":"http:\/\/www.tv.com","show":"original","corpus":"Greg argues with Megan as she decides to leave because she can't make her next tuition installment. Greg says he will help her but she declines.A police officer and Detective Kevin Bernard walk into the faculty parking lot and find a body. He took two shots in the chest and all he has on him is a wad of cash and dormitory key card. He appears to be a business major.They try to get video footage from the security card but the cameras are out of service. They slide the key card and the ID belongs to Hayley Koslow. They find Hayley and she tells them that Greg Tanner was crashing at her place. She said he wasn't a student but was mature and nice and had a sister at the university. She tells them he was in the military and got in a fight with a Hispanic guy a few nights before.They discover that the gun was fired at least three feet away. Lt. Anita Van Buren tells them that Megan, Greg's sister, is downstairs. They found out that the guy Greg was having a fight with is named Manny Lopez. Van Buren talks to Megan and she is very upset, saying that she saw Greg two days before when he offered to help her with her financial aid. He lived on campus because he had no where else to go. Their mother has Parkinson's disease and their father died when he was 10, which made him join the service to be like his dad. He had come back a different person, he was anxious all the time and was having trouble receiving army benefits. She explained that he had told her he would help her because he was \"into something big.\"They think that this \"something big\" could have been a drug deal and Manny, the competition, got angry, following him into the faculty garage. But they also find that he could have been meeting a client, a professor, Kevin Franklin, who broke his pattern of coming into the garage. That day he came in at 1:00pm and didn't leave until noon the next day.They find Kevin Franklin who explains that he wasn't in the garage that day and that Greg looked vaguely familiar. He didn't take his car out because after he got out of his last class he went to the book store but by the time he got to the garage, the police had sealed it off, forcing him to take a cab and the metro home.They go to the bookstore and find out that the bookstore is always dead after dinner time and that Franklin had been arrested last year on a CPW.They look into it and find that Franklin was in a fender bender and pulled a weapon, only to find out that he had a permit for it in New York, it was a .22 caliber, same kind of gun that killed Tanner.Lupo goes to ADA Connie Rubirosa and tells her that Franklin's alibi doesn't make sense and that Tanner could have been performing blackmail using the pot that was found in his pocket. If that was found on Franklin, he would lose his teaching job and his law credentials. Rubirosa doesn't seem to think it all matches up and tells him to call her when they have some PC. Van Buren says they need to find ties between Tanner and Franklin, evidence that they had it out for each other.They go back to Hayley's and find a number of law books that belonged to Greg and a folder with Franklin's course syllabus in it and a recorder with Tanner asking Franklin about the Veterans Administration but Franklin doesn't want to talk.Lupo goes to Linden V.A. Hospital and finds that Tanner had received counseling for 30 days and then was discharged due to his benefits lapsing. He had been discharged from Abu Ghraib for having a pre-existing personality disorder and it was keeping him up at night. They go back to 2-7 and decide that Tanner was putting together a case to sue the Veteran's Administration and wanted Franklin to represent him.Van Buren comes in to announce that she was diagnosed with cancer and will be coming and going more than usual but she knows that everyone can put up with it. They report what they have found and she tells them to talk to Franklin's colleagues. Everyone is surprised at her announcement.They go to see Michael Gendel who tells them that Franklin probably wasn't involved and that he is up for tenure and is very competitive. There are some papers from the Bush administration that had just become declassified that Franklin contributed to.They go through declassified documents to find that Franklin wrote up the working conditions for guards like Tanner at Abu Ghraib and Gitmo and thinks Tanner may have blamed him, wanting money from him to make up for his post-traumatic stress. They find this as probable cause.Lupo and Bernard head to the DA's office for the warrant but they find that Franklin is already there, having confessed to Tanner's shooting. He had a stalker and saw him in the hallway in the parking garage and was saying that it was self-defense. Granick, Franklin's attorney, is surprised they want a plea, telling them that he shot a trained killer who blamed him for his mental problems, demanded money, and threatened him when he said no. Franklin hands over a prohibition, stating that they can't repeat anything that he said in the interview with the police.DA Jack Mc Coy goes over the paperwork and finds that self-defense is Franklin's only excuse. They receive a motion from Franklin addressing his write to address to Grand Jury. Franklin is trying to make himself look as good and innocent as possible. They decide they have got to make Tanner look as cute and cuddly as a week-old puppy.Megan testifies in court, saying that Greg was likable and suffered from PTSD. Franklin testifies about Tanner wanting help from Franklin because he was involved with the Bush Administration. He explains that Tanner had demanded money and when he followed him into the garage, Franklin got scared for his life and shot Tanner. He had been in such shock that he couldn't approach the police until 4 days after the shooting.They are questioning Megan's testimony because at first she said that Greg never spoke about his experiences. Megan explains that she had found a video diary that he had created on his computer. They watch it and look more into the memo that Franklin helped write for the Bush administration and decide that they must prosecute for allowing the torture of inmates by soldiers. They meet with the judge regarding conspiracy and she denies the motion. And they need co-conspirators.Mc Coy asks Cutter to read the entirety of Franklin's memo and to find his advice to anyone charged with torture.Cutter connects the dots with Franklin's memo. A goverment attorney comes into Mc Coy's office and threatens him, placing multiple books on the table that will help their case, warning him that they can keep making more and more if he wants to continue.Mc Coy decides to center in on Franklin, if they can prove that he broke the law, then they can start moving up the chain of command. Cutter complains, saying they may have gotten in too deep but Mc Coy won't stand down, saying these people are getting away with so many things during the war and it needs to stop. In the court room, Cutter goes over Franklin's memo, talking about how torture tactics don't work.David, a man from the attorney general's office, approaches Mc Coy trying to call the whole case off. Mc Coy shoots him down, telling him that they will not stop the case.Franklin is on the stand, telling them that he was asked to provide research and compile a memo regarding the success rate of torture. He states that many of the US Amendments do not apply on foreign soil. Cutter interrogates him and his stance on foreign torture.Jack goes into Cutter's office and hears that a state senator has requested that McCoy be removed as DA. McCoy says they are wanted in Federal Court tomorrow.McCoy goes to court and David is trying to call off the case stating that state law has no place in a federal case. The judge decides to look over the motion and in the meantime, the case can continue.Back in the courtroom, they are saying that Franklin didn't commit torture, he only wrote about it, therefore not committing a crime.Cutter retorts by saying that he wrote instructions on how to perform the crime and that these people were written in as a special class of prisoners that needed this kind of attention. Back in Supreme Court, the verdict arrives but a federal marshal arrives with an order from the district court. They have to stop the case. McCoy is still wanted out but he isn't worried, he is happy with the stab they took at this one."}]}