{"episode_recaps":[{"episode_title":"Benevolence","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/benevolence-9526\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Manhood","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/manhood-9525\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Securitate","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/securitate-9524\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Virus","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/virus-33799\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Animal Instinct","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/animal-instinct-9522\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Conduct Unbecoming","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/conduct-unbecoming-9521\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Jurisdiction","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/jurisdiction-9520\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Mother Love","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/mother-love-9519\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Promises to Keep","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/promises-to-keep-9518\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Night and Fog","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/night-and-fog-9517\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Right to Counsel","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/right-to-counsel-9516\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Extended Family","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/extended-family-9515\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Consultation","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/consultation-9514\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Point of View","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/point-of-view-9513\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Prince of Darkness","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/prince-of-darkness-9512\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Self Defense","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/self-defense-9511\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Helpless","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/helpless-9510\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Wedded Bliss","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/wedded-bliss-9509\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"The Corporate Veil","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/the-corporate-veil-9508\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":"A teenager named Roberto Martinez has a heart attack when his pacemaker fails. His mother shows up at the precinct with her attorney asking for criminal charges to be filed against the manufacturer of his pacemaker. Cragen resists at first, but when Mrs. Martinez's attorney says that the surgery was unnecessary, he agrees to investigate.Logan and Cerreta go speak to Dr. Trevor Hellems, who denies the surgery was unnecessary. He defends his actions, saying that the surgery was necessary and that pacemakers usually do not fail, especially ones from BioNorm Industries, the manufacturer of Roberto's pacemaker.After speaking to several specialists who also defend Dr. Hellems's actions, Cerreta and Logan pay a visit to Mrs. Martinez. When they tell her that they don't believe anything illegal occurred, she informs them that BioNorm Industries offered her $50,000 as a settlement. They told her she would have to sign a statement in which she agreed not to say anything about the matter.The detectives talk to Mr. Cleary from BioNorm industries, who denies there was a problem with the pacemaker. He says he only offered her the money to try to eliminate the cost of a trial. However, something he says makes Cerreta and Logan think that he might have been sued before. Paul Robinette checks it out for them, but they can't find any court records. Paul advises them to check with the FDA to see if there are any complaints. Ms. Kenny at the FDA says there have been 6 reports of failed pacemakers from BioNorm, but the doctors never followed up on the reports. The detectives get the doctors' names and numbers from her.The first doctor they talk to admits that he didn't follow up on his complaint because the victim's wife needed the money. They talk to the other doctors and find similar situations, so Cragen tells them they have 24 hours to find out what Cleary's hiding.Logan and Cerreta go back to Cleary's office and question him again, this time with Cleary's son present. They tell the detectives that they compared the serial numbers listed on the lawsuit documents with their records and found that the pacemaker inside Roberto Martinez was actually sold to Dr. Evelyn Stark to be implanted in her patient, Ethel Barnet. Cleary said he already spoke to Dr. Stark, but she had already spoken to a lawyer and had no comment. When the detectives arrive at her office, Dr. Stark is uncooperative, but she does tell them that Ethel Barnet got a new pacemaker, and the old one was donated to Manhattan Med. Stark says that the pacemaker had a life of 5 years, and Mrs. Barnet used it for three years.At Manhattan Med, a man admits to having sold some pacemakers on the side to a man named Jeff Suiter. The detectives go see Jeff Suiter, who says that he always told his buyers when they were getting secondhand goods because it was illegal not to. Paul confirms that as long as the patient knew the supplies were used, it was legal. The detectives question Mrs. Martinez again and she insists she would never have purchased a used pacemaker. They then return to Dr. Hellems's office, and he admits that he knew it was used, but he didn't tell Mrs. Martinez because he knew she was poor and did not have insurance. He says there is no reason the pacemaker should have failed, because it has a life of five years, and the battery expiration date was three years away. Logan and Cerreta realize that the battery must have been changed because Dr. Stark said the pacemaker only had 2 years left before it expired. Cleary's son confirms that the model that Roberto had implanted expired months before his death, so the detectives arrest Suiter. Ms. Kenny from the FDA shows up and says that the leads - the wires that connect to the heart - on the pacemaker were corroded and that was the cause of the malfunction, not a battery failure. The judge dismisses the charges.Adam, Paul, and Ben discuss the problem and decide to revisit the other six cases that BioNorm settled to see if the wires in those pacemakers were also corroded. Paul visits a young woman who received a $250,000 settlement from BioNorm when her father's pacemaker failed, but she won't talk about it because she does not want to lose the money. After speaking to the other families, Paul meets with Ben and tells him all of the pacemakers were purchased around the same time. He goes back and speaks to Cleary's son, who tells him they bought the leads from a company called Asian Pacific Trading, operated by a man named Ziesel. Paul checked him out but he disappeared a few years before. Paul visits another company that bought leads from Asian Pacific Trading. The man he speaks to tells him that Ziesel was a crook who took him for $50,000. Ziesel sold him leads manufactured in Singapore at a company called CJL Electronics. When the leads arrived, the vast majority of them were corroded. The man tells Paul he got rid of all of them because he couldn't be sure any of them, even the ones that appeared to be okay, were safe. Paul finds five companies that purchased the damaged leads. BioNorm was the only one who used any of them. Adam calls it depraved indifference to human life and tells Ben and Paul to go after BioNorm. Ben tells him it's more complicated than that because they're not sure who authorized the use of the damaged leads. They believe it to be Cleary's son, Steven, who was the one in charge of checking the leads on the assembly line. However, he was not considered a high managerial agent at the time, so the law says they cannot go after the corporation. They decide to indict Steven Cleary on murder two.At the trial, Ms. Kenny and a man from one of the other medical supply companies testify about the bad leads. Mr. and Mrs. Cleary testify that they were not in charge of inspecting the leads. Then Steven takes the stand and expresses remorse for the wire that made it through his inspection and killed Roberto Martinez. Ben tries to introduce the other six failed pacemakers, but Steven Cleary's attorney objects and the judge says it is too prejudicial.While talking over the case with Adam and Ben, Paul remembers that Cleary told him that his father went to City College, but at trial talked about his parents contributing to the MIT Alumni Fund. Realizing that Mrs. Cleary must also have gone to MIT, they bring in Steven Cleary and his attorney for a meeting. They threaten to go after the entire corporation unless Steven testifies against his mother. He refuses, but he says he will testify against his father in exchange for a deal for his mother and himself.Steven Cleary tells Ben and Paul that he and his mother spent days sorting out the faulty wires. When the first person died, they begged Mr. Cleary to recall all of the pacemakers with wires from Asian Pacific Trading, but Mr. Cleary refused. Mrs. Cleary backs up Steven's testimony, and Mr. Cleary ends up taking most of the rap."},{"episode_title":"Forgiveness","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/forgiveness-9507\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":"A woman named Beth Milgram is found murdered in the street. She was beaten over the head with a steel pipe. The nature of the crime leads Logan and Cerreta to believe the victim knew the killer. Logan and Cerreta find polaroids of her and her friends near her body, so they ask the girls to come in. The girls tell the detectives that no one would have wanted to hurt Beth. The girls also say that Beth's parents were coming into the city to take her to the airport for a flight to Italy.The detectives go to Beth's dorm room where they talk to her parents. They tell the detectives about Beth's boyfriend Tommy, so Logan and Cerreta head over to his dorm room. Tommy isn't there, but they talk to his roommate Bill Lynch. Lynch accuses them of going after Tommy because he's poor and Mexican, to which Cerreta replies that they didn't know either of those things. Lynch says he doesn't know when Tommy got back the night before, but that it was \"some time after Letterman\". Logan and Cerreta find Tommy working at a homeless shelter. He tells them that Beth's father hit her when he found out that she and Tommy were engaged. He didn't approve of their relationship because of Tommy's ethnicity. When Cerreta asks Tommy where he was the night before, he says he was at the shelter until one o'clock and advises them to check with Father Gregory at the church.Father Gregory says that he fell asleep before Tommy left, so he doesn't really know how late Tommy was there. The detectives are suspicious of Father Gregory's story. They go to forensics to see what information they have there. Forensics finds black polyester fibers snagged on the pipe. They also find Tommy's fingerprint on the outside of the envelope that Beth's pictures were in. Unfortunately, they have no way of knowing if Beth had the envelope before she went to see her friends or after.The Nassau police send over a file regarding Beth and her father. They had a fight in the front yard of her parents' house four months earlier. Beth's father gave her a bloody lip. Cragen tells them that Mr. Milgram is pressuring him to get Beth's dorm room unsealed so he can pack up her stuff and go home. Although Cerreta is skeptical of the theory that Milgram killed his daughter, he and Mike head over to the room to check it out.In Beth's room, Logan recalls that when they gave the parents the news about death, her father was sitting at her desk going through her papers. He finds a life insurance policy in the amount of $250,000 with her father listed as the sole beneficiary.When they question him, Milgram gets mad and asks them to leave. They go speak to his wife, but when they ask to look around, she tells them to talk to her husband. Back at the precinct, Logan and Cerreta are talking to Cragen when Mr. Milgram and his attorney storm in. Milgram tells them that he was 80 miles away from where his daughter was killed the night of her death, and he has a speeding ticket to prove it. Cragen asks them if they have anything else to go on, and they remember another girl who was at the party, Celeste. Celeste tells them that the day of the party, Beth told Tommy he should see other girls. Tommy called Celeste later and told her that he couldn't live without Beth.The detectives go back to talk to Tommy again. Tommy again says he was at the shelter until one in the morning, so the detectives go talk to the people staying there. One of the men tells them that Tommy was there all night. He says he knows because around three or four in the morning, he got up to go to the bathroom, and he saw Tommy going into the confessional with Father Gregory. Father Gregory tells Cerreta and Logan that he can't tell them what Tommy said or what time he was there. When they come out of the building, Cerreta tells Mike he thinks that Father Gregory winked to try to tell them something without actually breaking his vows. They manage to get a warrant to search Tommy's room, where they find a bag with fibers that match the fibers found on the pipe. Logan calls Cragen to let him know they're about to go arrest Tommy, but Tommy is already there, along with Father Gregory. Tommy confesses to the murder, saying he couldn't stand for Beth to leave him. Father Gregory speaks to Ben on Tommy's behalf, asking for a minimal sentence so that Tommy can commit himself to the church when he gets out of prison. Adam tells Ben and Paul that unless they can prove the murder was premeditated, they should offer Tommy a plea. Otherwise, the jury will feel sorry for him, and they will never convict on murder. Mr. Milgram comes to see Ben and asks him to offer Tommy a plea. He says that Tommy once fooled him, and he will fool the jury too. Ben has to interrupt him to stop him from making a threat against Tommy. Ben soon hears from Tommy's attorney, Cyrus Weaver, who is trying to get the bag with the matching fibers and Tommy's confession thrown out. Ben manages to keep the confession, but the judge rules the bag inadmissible as evidence. Without the bag, there is no evidence of premeditation and not enough for a murder two conviction. Weaver tells Ben and Paul that he is going to plead not guilty by reason of mental defect or diminshed capacity and because there is no manslaughter charge, Tommy will walk. They go to trial anyway, and Weaver tries to prove Tommy's insanity defense is valid. Dr. Olivet holds up well on the stand, but Ben and Adam are nervous. Paul comes to the rescue by finding out where Tommy got the pipe. An order for plumbing work was called in at the shelter where Tommy worked four days before Beth's murder. They get a search warrant and pull apart the walls at the shelter, where they find pipe matching the pipe used to kill Beth.At trial, however, Weaver makes it clear that the pipe could have been picked up anywhere and did not necessarily come from the shelter. He then puts his psychiatrist on the stand who says that it is probable that Tommy was not aware of the consequences of killing Beth at the time of the murder.Tommy takes the stand and talks about his mother dying in the heat while rich people were partying in a house not far off. Weaver is clearly trying to evoke sympathy for the life that Tommy came from.Weaver approaches Paul afterwards and tells him that he is willing to talk about a deal because neither side has a decisive edge in the matter. Ben decides to offer a deal because he is unsure of the outcome of the trial, but he wants to make sure Tommy is punished. Tommy, however, refuses to accept the deal, saying he'd rather take his chances with the jury.In closing statements, Ben demonstrates the six blows that Tommy applied to Beth's head in killing her. The jury convicts him of murder.The episode ends with Schiff talking about the guilt that everyone feels about people like Tommy and then getting into a hired car outside the courthouse and saying, \"The state pays for it.\""},{"episode_title":"Conspiracy","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/conspiracy-9506\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":"The charismatic leader of group called the African-American Congress (AAC) is gunned down at a political rally. When Cerreta and Logan arrive on the scene, no one is able to give an accurate description of the shooter. All that people agree on is that he was white. One of the patrolmen there says he saw a white male with a .38 running away, but he says he did not see the actual shooting.Logan and Cerreta go to the hospital to talk to the widow, but the Executive Director of the AAC, Mr. Books, tells them she cannot speak to anyone at that time. Mike gets heated, but Cerreta agrees to wait.Logan and Cerreta finally get to interview Tate's men. Books tells them that the eight bodyguards that were supposed to protect Tate that night were his idea because the AAC gets threats all the time.The detectives go to speak with the widow. She says she didn't know the shooter, but she will never forget his face. When they get back to the precinct, Logan and Cerreta begin sifting through press pictures of Tate, hoping to find the shooter in one of the pictures. They find the same white man in three of the pictures, so they take the pictures to show to Tate's bodyguard, Mr. Cook. Cook is bitter about the shooting and acts abusively towards Cerreta and Logan because they are white, but he does say that he has seen the man before. When Mrs. Tate looks at the pictures, she identifies the man as the man she saw with the gun.In one of the pictures, the man is wearing a shirt that says Amherst College Lacrosse on it. They go to the school and start digging through old yearbooks. Cerreta finds him and they identify him as Mitchell Koblin. They trace him to his parents' home, and they give them his address.When they get there, his ex-wife Sandy, who happens to be black, informs them that they are divorced. She says that after she got a job with the AAC, Mitchell constantly accused her of sleeping with the men who worked there, including Tate. She tells them that as far as she knows, he is teaching at a school in the Bronx, but when they get there, they find out he was fired and is now living at the Y.When they arrive there, Mitchell is playing basketball in the gymnasium. He tries to run, but Logan tackles him, and they arrest him. Cerreta finds a gun in his gym bag.While Cerreta is interrogating Mitchell, Logan gets back with the lab results on the gun. The bullet in the leg of a wounded bodyguard is a perfect match, but unfortunately they have nothing to go on from Tate because the bullet was shattered.Although the case against Koblin is strong, Adam insists that Ben and Paul look deeper to find a motive. He said if there are any doubts, a good motive will be needed to convince the jury.Ben goes to talk to Elizabeth Olivet, the department's psychiatrist. She is convinced that Mitchell believed his wife left him for Tate, and that the most important thing to him was to get her back. Stone puts Mrs. Koblin on the stand, and she testifies that she was indeed having an affair with Marcus Tate. She then admits to Mitchell's attorney that Tate was having affairs with other women, and he hints that maybe one of those men was responsible for the shooting. When Mrs. Tate takes the stand, Koblin's attorney asks her about all the men in the AAC who disagreed with Tate's principles, again hinting that one of them had motive. Stone objects and Mrs. Tate steps down.Next on the stand is Mr. Cook. The defense attorney, Mr. Lowenthal, is Jewish, and he purposely aggravates Cook into calling him a Jew and betraying his prejudice against Jews.Finally, Koblin takes the stand. He says he pulled the gun because he heard an explosion, and he shot the bodyguard because the bodyguard was about to shoot him. He tells the court that he only went to the rally to see his wife. Ben questions him briefly.The jury finds Koblin not guilty on all counts except for criminal possession of a weapon. The people in the courtroom go crazy. Adam is not satisfied, so he tells Paul and Ben to go over the transcripts again, this time to look for a civil rights violation. As they review the transcripts, Ben suggests that maybe Koblin really didn't kill Tate. He says that Mrs. Koblin testified that she had to get someone to walk her to and from work because Mitchell wouldn't leave her alone. Ben says that the person she would have asked is Cook, and if that's the case, Cook would have recognized Koblin. Ben figures if Cook lied about knowing who Koblin was, he probably lied about other things as well. Ben and Paul go talk to Mrs. Koblin, who confirms that Cook almost got into a fight with Mitchell one night. They then go to Mrs. Tate to ask about internal conflicts at the AAC. She is uncooperative, but Ben and Paul both believe she knows what really happened. Adam instructs them to arrest her for conspiracy. Paul asks him to let him talk to her.Paul tells Mrs. Tate that he doesn't understand why she's protecting the man who murdered her husband. She replies that she will not let the death of her husband ruin all that she has worked for. Paul says if she is withholding evidence, she is considered a co-conspirator in the eyes of the law, but she does not give in.Ben and Paul do some checking and find out that Cook and Books were involved. They bring them in, even though they know Mrs. Tate is refusing to tell what she knows. Ben interviews Books, while Paul interviews Cook. They both refuse to turn on each other, and there is not enough evidence to go to trial."},{"episode_title":"Skin Deep","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/skin-deep-9505\/recap","nth_season":3,"source":"http:\/\/www.tv.com","show":"original","corpus":""}]}