{
  "episode_recaps": [
    {
      "episode_title": "Deep Vote",
      "nth_episode": 24,
      "corpus_url": "http://www.tv.com/shows/law-order/deep-vote-45966/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Judge Dread",
      "nth_episode": 23,
      "corpus_url": "http://www.tv.com/shows/law-order/judge-dread-45965/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "School Daze",
      "nth_episode": 22,
      "corpus_url": "http://www.tv.com/shows/law-order/school-daze-45964/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Brother's Keeper",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order/brothers-keeper-43917/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "All My Children",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order/all-my-children-43916/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Whiplash",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order/whiplash-38099/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "A couple finds a dead Hispanic male in a side alley. The detectives find out that the man is Hector Santiago, an illegal immigrant from El Salvador who works odd jobs around town. While he told his wife he was working renovating buildings, Hector was actually working for a moving company. However, his injury turns out to be the result of whiplash in a car accident.  Briscoe and Greene find a record of Hector being in a car accident and track down the other parties involved in the crash. Hector sat in a car with Chad Patel and Emerald Daley, and it is revealed that the three intentionally trapped an SUV into an accident for a fee of $200 per person. While Hector is dead and Chad flees, Emerald explains that the boss of the moving company, Bill Reed, set up the plan.Reed initially denies any involvement in the accidents, so the DAs follow the money involved in the transaction. They find out that the victims were all 'treated' by the same chiropractor, Jerome Raleigh, who made insurance claims without actually seeing his patients. Under pressure, both Reed and Raleigh tell the detectives that Raleigh's lawyers Petrie and Sanders organized the scam. The DAs succeed in separating Raleigh from his lawyers and arrest the two for murder.  In the trial, the defense attorney tries to paint Petrie and Sanders as a mixture of Cesar Chavez and Robin Hood, protecting the poor and innocent, but the prosecution calls in the widow of another victim of their scheme, Mrs. Ndabe, to discredit them. The strategy works, and the two lawyers are found guilty of murder."
    },
    {
      "episode_title": "White Lie",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order/white-lie-35062/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "The police find a Mr. Alvarez dead in his apartment, with a gunshot wound to the back of his head and an ear cut off. The detectives find out that Alvarez was probably dealing cocaine, and through his nephew trace his movements to the heliport, where he met a flight coming from a military base carrying Karen Wyman, the wife of a major. The military don't exactly encourage the investigation, but the detectives find a connection between Alvarez and Caryn Wyman and arrest her for drug possession and conspiracy. Caryn first doesn't take the arrest very seriously, but eventually admits that she was bringing cocaine into the country for Alvarez, and that a man with a pony-tail was asking her to bring in even more drugs, showing her Alvarez's ear for additional motivation. Using Karen as bait, the police arrest Peña, the man with the ponytail. In the trial, however, two witnesses who had previously identified Peña recant, and the prosecutors have to rely on Caryn's testimony. Fortunately, the jury believes her and sends Peña to jail. Karen gets off with probation, and she and her husband are placed under witness protection."
    },
    {
      "episode_title": "Ego",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order/ego-31664/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "The corpse of a young woman who has been dead three or four weeks is fished out of the Hudson River. By tracing a belt buckle to a Manhattan gallery and with some phone canvassing, Briscoe and Greene identify the woman as Karen Hall, a woman working in the Office of the Attorney General in Albany who was been missing for several weeks. The proprietor of a newsstand at the Albany train station claims to have seen her the night of her disappearance, when she was returning from an assignment in New York. However, the Albany cops tell Briscoe and Green-off the record-that they believe the Attorney General's office steered the investigation in the wrong direction, away from their own office.The detectives follow up the last case Karen was involved in, baby-sitting a witness, and learn from that witness that Karen probably was involved with a man. One of her sisters confirms this suspicion. From credit card receipts, the detectives find out that she frequented a small restaurant in Manhattan, where the head waiter identifies her male companion as her fellow worker, Assistant Attorney General Alec Conroy.Because of Conroy's position as the heir apparent at the Attorney General's office, Manhattan DA Lewin is reluctant to pursue the case, especially since he has an alibi from a second mistress, Alice Murner, who completely idolizes him. Briscoe and Greene find out that his wife had tried to keep him from their apartment and kids, and they discover that the two went to therapy together. From the therapist, they learn that he sent a letter to Karen, Alice, and the wife warning them of immediate physical danger. They also locate a weapon on a boat belonging to Alice, and find out that Conroy took the boat out-carrying a large duffelbag-the night of Karen's disappearance. With this information, they arrest Conroy.Conroy's attorney Stan Gillum gets the letter from the therapist thrown out because of marriage privilege. The district attorney's office go ahead with the case anyway, but on cross-examination of Alice, the defendant's attorney makes it look like she committed the murder out of jealousy. At the same time, he lets slip that Conroy and his wife are legally separated, which McCoy uses to get the letter re-admitted as evidence. At that point, Conroy agrees to a plea that will put him in jail for 20 years and describes the murder to McCoy and Carmichael in detail."
    },
    {
      "episode_title": "Bronx Cheer",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order/bronx-cheer-29759/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "After a woman called Angela Jarrell is discovered dead in front of a bakery, her purse, which the detectives come across two blocks away, is found to contain a bag of ecstasy. From the victim's stomach contents, they place her in a bar, where a waitress finds a credit card slip from a young man who paid for her drinks. This man turns out to be innocent, but he gives the detectives the number of Jarrell's (stolen) cell phone, which leads them to a Mr. Daltry, who claims he was trying to purchase ecstasy from her and calls her an incompetent drug dealer. Daltry points the detectives to a drug dealer known as Taz, whose real name is Frances Partell.While the detectives can find nothing connecting Partell with Jarrell's murder, they discover from his former partner, Mr. Quintana, that he was involved in the murder of a bouncer at a club in the Bronx in 1998--for which another man, Tony Shaeffer, was sentenced after he boasted to his girl-friend of the murder. The detectives re-interview the witnesses of the bouncer murder and arrest Partell for it.Unfortunately, this arrest raises serious interoffice issues with the detectives, prosecutors, and DAs in the Bronx-the only reason the Manhattan office is allowed to prosecute the case in the first place is because the club is 488 yards from the county line. In spite of various witnesses raising doubts about the case, DA Robertson in the Bronx refuses to reconsider the case. The Manhattan DAs take the case to court nevertheless and manage to win an evidentiary hearing. Lewin asks McCoy and Carmichael to strike a deal with Partell in which he admits his guilt to get Shaeffer out of jail, but even after Partell's confession DA Robertson refuses to budge. McCoy takes the case to the Appellate Court and manages to win freedom for Shaeffer."
    },
    {
      "episode_title": "Swept Away - A Very Special Episode",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order/swept-away-a-very-special-episode-26443/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "A Losing Season",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order/a-losing-season-22494/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "At a red light, one car drives into another. When the two young men in the back car run away, the elderly couple in the front one find a young, pregnant, dying woman - Deena Meredith - in the trunk of the car. By tracing stolen car parts in the back of the car, the detectives locate the two young men, foreigners working for a chop shop dealer, but reject them as suspects for the actual murder.From Deena's credit card records, the detectives place her at a bar a few hours before her murder. Witnesses describe her leaving the bar with two young men in a champagne Lexus, and a midtown Lexus dealership - where cars cost the equivalent of an entire year's salary for a detective - places the car with the basketball star Chris Coty. He explains that his friend Henry Williams was driving the car. Loan reports concerning the financing of the car show that Deena was the loan officer in charge.As a matter of fact, Deena organized around $300,000 in loans that went to Williams for 'business investment,' probably drug deals, in Coty's name. Coty's team lawyer is aware of his dealings, and his own drug habit, and puts the police on the trail of one Marcus Cole, in whose apartment a semi-automatic .44 is found - the murder weapon. Cole tells the police that Coty instigated the murder, and Coty goes on the run. He is finally tracked down and arrested in his mother's home, where he is considering suicide.Under the threat of a life sentence with no possibility for parole, Williams divulges that Coty is the father of Deena's baby. While both Williams and Cole accuse the basketball star of having instigated the murder, Coty claims that Williams killed Deena because he (Coty) had cut him (Williams) off from his drug money. In court, the district attorneys argue that Coty had Deena killed in order to avoid paying child support, while the defense asserts that he is innocent and being hounded because he is a sports celebrity. The jury finds Coty guilty."
    },
    {
      "episode_title": "Phobia",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order/phobia-21356/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "Brad Mandell, a gay man, is found beaten to death, while his adopted child Dylan has been kidnapped. The man's partner, Donald Alvers, tells the detectives that the baby is prone to seizures (due to its mother's drug use during pregnancy) and needs to be found quickly. A ransom call comes in, but following the money after the drop-off leads only to dead ends: a messenger, a young man, and a mechanic who have participated by picking up the money, by accepting the ransom, and by making the ransom call-all without knowing about the kidnapping. As a matter of fact, it turns out the car mechanic was simply trying to take advantage of Alvers after finding out about the abduction.Now, the detectives follow the trail of the medication Dylan needs for his seizures. They find out that a prescription was called in and picked up by one Susan Powers. Raiding Powers' apartment, they discover that it is a safe house for battered women and learn that the kidnapped kid's birth mother, Celia Goddard, claiming to be an abused woman, has hidden the baby away. The detectives arrest Celia in a bus trying to leave town. Under intense interrogation, and to save herself from the accusation of murder, Celia finally admits that she was involved in the kidnapping. The detectives find Dylan with his biological father, Robert Kelley, in Peekskill and return him to Alvers.The district attorneys decide to cut a deal with Celia and charge Kelley with second-degree murder, motivated by bias -- Celia claims Kelley only became interested in getting Dylan back when he found out he had been adopted by a homosexual couple. In the trial, the main issue is whether Celia manipulated Kelley into murdering Mandell, or whether Kelley purposely killed him because he was gay. Kelley makes the death out to be an accident, but the medical examiner's report says that Mandell was beaten to death after he was unconscious. The jury finds Kelley guilty of the murder and of a hate crime."
    },
    {
      "episode_title": "Teenage Wasteland",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order/teenage-wasteland-21355/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "Painters coming to an empty basement apartment discover the body of a dead Asian male, probably a deliveryman, in the doorway. Detectives Briscoe's and Green's suspicions first fall on a homeless man who frequently stayed in the doorway, but that man tells them he was chased away the night of the murder by a group of teenagers, four boys and one girl—who had the key to the apartment.The detectives identify one of the girls as Heather, sister of the apartment's last resident. It turns out that she, her boyfriend Mitch, and their friends Peter, Chris, and Nick were partying there the night of the murder. Mitch is questioned first and, after several attempts at evasion, calls the death an accident and blames his friend Peter. However, further investigation, which uncovers a juvenile assault on Mitch's record, leads to the conclusion that it was he who first planned to rob the delivery man and then instigated and committed the murder. Mitch tries to plead guilty to murder one, but the DA's office after extensive deliberation decides to pursue the death penalty—from which his friends are exempt because they are under 18, which he turned two weeks previously.At the trial, only Mitch and his mother take the stand, suggesting that his anger is due to bad relationships with his father and stepfather. In the closing statements, McCoy asks the jury to consider the defendant's savagery and viciousness, while the defense attorney argues that Mitch should be spared because he will be a different person in twenty years. However, the jury passes a death penalty."
    },
    {
      "episode_title": "Sunday in the Park with Jorge",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order/sunday-in-the-park-with-jorge-14590/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Whose Monkey is it Anyway?",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order/whose-monkey-is-it-anyway-14035/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Hubris",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order/hubris-12965/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Thin Ice",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order/thin-ice-9889/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Amends",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order/amends-9739/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    },
    {
      "episode_title": "Burn Baby Burn",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order/burn-baby-burn-9738/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "A white Irish policeman is shot and killed by a former \"Black Panther\" (an African- American political group of the 60's which promoted violent overthrow of the establishment) when the policeman goes to the wrong house in search of a suspect.  The arrest and prosecution of the former political radical, Lateef Miller, leads to racial clashes, on the street, in the police department and in the court-room. Detective Green is caught between loyalty to his brethren in the department and his \"brothers\" on the street.  The entire prosecution becomes an ugly political circus, dredging up faded but bitter memories of a time in America when the police were a little more overt with their racially motivated, crime-fighting activities and the \"enemies of the state\" were a little more clearly defined."
    },
    {
      "episode_title": "Return",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order/return-9737/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "The co-owner of a New York leather jacket business is found murdered by three teenagers. Since robbery doesn't appear to be the motive for the murder, Briscoe and Green delve deeper and discover that this was a murder for hire. A son of one of the partners in the business feared that his future as the \"king of leather\" in New York City was in jeopardy because the business was going to go to the partner's grandson instead. McCoy's prosecution is hampered when the accused's parents ship him to Israel in an effort to evade a guilty verdict in New York and to bolster their case for a trial and possible sentencing in Israel under the \"Right of Return\" law. Their efforts are thwarted when it's revealed that the accused was actually adopted, and therefore is not considered a Jew under Jewish law."
    },
    {
      "episode_title": "Standoff",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order/standoff-9736/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "A leader of an Hispanic gang is found murdered inside the prison where he is serving time. His murder is made to look like the result of a simple continuing gang struggle for control of his turf and the proceeds of a pending huge drug deal.  In reality, his murder is the result of the acts of the enraged lover of a female corrections officer who had been raped by the victim while she was a guard at another facility. It is basically a murder for hire since the actual act is performed by another, psychopathic inmate who is looking for favorable treatment for his son who just happens to be a chip off the old block, serving time in another prison.  As usual, Briscoe and Green go after the wrong suspects and end up with egg on their face.  McCoy takes on the corrections officers' union and makes no friends on this one. This blunder had to cost the city a fortune!"
    },
    {
      "episode_title": "Dissonance",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order/dissonance-9734/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "A rising-star violinist is found murdered in her dressing room at the Manhattan Symphony.  Her priceless violin is also found missing.  The search for her violin leads to the search for her murderer. The motives and the suspects are many, but when the focus of the investigation turns to the real murder suspect, a surprising twist completes the circle. The end of a love affair between the prodigy and the maestro results in the prodigy's death and the surprising courtroom confession of the maestro's wife; but did she really do it?"
    },
    {
      "episode_title": "Turnstile Justice",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order/turnstile-justice-9733/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": "A woman is bludgeoned to death with a paving stone in a subway station, and the police use data stored from her transit pass and her stolen credit cards to find the killer. Once they track down the killer the plea bargain is easy.  It's getting justice that's difficult!"
    },
    {
      "episode_title": "Endurance",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order/endurance-9732/recap",
      "nth_season": 11,
      "source": "http://www.tv.com",
      "show": "original",
      "corpus": ""
    }
  ]
}