{"episode_recaps":[{"episode_title":"Terminal","nth_episode":23,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/terminal-9617\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Past Imperfect","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/past-imperfect-9616\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Passion","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/passion-9615\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"We Like Mike","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/we-like-mike-9614\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Double Down","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/double-down-9613\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Mad Dog","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/mad-dog-9612\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Showtime","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/showtime-9611\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Turnaround","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/turnaround-9610\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"D-Girl","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/d-girl-9609\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Working Mom","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/working-mom-9608\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Matrimony","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/matrimony-9607\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Barter","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/barter-9606\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Menace","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/menace-9605\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Legacy","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/legacy-9604\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Entrapment","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/entrapment-9603\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Family Business","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/family-business-9602\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Deadbeat","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/deadbeat-9601\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Double Blind","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/double-blind-9600\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Corruption","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/corruption-9599\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":"The episode opens with Lennie and Rey working a drug sting with other cops. Rey is in a van observing Lennie and John Flynn make the drug buy. Lennie leaves Flynn alone with the dealer Morales to go to the trunk of the car for the sting money, when suddenly Flynn yells, \"Gun!\" and shoots Reuben Morales.Immediately after the shooting Flynn wants to make sure every one will tell IAB the same story. When Rey balks, saying he can't say for sure whether Morales reached for a gun or not becasue of where he was, Flynn says to Lennie, \"Tell your friend how things are done.\"Lennie and Rey both tell their versions of the story to IAB, who are their typical skeptical selves always looking for something sinister in any situation. It's revealed that Flynn requested Lennie work with him on the sting and Lennie explains that he and Flynn worked together for about 3 years in the 116 in Queens. Although IAB clears Flynn in the shoot Rey thinks something is wrong, and he tells Lennie about his suspicions at a cop bar where Lennie is waiting for him.  Lennie tries to reassure Rey that things are okay, that it's just John's way.Rey isn't satisfied and so begins investigating Morales. He goes looking for the victim's brother Richie Morales, he finds the young man cowering in a closet in a nearly abandoned apartment. When Rey informs Richie that Reuben is dead, Richie explains that his brother was going to give evidence to the DA in exchange for a lesser sentence and \"warm weather relocation,\" but his brother was afraid that if word got to Garcia he'd be killed. Rey tells him his brother must have gone back on his deal because he was killed during a drug deal. Richie explains that his brother was told he had to keep working so Garcia wouldn't become suspicious. But he's sure that Garcia must have been responsible for his brother's death.Rey tells Lennie that he thinks Flynn shot Morales for Garcia. Lennie gets very upset with Rey and doesn't support him, so Rey goes to Van Buren. She's not as resistant as Lennie but she wants to be cautious as they check out Richie's story. As Rey checks more things out he finds more incriminating evidence against Flynn, suggesting that Flyn has been working for Garcia for 5 years, since the time Garcia walked on a major drug bust when the drugs for the case disappeared from the evidence room at the 116.Word of Rey's activity gets to Flynn and he approaches Lennie, reminding him of their days at the 116. He reminds Lennie of how often he used to help Lennie get home after Lennie had drunk too much. Lennie tells Flynn he's off the sauce now, in a manner that suggests he's telling Flynn these are different times. Flynn insists that Lennie needs to talk to Rey and he wants to be there with him.Flynn's attitude at the meeting with Rey convinces Lennie that Rey's on to something, so he decides to do some investigating of his own. He asks Rey not to go to anybody until he does some checking.Lennie arranges to casually meet at the police target range with one of the other detectives who was there the night Morales was shot. Briscoe learns that Morales was not the original target of the drug sting. He cons the name of the CI who set up the drug deal from the other detective. Lennie busts up a dice game so he can talk to the CI Two-Tone. Two Tone lets him know that it was not him who switched things around. Lennie is now convinced that Rey is right about Flynn.Lennie and Rey finally start working together as partners again, when they go to talk to Flynn's partner. The young detective buckles under pressure and admits that Flynn is on the take, and that Flynn gives him money every week. He feels so guilty about it, that he has kept all the cash Flynn has ever given him in a coffee can in his basement.Because the cash doesn't have Flynn's fingerprints on it, they need more evidence. They search Flynn's locker at the police station, it's party time - booze, skin magazines, condoms. Jamie Ross is present during the search and is able to figure out from a lingerie catalog that he's probably been buying stuff on a regualr basis. Through the catalog's label they figure out where his mistress lives, in a condo he pays for, with some pressure from Jamie she gives them the extra bit of evidence they need. He has a floor vault in the condo and his mistress has seen him with Garcia.They arrest Flynn for murdering Morales, his lawyer tries to offer up a deal where he would give up the drug dealer Garcia, but he wants such a soft deal McCoy won't consider it. Jamie wonders if they shouldn't deal to get to Garcia, but before they can really hash it out,  Judge Hellman calls and summons Jack to his office. Hellman tells Jack that the Hellman Commission has made a deal with Flynn for his cooperation with the commission (the commission is trying to find corrupt cops). Jack is outraged by the cushy deal Flynn is getting, especially since the deal doesn't include testifying against Garcia, but things get worse.In Flynn's testimony to the Hellman Commision, he admits to killing Morales and working for Garcia. When asked if the other detectives at the scene of the Morales shooting were involved, other than his partner, he says no, but says he asked Lennie Briscoe to be there because he knew Lennie would cover things up for him. When asked to elaborate about that, he says when Garcia got off the drug rap it was Lennie who stole the drugs! Flynn's testimony is televised, Lennie's watching the testimony with Rey, Van Buren and other members of the 2-7.Lennie is subpoenaed to testify in front of the Hellman Commission. He says he wasn't there the day the drugs were stolen. When confronted with the duty logs that say otherwise he explains that he signed in and then went home and a friend signed him out. When the drugs were stolen he was home sleeping off a hangover. When asked if anyone can  confirm that he says no he was alone. (It's pointed out that he falsified a record and was in dereliction of duty).Jamie uncovers a clue about the stolen drugs, a uniformed officer named Spence probably stole the drugs but they've got to do some more digging.Lennie tells Jack he wants to wear a wire and get Flynn to admit the truth to him, but McCoy wants some time to work on the Spence angle.Jamie uncovers more about Spence,  but it isn't a lot of help. He's dead. She does get confirmation from his lawyer that Spence probably did it, but it's not something they're going to be able to use with the commission.As Lennie's about to enter his apartment building that evening an attractive middle aged blonde approaches him. He calls her Betty and says it's been a long time and asks if she wants to come up. She suggests they go across the street. They sit on a bench across from the apartment. As they talk, we realize she's a cop he used to work with, and had an affair with. She tells him she remembers going into the precinct the day after the drugs were stolen and that it had been after one of the nights they'd spent together. So she was with Lennie the day the drugs were stolen. She wants to testify for him (which would contradict what he said under oath about being alone and not only expose the fact that they had an affair but that they violated department regulations against fraternization). Lennie thanks her but tells her no, and reminds her of why she ended the affair \"because you had a husband and two sons\". He then tells her about Spence. She counters telling him that Dave Spence is dead. She argues with him, trying to convince him that she's not doing it because of what they once were to each other but because she's a cop and she can't stand what Flynn's doing. He still says no, he doesn't want her to do it.Jack and Jaime come to their office to find a phone message from Betty Abrams. She wants to testify on Lennie's behalf.Lennie comes to the Hellman commission to find Betty about to testify. He gets Jack McCoy out into the hall and then threatens to \"Kick your ass from here to Hoboken\" if Jack doesn't get her off the stand. Jack tells Lennie it's out of his hands, that she said she'd call the commission herself if Jack wouldn't.He also tells Lennie that he has to face it, she's all he's got. Lennie still feels \"no good comes of this\" and he's right.Although Betty provides Lennie with an alibi, Hellman questions her in such a way as to make her look like a promiscuous woman who would lie to help her former lover.After that session of the commission hearing, Lennie runs into the Judge in the men's room and comes close to having a physical altercation with the judge. Lennie speaks his mind, he's thoroughly disgusted that the Judge \"gets off on humiliating innocent people.\" Hellman asks if he's \"upset because your witness is a slut and a liar?\"  Lennie tells Hellman that he and Flynn deserve each other and should rot in hell.When he leaves the courthouse Lennie tersely tells Jack \"Now we do it MY way!\"Lennie wears a wire and waits for Flynn in the only place he can get to him (due to state troopers who are guarding him), a local Catholic church. Eventually Lennie goads Flynn into clearing him of the drug stealing.McCoy forces Hellman to listen to the tape and Hellman has to issue a Mea Culpa. McCoy and Ross plan to arrest Flynn for perjury, which will vioate his deal with Hellman putting him in jail for life. They hope to get him to testify against  Garcia. Lennie asks to go along on the arrest because he thinks it will be easier on Flynn if he's there.When they arrive Flynn is alone drinking, he's sent his family away. He makes cutting remarks to Lennie asking if he's still wearing a wire and telling him he thought he'd be loyal. Lennie doesn't want to rehash the conversation they had in the church and brushes him off about the loyalty remark.Asking to go to the bathroom and convincing the guard that he can do that alone, he continues talking to Lennie as Lennie leans on the doorsill outside his bathroom. Just as Flynn asks Lennie if he wants to talk about the ponies (one of Lennie's remaining bad habits is betting on horse races), you hear a pistol shot. Flynn has committed suicide.In the final scene Rey tells Lennie that Garcia is back in the States (he'd been overseas avoiding arrest), Lennie replies saying \"He's probably heard Flynn's dead and knows we can't lay a hand on him now.\"Rey asks his partner if he wants to grab something for dinner (obviously thinking his partner could probably use an opportunity to vent to someone who would understand). Lennie begs off saying \"I have to go see a friend, she's got,\" he pauses looking for the correct phrase, \"family problems\"."},{"episode_title":"Survivor","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/survivor-9598\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Good Girl","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/good-girl-9597\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"ID","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/id-9596\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Causa Mortis","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/causa-mortis-9595\/recap","nth_season":7,"source":"http:\/\/www.tv.com","show":"original","corpus":""}]}