{"episode_recaps":[{"episode_title":"Invaders","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/invaders-730597\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":"The episode begins with the murder of four members of the Andreas family, suffocated in their own home. The husband and father of the victims, Frank Andreas, is not present, and so Detectives Green and Fontana search for him at his store. They find, however, the store has been shut down and Andreas has been arrested for selling official NYPD equipment that has fallen off the back of a truck, as well as counterfeit badges.As it happens, ADA Borgia was the prosecutor for Andreas' case, and she tells the detectives that he was able to give her information which linked his suppliers to the unsolved murder of 3 people.Borgia convinces Andreas' lawyer to make contact with him so the detectives can speak to him. When Andreas is brought in to the station, he receives his wife's personal effects and notices that her engagement ring is missing. He also reveals that his wife called him several times to tell him to come home, but that he suspected something was wrong so he stayed away. Andreas names his contacts as two men named Ricky and Vincent, and says that he was able to make counterfeit DEA badges based on a real DEA badge that they had brought him to work off, although he didn't know who the real badge belonged to. Fearful for his life, he refuses to give anymore information.Borgia speaks to McCoy and insists that she wants to maintain control of the case. She returns home to her apartment late at night and is on the phone to the DEA, who are giving her the runaround. There is a knock at the door, and she barely has a chance to open it before it is knocked down by two men who storm into her apartment, gag her with duct tape and drag her away.McCoy and Van Buren interrogate Andreas for any information he might have that he hasn't given them yet, certain that Borgia's disappearance has something to do with the case. Threatened with being dumped into jail, rather than protective custody, he gives up the name of his contact, Dave Morley, who might know the identities of Ricky and Vincent. As McCoy is leaving, Andreas makes the suggestion that Borgia might be dirty.The detectives try to find Morley, but he has skipped town. In the meantime, Van Buren discovers that $8000 was deposited into Borgia's account, the day before Andreas left jail. Just to cover their bases, she sends Green and Fontana to the bank to investigate, and the teller they speak to reveals that the computer has recorded that a teller at a branch where Borgia did not regularly bank had accessed her account.Green and Fontana talk to the teller who accessed Borgia's account details, and he admits that he was coerced to do so to try and get his brother out of trouble with the DEA. He says that a DEA agent named Almonte had told him to do it.The detectives talk to Almonte, but he won't admit anything. The detectives are sure, though, that he is somehow involved, and so McCoy cooks up a minor computer trespass charge against him and Almonte is arrested. A fruitless interrogation session with Almonte is interrupted when Van Buren receives word that an abandoned car has been found. She, Green, Fontana and McCoy all go to the scene, and find that Borgia's badly beaten body is in the trunk of the car. The medical examiner says that she suffocated after throwing up into her gag from the severe beating she endured.McCoy goes to talk to Andreas, who is still in protective custody, and begins to cook up a scheme to flip Almonte, with Andreas' cooperation. He convinces a friendly judge to stage a simulated prosecution, which involves holding a grand jury with fictional testimony, and a sham murder indictment of Almonte for the 3 murders which Andreas originally attributed to Ricky and Vincent and their associates. (According to McCoy, such a ruse is perfectly legal and has precedence in at least one other case).Andreas testifies in the mock grand jury, lying that Ricky and Vincent told him that the DEA badge belonged to Almonte, when in fact he had no such knowledge. This secures a pretend indictment, and McCoy then tries to negotiate with Almonte for a lesser sentence, if he will admit to involvement in Borgia and Andreas' murders. Almonte, however, smells desperation and calls Jack's bluff. He refuses to deal.Meanwhile, Green and Fontana have managed to track down Mrs. Andreas' stolen engagement ring, which had been pawned. They raid the apartment of the woman who pawned it, only to find out that they had just missed Ricky and Vincent and no one knows where they went.  McCoy arranges for Almonte to be 'slipped' a tapped cell phone while in prison, which then records a conversation with Vincent, in which he tries to arrange the murder of the grand jury witness against him (Andreas).The supervising judge (who is trying to make sure that all the pretending stays above board) tells McCoy that she cannot allow a real indictment based on the taped phone conversation because it is entrapment. There is no choice, then, but to let Almonte walk free.As Almonte leaves jail, he is followed and monitored by Van Buren and the other detectives. Before they have a chance to step in, Almonte is murdered outside his apartment in a drive-by shooting. Green and Fontana manage to stop the car and arrest Ricky and Vincent.Ricky and Vincent are indicted on nine counts of murder. McCoy handles the arraignment, but is stopped midway when the Assistant State's Attorney-General enters the courtroom and says that he has Governor's orders to handle the case as a special prosecutor, as McCoy is far too emotionally involved in the case to be able to conduct the prosecution. McCoy, therefore, is forced to step down from the case."},{"episode_title":"Hindsight","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/hindsight-730598\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Kingmaker","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/kingmaker-677576\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Positive","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/positive-692056\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Thinking Makes It So","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/thinking-makes-it-so-688341\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"America, Inc.","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/america-inc--672831\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Cost of Capital","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/cost-of-capital-662894\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Choice of Evils","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/choice-of-evils-662893\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Magnet","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/magnet-629764\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Heart of Darkness","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/heart-of-darkness-611533\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Family Friend","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/family-friend-606811\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Bible Story","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/bible-story-514206\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Acid","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/acid-552205\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Criminal Law","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/criminal-law-552198\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"New York Minute","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/new-york-minute-551756\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"House of Cards","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/house-of-cards-536492\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Birthright","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/birthright-536494\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Life Line","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/life-line-522517\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Age of Innocence","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/age-of-innocence-522854\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Ghosts","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/ghosts-514204\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Flaw","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/flaw-505373\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""},{"episode_title":"Red Ball","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order\/red-ball-496296\/recap","nth_season":16,"source":"http:\/\/www.tv.com","show":"original","corpus":""}]}