{
  "episode_recaps": [
    {
      "episode_title": "Tuxedo Hill",
      "nth_episode": 23,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/tuxedo-hill-145345/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Faith",
      "nth_episode": 22,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/faith-144238/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Badge",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/badge-144237/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Maledictus",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/maledictus-131139/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Yesterday",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/yesterday-131138/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Seizure",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/seizure-131137/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Phantom",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/phantom-125301/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Semi-Professional",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/semi-professional-123758/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Homo Homini Lupus",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/homo-homini-lupus-121562/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": "Susan Colter's mother goes to the police, fearing that something has happened to Susan and her two daughters, Maggie and Sarah. When Mother arrived at Susan's home for a planned shopping trip, no one answered the door or Susan's cell phone. Susan's husband, Lucas Colter, returned from his morning jog while Mother was on the front doorstep. Inside the house they found a toppled umbrella stand, and a dropped carton of yogurt on the floor. Lucas said that Maggie hadn't been feeling well that morning, and that Susan had said she might take her to the doctor. She probably took Sarah along, rather than leave her at home alone. However, the doctor's office said they hadn't heard from Susan. Nor are she and the girls at any area hospital. Mother believes Lucas lied to her, and that he knew something had happened to his family.Concluding that Susan Colter and her daughters have in fact been kidnapped, Deakins sends detectives to the Coulters' neighborhood. Posing as religious ministry workers, Goren and Eames knock on the Colters' door and discreetly identify themselves as police to Lucas Colter. He tells them that he and Susan had a fight that morning, and she left with their daughters. He doesn't know where they went. While other detectives watch the Colters' house, Goren and Eames go to Lucas' bank.  In the previous two weeks he had cashed a number of checks for varying five-figure sums, one from an auto dealership and the rest from brokerage firms.Next stop is the investment company where Lucas is chief operating officer. Another executive tells Goren and Eames that the previous year, Lucas had bought a Porsche and taken his family on an expensive Italian vacation. Lucas said Susan had come into some family money. However, no one at the company is rich now. The previous summer, in 2001, had been a different story. The company received a lucrative buyout offer, in which Lucas would have received $3.5 million. Everything was on track until 9/11 happened, after which the deal fell through. The company has been struggling ever since. Lucas had been living beyond his means, and probably went to the street for a loan. Now, payment is due.The detectives watching Lucas' house follow him to a downtown pay phone, where he receives a call. He freaks out while talking to the caller, but still refuses to let the police help him. Goren and Eames determine that Lucas had been embezzling from his employer. When the buyout offer came, he had to return his ill-gotten gains before auditors started going over the books. Then when the deal fell through, he had no way to pay back the loan.To find the missing Susan Colter and the girls, Deakins tells Goren and Eames to arrest Lucas for embezzlement and lean hard on him. They do, but he doesn't crack. Then Deakins receives word that Lucas' family has been returned safely.Goren and Eames go to the Colters' home. A haggard-looking Susan also tells them that she and Lucas had a foolish argument, and she'd left with their daughters. The detectives insist on seeing the girls, and go upstairs. Goren sees Sarah in the hallway and says a friendly hello. She silently goes into the bedroom and sits on the bed to comfort Maggie, who is lying there in an equally silent, utterly numb state. Susan dismisses the detectives, saying that she and the girls need sleep. Eames tells Carver there's no doubt Maggie Colter was raped. Carver replies that since Maggie is a minor, no judge will order her to talk to them without her parents' consent. Lucas' employer is now reluctant to prosecute him for the embezzlement, fearing bad publicity.  The law will just have to find another way to bring the kidnappers to justice.Susan's mother backpedals as well, saying she was mistaken about a kidnapping. Goren tells her his theory about what happened. Lucas had been trying for weeks to repay the loan shark, without success. He tried to get money from a certain person, who said no. So Lucas arranged to have his family kidnapped, to pressure that person into giving him the money. However, Lucas didn't expect that Maggie would be violated. Mother admits that Lucas had sought a bailout from his father, Melvin Colter. The senior Colter is an insensitive bastard who has never cared about Lucas, but does care about his granddaughters. Goren and Eames talk to Melvin Colter, who is utterly unmoved by anything they say. Goren wonders if Melvin, who's been self-employed for decades, knows the loan shark. Eames finds a legal document from six years ago, in which Melvin had asked the court for more time to pay some business creditors. One of those creditors was B&E Fast Credit, which at the time belonged to a Carl Pettijohn. Pettijohn has a record for fraud, possession of stolen goods, and loan sharking.Pettijohn insists that the loan he made to Lucas Colter was legitimate. He also says he'd never hurt anyone, certainly not anyone's family. Carver replies that someone must have disregarded Pettijohn's instructions, and tells him about the rape of Maggie Colter by the kidnapper. That level of physical violence isn't Pettijohn's  Pettijohn admits that he used someone new to collect Lucas' debt. A drug gang collector named Nicky Torres referred him to this guy, someone with an East European accent. Pettijohn doesn't know the man's name or what he looks like, because he had contacted him only by phone.The phone number Pettijohn has for the unknown collector is for a prepaid cell phone. The detectives tap Torres' phone, and learn that he's planning to have another debtor's family kidnapped. They haul in Torres, who also knows only the collector's phone number. For reference, on the phone Torres addresses the collector as \"Little Joe\" because the latter's cell phone ring tone is the theme from Bonanza.The detectives stake out the home of the next kidnapping target. When a woman and a teenage girl emerge and walk down the street, a man who had been loitering nearby follows them. The police make their presence known, causing the man to panic and run. Goren sees a second man exit a parked van and run away too, and goes after him. The first man pulls a gun on Eames, who shoots first and kills him. Goren momentarily loses the second man in a crowded diner, but finds him by dialing the collector's cell phone number and following the sound of the Bonanza theme.\"Little Joe\" is Simon Matic, who served four years in the Serbian army before emigrating to the United States and eventually becoming a citizen. The detectives have no evidence against him to support denying bail, and Torres won't talk unless he himself is allowed to walk. With less than a day before Carver must produce Matic for arraignment, the detectives return to the Colter home.Susan Colter is now willing to cooperate, but she can't identify Matic or his late accomplice because she never saw their faces. She allows Goren and Eames to talk to Maggie, who has refused to talk to anyone since the rape. A therapist has diagnosed Stockholm syndrome. Goren uses reverse psychology to help Maggie acknowledge how much Matic had hurt her, and to see that she was strong for surviving Matic's assault, not weak for being unable to defend herself against it.With minutes left before Matic is due in court for arraignment, Goren and Eames have another go at him. Goren goads Matic by implying that the latter was a coward who'd served safely behind the battle lines, well out of harm's way. To prove he wasn't a coward and had in fact seen combat, Matic lifts his shirt and shows a large scar on his side. Goren uses that opening to reveal a large, intricate tiger tattoo on Matic's lower back.Matic says the initials \"SRA\" in the tattoo stand for Serbian Infantry Regiment. However, Goren knows the initials actually stand for Srpska Dobrovdjaca Garda, or Serbian Volunteer Guard. Matic served not in the regular army, but in a paramilitary group commanded by an indicted war criminal. Matic slips up and says, \"Those bitches . . . they are all liars.\"Goren then reveals the reason he knows so much about the tattoo:  a statement signed by Maggie Colter including a detailed picture of the tattoo she'd drawn from memory. Unknown to Matic, Maggie had sneaked a look at his tattoo when he stood, shirtless, with his back to her while he talked on his cell phone. Matic had put Maggie through hell, but she got him back. As a defeated Matic sinks back in his chair, Goren says with satisfaction, \"Now he's ready for arraignment.\""
    },
    {
      "episode_title": "The Insider",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-insider-114142/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Crazy",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/crazy-108240/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "The Third Horseman",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-third-horseman-108234/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Enemy Within",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/enemy-within-100741/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "The Good Doctor",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-good-doctor-97626/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "The Faithful",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-faithful-1593094/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "The Pardoner's Tale",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-pardoners-tale-94105/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Poison",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/poison-90119/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "The Extra Man",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-extra-man-85430/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Jones",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/jones-83971/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "The Faithful",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/the-faithful-83970/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Smothered",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/smothered-80326/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": ""
    },
    {
      "episode_title": "Art",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/art-78056/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": "A woman is talking on the phone to a man called \"Bernard.\" She needs to talk to him in person and arranges to meet him. As she hangs up a colleague comes in with a poster advertising the Claude Monet painting, Spring Violets, coming to the Champlain Museum of Art. The first woman excuses herself, claiming a \"kid emergency\" just came up.The scene changes, and we see a German man and an American man talking. It is obvious that something that they have been involved in has gone wrong and the consequences could be potentially disastrous. Only the American is acting worried, the German appears to be calm. The German agrees to help the American sort out the situation.The American is then having dinner with his wife and tells her that he has to go back to the studio that night. They argue because the wife doesn't want him to go. She feels that he is working too hard and he is exhausted.The German and the American are then back together in a different room from when they were last together. The German is drinking win, when the door bell rings. The American opens the door and the woman who was on the phone earlier enters. She wants to know why the German is there, claiming she thought it was supposed to be private. The American assures her that the German knows everything.The doorbell rings again and the characters look at each other before the scene changes. The American's wife exits a cab and enters the room where the woman and the two men had met the night before. She discovers her husband lying dead, on the floor with a revolver not far from his left hand and the woman whom he had met with hanging in the corner, the rope slung over a pipe near the ceiling and tied off on a radiator.The detectives investigate the scene. The American is identified by his wife as Bernard Jackson, an art authenticator and the woman is identified by identification in her purse as Ann Ellis, the curator of the Champlain Museum of Art. The weapon is identified as Jackson's.Eames mentions that opinion polls peg the two deaths as murder-suicide but Goren tells her 'never trust opinion polls'. He proceeds to prove that it is a double homicide. Back at the station, Deakins puts forward a few possible motives for the murders but Goren explains why they can't be the case.As Goren and Eames interview Ann's husband they learn that a couple by the name of Blunt were donating the Monet to the museum. At the Blunt's house Goren pretends not to know much about art and he makes Mr. Blunt nervous by picking up a small statue. He then makes a comment about the Monet that shows that he might know more about art than he's letting on.Mr. Blunt goes to see the German. He is worried by how much Goren appears to know about art. The German tells Mr. Blunt that Jackson was having an affair with Ann and Blunt calls Jackson stupid for having done so. The German tells him that they can use this to their advantage and use Jackson as the scapegoat.As the detectives continue their investigation, inconsistencies begin to appear. Goren continues to show his wide knowledge of the art world.After a test of the radiation levels in the linseed in the paint, the detectives are informed that Goren was right in his statement that \"the exquisite Monet could be an exquisite fake.\"The detectives interview the German, Rudy Langer, after finding a discrepancy between how much Jackson had on the books ($100,000) and how much his wife claimed he put into their bank account over the last year ($1,000,000).The German is still unworried and claims that the science which proved the Monet was a fake isn't as accurate as Americans like to believe. We also learn that Goren learned German in the army.The German gives the detectives all the paintings he has bought recently after Goren threatens him with 'something else Americans are impressed with' – subpoenas. They learn that all of the paintings had belonged to Jews, who had met an \"unfortunate end.\" They also learn that the original paintings had all been lost at sea when a German U-Boat sank.There is a common theme throughout all of the painting sales. All were donated by the buyers to smaller museums where they would be a star. They link the sales to a tax scam but don't believe the museums were in on it.Goren takes transparencies of the forgeries to another artist who copies famous paintings. He discovers the forger's signature in the top right hand corner and identifies her as Sylvia Moon.We see Langer arguing with a woman about her art. The detectives then meet this same woman, Sylvia Moon, and begin to question her. They bring her into interrogation and she claims that Langer knew what he was buying.Sylvia claims that she doesn't know who Jackson is but the detectives learn that he was a lecturer at the college where she studied art and that she had an affair with him. They also learn that Sylvia's roommate committed suicide by hanging herself and that the painting that Sylvia used to get into college was actually painted by her dead roommate. The pictures of Sylvia's roommate's death show an identical method of hanging as that used to kill Ann Ellis.The detectives trick Sylvia into slipping up and confessing to being involved in the murders. When she starts moaning about how hard her life was Goren puts her down sharply.The detectives arrest Langer, who Sylvia also implicated in the killings. Goren tells him that he should have supported his partner because now that she is a confessed murderer her paintings would fetch a rich price. He is dragged off shouting, \"You bring me down on the word of a woman? A woman?!\""
    },
    {
      "episode_title": "One",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-criminal-intent/one-76485/recap",
      "nth_season": 1,
      "source": "http://www.tv.com",
      "show": "criminal_intent",
      "corpus": "Bobby Goren and Alex Eames of the Major Case Squad investigate when a multi-million dollar jewelry heists also results in three bodies, one perpetrator and two innocent bystanders. The robbers are professionals who use disguises and dispose of all evidence. Signs are discovered that point to mafia connections, which end up being a smoke screen. The detectives use a sting operation to catch one of the gang, who is the man responsible for creating false identifications. He gives up the gang leader when A.D.A. Ron Carver takes the death penalty off the table for the murders. It turns out the gang leader has an extensive record in several states as well as in Canada. Goren and Eames go after him when they discover he has fled and left his girlfriend behind. She is convinced to cooperate after Goren appeals to her emotions. Thanks to her help, the mastermind is caught and justice is served."
    }
  ]
}