{"episode_recaps":[{"episode_title":"The Good","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-good-730601\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"On Fire","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/on-fire-730600\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"To the Bone","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/to-the-bone-730599\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"The De Pinna family's plans to move from Staten Island to Connecticut are literally and viciously cut short by machete-wielding home invasion robbers. The bodies are found by the De Pinnas' real estate agent when she brings a prospective buyer to the house. Before Logan and Barek go inside, a Staten Island homicide detective cautions them that \"it's like Charlie Manson in there.\"The scene is gruesome indeed. In the living room are the mutilated, bloody bodies of Ellis and Susan De Pinna and their young daughter Tina. Ellis' hand was cut off, presumably to get the combination to a now-empty safe. The body of the De Pinnas' teenage son, Lucas, is in the kitchen. He was brutalized even more savagely, burned with cigarettes in addition to having several fingers cut off.  Logan observes that the robbers entered through the kitchen, the one door not connected to the home security system. The real estate agent tells him about an online tour of the De Pinnas' house on her company's Website. She shows Logan the online photo of the kitchen, and zooms in on the alarm control panel. The phrase \"Kitchen Door Bypass\" is clearly visible on the panel display. A desk calendar indicates that Tina De Pinna had a sleepover at the Chopauers' home the night before. The couple are horrified to learn why Susan De Pinna hadn't let them into the house when they brought Tina home. (When Susan answered the door, Tina ran inside before her mother could say anything.) Recalling their conversation with Susan, the Chopauers are devastated to realize she'd sent them an SOS. She'd pointed her finger at her head like a gun indicating intruders, then flashed four fingers indicating four of them.Barek observes that the robbers took only small, easily carried top-quality valuables. Deakins comments that a crew this good will strike again. The realty company traces one recent visitor on its Website to a laundromat in Bedford-Stuyvesant. That user spent two hours taking virtual tours.A laundromat employee tells Logan and Barek that the previous Monday, two young men -- one tall, one short -- monopolized a computer for two hours. While Shorty was on the computer, Tall Guy kept swiping his headphones. Eventually Shorty made a phone call, then handed the phone to Tall Guy. The other person on the phone calmed Tall Guy down. Logan comments that a cool head is running this crew.A police technician determines that Shorty and Tall Guy had toured outer suburban homes worth at least two million dollars. The last house they cased was the De Pinnas'. Barek suggests they may not need more virtual tours to find their next target. They tortured Lucas De Pinna, and \"rich kids know other rich kids who live in big houses.\"The detectives return to the De Pinna home, where cigarette ash was found on the carpet in front of a bulletin board in Lucas' bedroom. The board is a collage of photos from a school tennis team party, held at someone's home. Some photos are missing. Logan reads aloud the team members' names from a school yearbook, while Barek studies the photos for clues to match a name to the house. Barek recognizes the name \"Rabinth Khan\" as Indian, and spots a large jade statue of the Hindu god Ganesh in one photo. Logan and Barek obtain the Khans' address and make tracks for their house. They arrive just too late to save the Khans from the same fate as the De Pinnas. Rabinth's body has been sodomized as well as mutilated. Logan spots an earphone bud on the floor, and remembers that Shorty in the laundromat had had earphones. The Khans' expensive jade statue is gone, as are other valuables like jewelry and flatware. However, other items like a reproduction metal statue are still there. These robbers know the good stuff from merely decorative items.Skin cells from the foam cover of the ear bud came from Antonio Mattini. The police have his DNA because he has a felony record for assaulting a child. Antonio is also a former foster child who aged out of that system two years ago. His last known job was at a burger joint, from which he'd since been fired. The burger place knew him as Jacopo Santiago, and at Barek's request provides his social security number. NYPD Lieutenant Lemoyne introduces Logan and Barek to Antonio's former foster mother, Chesley Watkins. Watkins, who once worked for the foster care agency, says she hasn't seen Antonio since he aged out of the system. She also acknowledges that of all the children she raised, he was her bad seed.\"Santiago's\" SSN leads to Antonio's current job at another restaurant, where he works till midnight. The detectives stake out the place, to see if his other three pals show up. They do, confronting Antonio inside and pushing him around. A fourth, unknown man arrives and intervenes, at which point the three turn on him. Logan and Barek rush in as two of the attackers flee the restaurant, Logan repeatedly shouting, \"Police! Police!\" The fourth man pulls a gun on one of the fleeing men. Logan orders the gunman to drop his weapon. When the gunman instead swings his gun in Logan's direction, Logan shoots him. The gunman turns out to be a fellow cop, Officer Tarkman. Tarkman is rushed to the hospital, as a deeply shaken Logan tries to absorb what's happened. Barek tells a sergeant that Officer Martinez, the first uniformed officer on the scene, had arrived too late to see much. The sergeant says Martinez said the same thing. However, the restaurant employees support Barek's account of events, including the fact that Tarkman never identified himself as a cop to her and Logan. Their statements will carry more weight with Internal Affairs than anything Martinez could say.Back at the squad room, Barek learns that Tarkman received a phone call 15 minutes before he arrived at the restaurant. He then left his partner, saying he had urgent personal business. Furthermore, Tarkman was in foster care for seven years during the same period that Antonio lived with Chesley Watkins. Deakins is notified that Tarkman died at the hospital, which sends Logan into an even deeper emotional pit.From the restaurant security video, Logan identifies the attackers as Floyd Bolton, James \"Jimbo\" Duncan, and Carlos Espilla. All three are former foster children who lived with Chesley Watkins at the same time as Antonio and Tarkman. Tarkman was working undercover and had a department-issued cell phone; only his team members should have had the number. The time-stamped video shows Antonio working at the time Tarkman received his phone call. Logan also observes that Floyd, Jimbo and Carlos tackled Tarkman as if they'd been waiting for him. Watkins knew the police were looking for Antonio. Somebody brought all the family members to the table.Logan and Barek question Lieutenant Lemoyne about Watkins. Watkins had resigned from the foster care agency to care for her now-deceased husband, and started taking in foster children at that time. The only way to get Tarkman's confidential phone number is to call Central from a police department internal line. Barek reminds Lemoyne that Watkins had been alone in his office when he brought Barek and Logan in to meet her. Lemoyne confirms that someone requested Tarkman's confidential number from his phone.The detectives visit Watkins at her home. She is quietly but unmistakably outraged at the police over Tarkman's death. She denies making any phone call from Lemoyne's office. They show her photos from the De Pinna and Khan crime scenes, and tell her they suspect her former foster sons of committing those crimes. She says her boys would never have done such a thing, and orders the detectives to leave. As they head out, Barek spots art books and auction catalogs in a bookcase.Logan learns that the foster care agency originally had exempted Watkins, as a former employee, from a psychiatric evaluation required of all foster parents. Six months ago, the agency tightened its standards. When Watkins refused to undergo the psych evaluation, the agency took her children away. No children, no foster parent income = motive for robbery.With Watkins at his side, Antonio appears at a press conference where his lawyer announces that he's voluntarily turning himself in for the De Pinna and Khan robberies and murders. He's sure he'll be cleared of the charges. Watkins pointedly tells reporters that she's already lost one son to the police. She hopes they'll take better care of this one. Antonio refuses to believe that Watkins set him and Tarkman up to be killed. At Rikers, he's taken to the infirmary for a previously unknown asthma condition. While he's left handcuffed and briefly unattended in a corridor, someone fatally stabs him. Logan fumes that Watkins had planned it this way: eliminate Antonio, and blame his death on the police. Meanwhile, TARU has been working on Barek's theory that the robbers photographed the crime scene loot with a camera phone, and e-mailed the photos to Watkins. She then determined which items were worth taking and e-mailed her answers back. Cell phone e-mails containing photo files have a distinct electronic signature. TARU has located multiple transmissions of this kind during the robbery timeframes in the DePinna and Khan neighborhoods. The e-mails were exchanged between the same no-name cell phone and an untraceable file-sharing account. They trace the phone signal to Floyd Bolton. He is arrested in his car, and machetes are found in the trunk.Jimbo Duncan and Carlos Espilla are arrested as well. The three men are interrogated separately, but only Bolton cracks and implicates Watkins as the mastermind of the robbery scheme. The machetes in his car had never been used. Therefore, Floyd's testimony is of limited help without either additional evidence, or corroborating testimony from Jimbo or Carlos. Watkins is brought in for questioning. She and Logan have a very emotional discussion about their respective maternal feelings and hang-ups, culminating in her asking for a lawyer. Watkins has played Logan like a violin, just like her boys.Because of the machete aspect of the crimes, the arraignment judge denies bail to all four defendants. Before they leave the courtroom, Watkins gives Bolton a knowing look. Outside the courthouse, Barek comments that the longer Jimbo and Carlos are in prison, the weaker Watkins' hold over them will become. Suddenly, there's a big commotion nearby. Floyd lies dead on the pavement, having broken away from his guards and jumped out a sixth-floor window to his death. Logan looks up and exchanges knowing stares with Watkins, who is being placed into a police van.In Deakins' office, Carver says that Watkins' lawyer has asked the judge to dismiss the charges. Jimbo's and Carlos' lawyers will surely do the same. Without Floyd's testimony, those requests will be granted. Carver tells the detectives to let him know whatever they need to put Watkins back in jail. As Carver leaves, Deakins receives a message that Internal Affairs wants to talk to him about Officer Martinez. They've also told Deakins to bring his CEA representative with him."},{"episode_title":"Cruise to Nowhere","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/cruise-to-nowhere-715552\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"The Healer","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-healer-715553\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Vacancy","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/vacancy-692060\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Dramma Giocoso","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/dramma-giocoso-687295\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Wrongful Life","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/wrongful-life-677574\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Wasichu","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/wasichu-672833\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Proud Flesh","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/proud-flesh-629767\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Watch","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/watch-621322\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Slither","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/slither-611534\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"This episode begins with a couple, whom we later learn are the Corbetts, dressing up for a night out and discussing the jewelry and watches they have brought out for the occasion. The doorbell rings, and the scene cuts to the party where Monica Corbett is talking to Bernard, a man who is apparently a helpful acquaintance. Bernard speaks to a man whom we later discover is Wes Banyon, a writer. Also at the party are a blonde woman, Sammie, and a man with an accent (Marcel). When Russ Corbett becomes apparently drunk, Bernard escorts him away for a coffee.Next, Russ Corbett is at work, looking very unwell. He tells a colleague he has the flu. This same colleague brings to his attention the fact that Corbett's work is error-ridden.At another party, both Russ and Monica are exhibiting the same symptoms of a \"flu.\" Monica stumbles into the kitchen and searches in the refrigerator for something. Instead, she finds something which causes her to scream and drag her husband out of the party. Outside the building, they are set upon by two people.Later, and in another building, a man has called the police to evict two squatters from a room. The police officer enters and finds Russ and Monica Corbett, in their underwear, lying on a mattress. Russ Corbett is dead and Monica doesn't appear to be in her right mind.Detective Eames speaks to a colleague of Russ Corbett's outside the morgue, who tells her that the Corbetts were from Grand Rapids and had come to the city for work. He says that the bank for which Russ Corbett worked had leased the couple a comfortable townhouse, and they had no reason to be in the dingy hotel where they were found.Detective Goren is making his own examination of Russ Corbett's body and notices he is wearing fake tan and has waxed his eyebrows. Goren and Eames then go to speak to Monica Corbett, who is staying in a psychiatric hospital and does not make much sense. She does, however, mention two names - Bernard and Sammie.Goren and Eames are taken by a real estate agent to the Corbett's rented townhouse. They discover that the place has been stripped bare of all furnishings and even things such as light fixtures. The real estate agent tells them that the fittings would be valuable, as the house has a famous designer. They notice, also, that in one room a pressed-in ceiling of Venus on a shell has been pulled out of one of the rooms.Back in the squad room, Eames tells Captain Deakins the Corbetts had fallen into a party lifestyle since coming to New York, and Russ Corbett's work had started to suffer. Goren is on the computer, trying to locate some potential buyers for the things stolen from the townhouse. He finds that a house in Harlem by the same famous designer is being restored, and decides that the restorer would be likely to pay a good price for the fittings.The detectives go to talk to the restorer, who denies any knowledge of the Venus on the shell ceiling, but Goren pretends to find a cone nail, used for installing such ceilings, and they use the threat of a warrant to pressure the restorer into talking to them. The restorer admits to buying the ceiling out of a van from some people on a street corner. Goren reveals that his hand is empty, and he didn't actually find a cone nail.There is a scene between Marcel and another blonde woman, with whom he is arguing in an apartment. Marcel insults her and tells her that she messed up, that \"those hicks should be dead.\"Goren and Eames take a look around the street corner where the restorer said he bought the ceiling, and Goren finds dried blood. A frantic-looking real estate agent comes out of the building and, seeing the detectives, ushers them in to see that the apartment has been stripped of everything, just like the Corbetts' townhouse.The apartment is the same one the Corbetts had been partying at the night they were attacked. The real estate agent says that the apartment was leased to a screenwriter named Wes Banyon, who hadn't been forwarding his rent, and so the estate agent was trying to find new tenants. Goren and Eames look in the refrigerator, which hasn't been carried away, and find the severed head of Wes Banyon in the vegetable crisper.Back in the squad room, Eames talks to Wes Banyon's backer who says he was working on a big screenplay and who is not too broken up about the murder. As he is leaving, Goren walks in with some pictures of a body which police had earlier found which matches Banyon's head. The cause of death was a blow to the back of his head. Eames receives a phone call and tells Goren that a fingerprint found on the refrigerator comes back to an heiress missing in Hong Kong since 1985, named Hilary Marsden.The detectives meet with Hilary's younger sister, Mala, who reveals that while Hilary was in Asia, so called her family to tell them that she was going to marry her soul mate, then was never heard from again. Mala, an artist, has painted a portrait of a blonde woman who Goren suggests looks like Hilary. Mala says it is just a woman she met at a party, and gives them the details of a party invitation service.Goren and Eames go to the office of the party invitation service and meet Bernard, who runs the company, and his assistant Sammie. Bernard admits that the Corbetts were on his list, although they weren't his kind of people. Goren mentions that Russ Corbett used fake tan and waxed his eyebrows and points out that Bernard does the same. Bernard and Sammie deny knowing anyone named Hilary Marsden, but Goren asks for a list of their clientele. Goren thinks he sees another blonde woman in the office, but Sammie denies there is anyone else there. Goren also finds a can of hairspray for color-treated hair and asks Sammie if she is a natural blonde, which she says she is but that Bernard likes her to dye her hair a different shade of blonde, hence her need for the hairspray.As the detectives are leaving, they tell Bernard their names and Goren thinks that Bernard looks as though he recognizes them, but Eames does not. Eames says that Sammie is a natural blonde and would not need the hairspray, but someone who had gone from brunette to blonde would.They visit a hairdresser who recognizes Hilary Marsden's picture, though she is a brunette in it and is now a blonde. He says that Hilary is a real estate agent and is always asking him for the names of wealthy people who are visiting New York, as he gets referrals from the best hotels.The detectives get Hilary into their interview room and tell her about her sister seeing her at a party. Hilary tells them about how she re-entered the country on her Irish passport and how things didn't work out with the 'soul mate' she was going to marry in Hong Kong. Goren jokes that Eames also has famously bad taste in men, but Hilary is adamant that her 'soul mate' is perfect and she was the one at fault. She admits to having treated Wes Banyon as a client, but denies knowing the Corbetts. Meanwhile, Mala has hired a lawyer for her sister.Bernard, Sammie, Hilary, Marcel and Mala are all sitting around having drinks, when Bernard accuses Marcel of making a stupid mistake in leaving Banyon's head in the refrigerator where it could be found. Marcel realizes he has been drugged when he cannot move his arms, and Bernard starts to strangle him with his own tie. He then gets Mala to finish the job as an initiation.After having recovered, Monica Corbett tells the detectives in the squadroom about how it was her and her husband's dream to live in New York and Bernard and Sammie became a part of that dream. She is able to identify them from the pictures, but cannot remember anything about the night she was attacked.The detectives have pulled similar cold cases involving wealthy out-of-towners who were drugged, killed and their homes stripped. As Goren says, however, Wes Banyon was not a wealthy person and so doesn't fit the profile. They also get some information on Bernard, revealing that despite the bevy of blondes accompanying him in New York, he is actually married to a woman named Eileen who lives in London. They also receive a report from the 27th Precinct about a robbery in which Wes Banyon was suspected, except that Banyon was already dead at the time of the robbery.They go to an office Banyon was renting where he did his work and which was stripped clean, like his apartment. They find out that Banyon used an ancient typewriter, which they easily find in a typewriter store and retrieve. The store owner gives a description of the man who brought it in which matches Marcel. Goren takes the typewriter tape and begins painstakingly transcribing the letters from it in an effort to find out what Banyon was writing about, as this is what seemed to get him killed.They get a call from someone requesting \"Inspector Goren,\" who turns out to be Bernard reporting Marcel's murder. He agrees to go down to the squadroom to talk, and the detectives ask him his marriage, the blondes, Marcel and Hilary. He says that Marcel was gay and that he liked the rough sort, and denies knowing Hilary. Goren notes that he has an accent and asks whether he speaks any Asian languages. Bernard says he speaks Mandarin and Goren asks him to translate a Chinese menu, but Bernard calls his bluff and does translate it. Goren then notices that Bernard speaks Mandarin with the accent of another Asian language. After Bernard leaves, he goes to the boards on which he has transcribed the letters from the typewriter tape and pulls out the name of a prison in Thailand. Wes Banyon was writing a screenplay about Bernard's life.There is a scene of Bernard and his three blondes - Sammie, Hilary & a newly dyed Mala - at a party, where Sammie has become jealous of Bernard's new girl.Goren and Eames show Deakins a picture of Nicole Wallace's arrest in Thailand, which shows Bernard (who went by a different name then) beside her - the boyfriend with whom she was arrested.The detectives speak to Carver in his office about Nicole and Bernard's time spent in jail in Thailand. Nicole got ten years for the murders, whereas Bernard got eight, and got out of jail with the help of smitten heiress Hilary. Goren says that they shouldn't pay attention to the 'evidence' found in Marcel's murder, of the footprints of various male prostitutes, because that is what Bernard wants them to believe. He says that Marcel was killed as punishment for messing up Banyon's murder. Carver warns that Bernard may still be in contact with Nicole.Goren and Eames discuss the fact that Nicole and Bernard were caught when their victims' passports were found in their luggage. Eames calls this a rookie mistake, and they begin to suspect that Hilary planted the passports in a bid to get Nicole, whom she was jealous of, in jail and Bernard for herself.They meet up with Sammie and Hilary in a shoe store and invite them to look at photo arrays to see if they can pick any of Marcel's 'dates', suggesting to them that Bernard would be pleased that they were helping to prove the cover he concocted. Hilary is hesitant, but Sammie agrees and they both go to the squad room.In the interrogation room, Hilary refuses to pick a face out of the array, but Sammie does and that photo turns out to be of a police officer. The detectives say that Hilary is better trained by Bernard, so he must love her more. Sammie says that Bernard loves her more, that they are soul mates, and are getting married. Hilary tries to leave and says that Sammie isn't involved and doesn't know anything. She is protecting Sammie because she is afraid Sammie will say something to incriminate Bernard. She says that Marcel drugged the Corbetts and Banyon and that she herself then killed him.Sammie is sent out of the room, and the detectives tell Hilary that they don't believe her story. They say that she is obsessed with Bernard, even having plastic surgery to fit his idea of a perfect woman. They tell her that the only reason Bernard is in town is because Nicole is in New York as well, and they suggest that Hilary planted the passports to get Nicole out of the way. Hilary says that Nicole planted the passports herself, hoping to get Bernard in jail because she hates men and was bound to betray Bernard, although he couldn't see that in her. She tells them that Wes Banyon was meant to write a hero's journey script about Bernard's life. She insists that Marcel is responsible for the murders, and that she then killed Marcel.Carver tells Eames if Hilary wants to fall on her sword, let her. Goren, meanwhile, has been trying to make out Banyon's script from the typewriter tape transcripts and finds that it is not a heroic tale at all, but the story of a common criminal.In the interrogation room, Bernard talks about the script, saying that he had read it and that it told of all the languages he speaks, his fine taste in clothes, etc. He denies being in contact with Nicole and calls her a natural killer, and says that she would have been a murderer even without meeting Bernard.Goren says they found a copy of Banyon's script in Hilary's apartment and he and Eames read out portions of it, demonstrating that it is actually an unflattering and humiliating account of Bernard's life. They tell him Hilary broke and exposed him.Bernard gets very angry, and says that Banyon was meant to write \"a hero's journey,\" and when he read the real script he was enraged and hit Banyon over the head. With his confession secured, Goren reveals that Hilary did not actually betray him.Bernard, Sammie and Hilary go before the Arraignment Court and the judge orders $2 million bail each. Mala pays Bernard's bail and they walk past Goren and Eames outside the courtroom. The detectives hear a scream and rush to find Bernard lying dead on the stairs and Mala hysterical. She says that a woman just came up on the stairs and bumped into him, then ran off.Goren opens Bernard's jacket and finds a syringe has been stabbed into his gut - one of Nicole Wallace's favorite forms of murder."},{"episode_title":"Dollhouse","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/dollhouse-606814\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Scared Crazy","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/scared-crazy-578410\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Saving Face","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/saving-face-552222\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"In the Wee Small Hours (2)","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/in-the-wee-small-hours-2-536515\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Coming soon"},{"episode_title":"In the Wee Small Hours (1)","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/in-the-wee-small-hours-1-536509\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Acts of Contrition","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/acts-of-contrition-459789\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Unchained","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/unchained-522894\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Prisoner","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/prisoner-459788\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Diamond Dogs","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/diamond-dogs-498946\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Grow","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/grow-498945\/recap","nth_season":5,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""}]}