{"episode_recaps":[{"episode_title":"Renewal","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/renewal-1061811\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Endgame","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/endgame-1061341\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Bombshell","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/bombshell-1006127\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Rocket Man","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/rocket-man-1006128\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Silencer","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/silencer-1006126\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Players","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/players-1001071\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"30","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/30-967360\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Brother's Keeper","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/brothers-keeper-967359\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Flipped","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/flipped-963974\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Albatross","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/albatross-935836\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Privilege","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/privilege-941703\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"World's Fair","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/worlds-fair-937618\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Weeping Willow","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/weeping-willow-913603\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Blasters","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/blasters-907821\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"The War at Home","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-war-at-home-913601\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Country Crossover","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/country-crossover-903276\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"At first we see the typical recording and music behind the scenes tape a video, and then a noise???Our team comes in and the first thing Wheeler observes and reports to Logan is the body(Curtis) while thrown by a car his hands are cut and bloody but there is glass here to cut him and other than that he looks untouched...Logan notices a open door and the team enter a bloody room with lots of glass, a recording studio. Possible break in? Logan disagrees and we hear that Wheeler dated a recording engineer. Logan\"oo look cocaine in a studio I am shocked \" ha haWheeler questions Logan decision and wants to call the caption.Next Logan is on the phone and hears Ross yelling at Wheeler about people waiting for him to fall on his face. Logan asks Wheeler what is up and she gets defensive. Logan thinks the case should go back to the 1 five instead of them as they walk to the elevator. Wheeler says they are taking the case because the 1 five is over loading and the tipping point of an out break. Logan doesn't understand her slang and she makes fun of him.Visiting the morgue the guy had two blows to the left side and he died from \" being punched, \" and bleed to death. He had a disease rare for bleeding, was scheduled to have spleen removed and blood test was clean no cocaine!!! Wheeler thinks the killer panicked and Logan says very dryly that the killer knew about the disease. Wheeler tells Logan he is a glass half empty guy.Visiting the last recording artist, Logan's wearing dark glasses making him very sexy. Megan has a hard luck story. Logan inquires if she was single and the relationship between Megan and him. Megan is married but her husband thought Curt (victim) was gay. She was at studio but claims that they ended early because friends kept stopping by, one from across the street. Logan is very interested as he knows Shamus Flarity club owner and GFD Brook. Curt refused to play a Cd and didn't want Shamus to have drugs at studio.Next we find that Logan and the owner of the bar go way back. Shamus says nothing happened. Logan doesn't believe him and wants to know about the bouncer \"big black guy\" that has not been seen since Thursday.At another club the team looks for the \"black guy\" and Wheeler teases the door man. He tells that \"gormen\" is scary and does freak out over little things and is a professional fighter.We go to the \"hood\" where the suspect is working out in a play ground with kids everywhere. Logan is worried but approaches asking him not to move, Wheeler lays back looking scared and watchful. No event, he shakes hands with Logan and says he wants to join them.Back at squad room the talk to Goral \"gorem\" as he explains his religious belief and meaning of his name which is \"crisis.\" He studies Chinese. Thursday he wanted Curt to listen to his CD but Curt was busy. Now he wants to get back at the killer because with Curt dead he will not get his chance at star status. Logan is not impressed. Wheeler hints that the killer they feels looks like a person like Goral, he agrees with Wheeler and says that he is looking for the same man in his own investigation of the murder. He feels he must protect his block.Logan talks to the Ross but Ross has no reason to hold him even if Goral is trying to get revenge on the killer. Ross is asking Logan his motives to keeping Goral and Wheeler is quiet. Ross ignores Logan's response and talks over him to Wheeler. Wheeler backs Ross and Logan gets upset. Ross blows off Logan's thought and Wheeler will not stand up to Ross and lets Logan hang out dry.There was a hit on the coke bottle print and GF Brook. Interview with Brook she denies at first but tells that Goral beat a man and through him off two stories. Shamus and goal have back round.Old Open case reminds Logan of mob hit and how Goral was working there too. Wheeler wants to keep Ross in the loop but Logan blows it off.Goral's apartment. He has gun and listening to music, next he is walking street and toward the club with gun. He attacks and Logan and Wheeler draw their guns on him. He goes quietly.Squad room Logan gets mad because they want to set Goral free. Ross disagrees with Logan and Wheeler tells that connection Logan had to the mob hit with Goral. Ross is upset with Wheeler for not telling him right away and Ross gives Logan a unhappy look.Interview of Goral he admits to the killings last year but it was not mob, he claims that he did it because they where bad men and sold drugs. He is on a quest to save. Goral says Flarity told him but didn't ask him to shoot them, he did it for justice. Goral denies killing Curt but pulls out a paper from Curt. Flarity told Goral to take good care of Curt when he came in the club because he was an investor. So he saw him as a \"good man.\"Squad room Ross is getting update of investors to club. Ross says follow the money.Interview with Flarity, Wheeler is back talking Flarity as he talks around the questions. Flarity claims that Goral left because he was \"monk\" and claims knowing nothing about the murder at the old club. Logan question where he was for the first killings was. Wheeler brings up that Curt had a lawsuit against Flarity for a million dollars related to Flarity' s fraud old club. Flarity blows it off; Logan wants to know where the money is coming from. And since the mayor wanted the neighborhood cleaned but including the clubs. Motive makes Flarity says that when he left \"May\" the girls from the first interview (singer) was with Curt and claims she and him had a \"fling.\"Claims she bought him a trophy and a love note on the bottom.Visit to May's apartment, husband is \"man\" of the house and tells May to serve them. Logan drinks tea as Wheeler interviews. The husband calls May a star and claims Curt was gay. Logan asks may and May is cut off by husband. Husband Zack claims they watched DVD together at home. Logan doesn't believe him and Wheeler makes fun of Logan.Interview of Zack's coworker and tells how devoted he was to her but everyone knew about Curt and May but Zack. So his friend told him and Zack had told him he would scare Curt.May's apartment with warrant and Zack doesn't like the search. Wheeler finds the trophy that May gave Curt in her dresser. Zack is upset over what the love note on the bottom means. May finds out that Zack knows about the affair. As they arrest Zack, May cries that she can't let him take the blame for her and Zack tells her to sit in the chair and not say a word. She admits to Logan and Wheeler that she killed him.In the interview room May states she had to sleep with Curt because she was afraid of Curt. She claims she told Curt that she was ending it because she loved her husband and was going to tell Zack everything. She then stated she came home and told Zack everything and she went upstairs. Wheeler asked why would Zack let he go confront Curt alone. May stated that Zack wanted to show Curt a lesson but May refused to let him talk to Curt so she could walk away with dignity.May claimed Curt didn't want her to go and he kissed her so she hit him in the face and abd lower. She doesn't remember if she kicked him or not but she says she wasn't trying to kill him it wasn't that hard of a hit. Wheeler questions about Curt's disease and May says he wasn't sick. Ross calls Wheeler out of room.They discuss who is protecting who.Logan and Zack interview room. Zack says Curt raped her. He says he hit him in the face and Curt fell down and hit his head, he stayed down and didn't get up.Wheeler gets a hot dog as Logan talks to the ADA while getting coffee, she says this is a first she had couple blame each other but not defend each other. Logan says \"true love\" and the ADA calls it a strategy. ADA wants May motive and Logan says that Curt told her about the disease and Zack said didn't that is while he only confessed to the hitting of his head. The ADA agrees but to get Zack to turn on his wife they decide to let May go and put Zack in jail for assault to make him talk. ADA wants new evidence or break up the marriage.Logan and Wheeler set up May to show Zack she is not who he thinks he married. They use Flarity to help set May up. Wheeler tells May to use the poor victim story to sell Flarity. At Flarity's studio, Flarity claims that Curt loved May. He talks about investors but she asks if he knows what he is doing. He shows May the money and says he doesn't buy the poor girl act. Meanwhile the camera at the studio is taping and Logan brings Zack to watch May with Flarity.Flarity talks about money and what May has to do change for the movie to sell. And Flarity wants May to say that Zack was the devil and May returns with that is not what happened. Flarity says but this is what will sell and her sexiness. And tells her they have to get the movie going so that it hits TV during the trial of her husband and when she takes the stand against him. May is confused and asks why she had to take the stand.Meanwhile Zack is watching them with Logan. He is sad and Logan wants to turn it off but Zack keeps the TV on.May tells Flarity it wasn't Zack's fault even though Zack thinks it is. Flarity says \"whatever\" Flarity tells her about the money. May confesses that Curt was sick and set up Curt because Zack didn't know.Zack runs in the room and tells May and them what she wanted him and told him where to hit him. May says she did it that she slept with Curt for the songs not for lust. She said Zack loved her so much and she loved him, she just wanted to go home and away from the city but didn't want to disappoint Zack. But they couldn't go home with Curt knowing, so she let Zack hit him and set up Goral because she know of Goral pervious murders.Ends with Logan and Wheeler talking that she killed Curt was because she loved her husband so much and it sounds like Country Song but Curt was not there to record it."},{"episode_title":"Masquerade","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/masquerade-897538\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Goren and Eames are at a cart at the airport in Ho Chi Minh City waiting to take custody of Simon Fife who is currently in the custody of the local police.  Goren notices the suspect on TV.  Eames wonders if it's live.  Goren asks the cart vendor, in Chinese, if she knows where that's taking place.  She doesn't.  They look down from a railing and see Fife giving an interview.  They head down there.  Fife insists to reporters that Amberleigh is still with us if we're pure enough to hear her.  Reporter asks why Fife killed her.  Fife says, \"She died… inadvertently… in a moment of intense love.\"  Goren and Eames get to him and Goren tells the reporters that there will be no more questions.  Eames identifies herself as NYPD and says Simon is in their custody now.  Reporters ask Fife if he's ready.  He says, \"Autumn in New York.  It's time to go home.\"In the air, Goren pours a glass of champagne and hands the bottle back to the flight attendant, advising her to keep it on ice.  Eames is sitting across the aisle, and Simon is sitting in the window seat.  Goren remarks that Simon must not fly much since he hasn't taken his eyes off the window.  Simon says he's flown many times, he just hasn't numbed himself to the miracle.  A man a few rows ahead stands up to use his cell phone to take a photo of Fife.  Eames jumps up and orders him to sit down.Fife tells Goren that the reporters have no shame.  They're causing so much pain to Amberleigh's mother, Beth.  Fife says Beth's neighbor, Nate Royce, helped him understand the pain Beth went through.  Fife characterizes Royce as Beth's protector and his e-mail confidante for the last 3 months.  Fife thinks it was Nate who turned him in.  Goren says the DA didn't brief them.  They only found out about this an hour before they got on the plane.  Fife says the time had come for the world to hear the story of a pure love and of a world so corrupt that it had to force that love into darkness.  Fife starts to cry and adds, \" …where it perished.\"A Nancy Grace-like reporter, Faith Yancy, has gotten hold of a photo of Fife sleeping on the plane.  She says, \"They all look sweet when they're sleeping, but this is one sick puppy.\"  She reports that he is finally in NYPD custody after 14 years.  Amberleigh was murdered on Halloween in the basement of her Brooklyn home.  Amberleigh's mother, Bethany Harner, is in the studio, as well as Nate Royce.  Nate explains how Fife e-mailed him because of the book Nate wrote about Amberleigh's murder.Ross has been watching the report, but then he turns the TV off.   Fife is in a holding cell sleeping off the champagne Goren let him drink on the plane.  Goren comments that Fife idolizes children and demonizes adults.  Goren assumes Fife was abused by a parent.  Ross doesn't care about Fife's childhood pain or world view.  The case was given to them because Brooklyn botched it up.  He would prefer if Goren gets to the hard questions before Fife lawyers up.  Goren says he was trying to gain Fife's trust.  Goren raises his voice and sarcastically asks Ross if he wants him to go old school and slap Fife around with a phone book until he confesses.  Ross says he wants the same thing Goren wants – to be absolutely sure Fife killed Amberleigh.The three cops are walking in the courthouse corridor with ADA Shankly, and she is sure Fife killed the girl.  The e-mails were detailed.  But Eames says there is a lot of information about the case that has gotten out there.  NYPD never secured the crime scene, and a dozen people went through the basement before the body was found, so there is no physical evidence linking Fife to the crime.  There was a ransom call from a phone booth from a \"feminine\" voice.  Shankly implies that doesn't rule out Fife.Shankly is ready to arraign Fife but Ross suggests that Fife is \"comfortable\" in their custody.  Ross thinks the longer they keep him the more he will talk.  Shankly says she has to clear it with the DA. Ross tells her to go ahead.  Then he tells the detectives that they are likely to get no more than 24 hours with Fife.  Eames thinks that's not enough to solve such a cold case.  The dad was away on business when Amberleigh was killed and he is remarried and living out west.  So Ross tells them to talk to Beth, despite her not talking to cops since the night of the murder.There is no answer at the door, and Nate shows up and says Beth is away.  Eames asks if Nate ever saw Fife watching the girl.  He says no, but points out how much Fife related in his e-mails.  Goren points out that the crime was bold, but Nate says they shouldn't be fooled by Fife's \"whimsical, child-man character\".  Goren asks if Nate thinks Fife created the persona.  Nate thinks Fife is pathological, not creative.  Goren implies that Nate would know, since he was a novelist in the past.  Goren acts as if he's impressed with Nate finding a way to be of service with his book and website.  Nate says it's been hell for him.  His wife died 4 years after Amberleigh and he's had to raise his son alone.  Eames says Beth is very lucky to have him and then adds that they need to get in touch with her.  He says she won't talk to NYPD.  Eames takes a phone call and Goren points out that they know that mistakes were made.  Nate says he can try to talk to Beth.  Eames finishes the call and informs Goren that Fife is getting antsy.  He wants to speak to Goren.Eames goes in to talk to Fife first.  She says, unlike Goren, she doesn't believe Fife.  Fife explains how he was a nurse at Amberleigh's school.  Fife claimed he made love to Amberleigh but Eames points out that there is no evidence to support that.  Goren and Ross are watching from the observation room.  Fife says Amberleigh's stomach contents should show sesame logs.  He says she loved them.  Goren looks in the file and that's been blacked out.  Eames turns and looks towards the observation room.Eames goes into Ross' office, and he reports that the M.E. confirmed the stomach contents.  Eames is afraid the case is going to fall apart again and that the DA's office will spin it to make the police once again look bad. Eames says the ransom call said they had their \"whore\" daughter.  That's inconsistent with how Fife felt about Amberleigh.  Ross tells them to get a search warrant for the home and talk to the detective who was first on the case.  Eames says it wasn't a detective, it was a rookie: Linda Bonnardi.  Ross knew that but had forgotten.  Linda had been on the force only four months at the time.  Eames attended the academy a year later and says they were using Linda as proof that women were too emotional to be cops.  Linda left the force in disgrace.  Ross tells them to find her.They do find her and meet her at Beth's house.  Beth is still away.  Linda says that Beth went to the bedroom at 4 am and found Amberleigh was gone.  The ransom call came in 10 or 15 minutes later.  They said they'd call back at 6 am and warned Beth not to tell anyone, but she called the police.  Linda's partner, Matt, interviewed Beth while Linda searched the house.  Linda says that was a big mistake.  Beth had made phone calls before they arrived and people kept showing up.  Specifically, Nate, his wife Madeline, and their son.  Linda says she didn't call for backup because she thought it was a prank.  She simply didn't believe Beth.  Inviting people over seemed inconsistent.  And at 6 am Beth was on the phone.  Linda told her to hang up so the kidnapper could get through.  Goren asks who went into the basement.  Linda says she did with Beth.They go down.  Linda says nothing has changed.  Goren checks the outside door.  Linda says it was closed but it wasn't locked.  She says Beth noticed it right away.  Linda noticed that the dryer door was ajar.  At first she thought Amberleigh was sleeping inside.  She let Beth take the body out.  Linda says she let Beth lead her to the body.  Linda thinks Beth killed the girl.  Linda adds, \" …and because of me she got away with it.\"  They go outside and Eames thanks Linda.  Linda says, \"Don't let her get away with it this time.\"  Linda gets into her car and Eames remarks to Goren, \"She was a female rookie, wanted to prove herself, ended up making it harder on the rest of us.\"  Goren says Beth's behavior was strange but it's a rookie mistake to think that strange behavior equals guilt.  Goren then motions his head over, and Eames sees he's pointing out that Nate is still \"on duty\".  Goren also notices that Nate is on the phone and he wonders who Nate is talking to.The go to talk to him.  Goren asks if Nate is writing a new book about the case.  Nate admits he's polishing it up right now.  Goren sees it on the desk and starts looking.  Nate closes the folder and this gives Goren the opportunity to grab the phone and asks him to put them in touch with Beth.  He says Beth would kill him.  Goren says he could just hit the redial.  Nate emphatically asks him to put the phone down.  Nate says he's only trying to protect Beth.  Nate says Beth told him that she never met Fife.  Eames says, \"We like to get our information first hand.\"  Eames implies that if they have to get a subpoena for his notes it might delay the publication of his book.  Then Nate's son, Jamie, comes in.Nate decides to cooperate, and they meet up with Beth in Amberleigh's room.  Beth says the NYPD never believed a word she said.  Beth says she'd take Amberleigh to school every day unless Amberleigh was working.  Then they'd run lines for her auditions.  Goren remarks that Beth was an actress, too.  Beth says no and says that Amberleigh was \"truly gifted\".  Beth says that all she, Beth, did was dance in the chorus of a couple of shows.  Goren says Beth's talent wasn't wasted – she gave it to Amberleigh.  Beth is touched by his comment.  But Beth also gives credit to Jenna, Amberleigh's acting coach.They look at Amberleigh's last commercial at Jenna's home.  She says it never aired.  She agrees that Amberleigh loved acting, but says she was unhappy about this commercial shoot causing her to miss the start of school.  Jenna says Amberleigh was a professional and didn't let her unhappiness show on camera.  Eames asks about the dates.  It's on the sleeve of the tape box.  It was the first 2 weeks of September, 1992.Goren interviews Fife.  He says he jimmied the lock on the cellar door.  Goren says it wasn't jimmied.  It was unlocked.  Fife insists not.  Goren changes the subject and asks what Fife usually did on Halloween.  Fife says he stayed home and handed out candy.  Goren suggests it must be Fife's favorite night of the year with the kids coming by.  Goren asks why he went out.  Fife remembers that Amberleigh was dressed as a genie.  We see Shankly, Eames and Ross in the observation room.   Fife volunteers that he remembers the little yellow dress she wore on the first day of school.  Then Goren points out that Amberleigh was never in the school with Fife, who only worked at the school for two weeks.  She was in Los Angeles for the first two weeks of the semester, and he was fired before she returned.  Fife says he must have learned about it in an e-mail from Beth.  This is the first they've heard about this.  Fife says Beth made him promise not to tell anyone.  Fife asks Goren to keep the secret.  We don't see Goren's response, if any.Fife agrees to enter a monitored program.  Ross says Shankly is not happy that her case was ruined.  He  says it's now up to the detectives to solve the case.  He asks what their take is on Beth.  Goren says she's off on her affect – smiling when she's upset.  Goren says she craves attention.  So Ross tells them to give her some.We see her putting a turkey in the oven and putting on lipstick and then taking off her glasses and excitedly opening the door when the doorbell rings.  When she sees Eames she notes that she wasn't expecting both of them.  Eames says she's just dropping off her partner.  Beth is now happy again.  As Goren goes in, Eames tells him to call her if he needs a ride home.At the dinner table, Goren says he's sorry that Beth couldn't have closure.  She asks, hopefully, if the case will remain open.  He confirms it will, and she hopes that he will be the one to keep her updated if there is progress.  She remarks that he seems to be dedicated – perhaps overly so.Beth then admits she did it.  She pushed Amberleigh to continue acting.  She reveals that Amberleigh wanted to quit.  It wasn't fun for her anymore.  Goren figures part of that was watching her weight.  He asks how Beth handled the candy on Halloween.  Beth says Amberleigh was allowed to keep 10 pieces.  She had to give the rest away to her friends.  Goren asks if Beth remembers the names of the kids.  Among the names is Nate's son.  Beth says she's never told this to anyone before but the night Amberleigh was murdered she wanted to eat one extra piece of candy.  Beth wouldn't let her have it and Amberleigh went to bed crying.  Goren says there is a good book about grieving.  He can't remember the name right now but he says he can e-mail it.  She thanks him but says she doesn't have the internet.  She says people e-mail things to Nate and he brings it over.Goren and Eames watch the videotape made of the kids looking over their candy.  Jamie was dressed as a prince.  Eames wonders if Jamie knew about Amberleigh's candy binge.The detectives talk to Jamie while walking down the street where kids are seen trick-or-treating.  He says Amberleigh liked sesame logs.  Goren notes that Halloween must be hard for Jamie.  Jamie notes that his mom died on Halloween, too.  She was drinking and had a car wreck.  No one else was hurt.  Eames suggests it must have hurt Jamie a lot.  He insists he's OK.  But then he says he has to go to a Narcotics Anonymous meeting.  Alcohol led to drugs.  He's been sober 14 weeks.  But he was addicted for 14 years.  Eames asks what step he's on.  Fifth.  Goren knows that's to admit the exact nature of your wrongs.  Goren characterizes it further by adding, \"To stop lying.\"   Goren asks if Jamie is ready to do that.  Jamie says he is.Jamie is brought to an interrogation room.  He says on Halloween night, Amberleigh looked so pretty.  She kept trying to tickle him and he says he misunderstood.  Later, he couldn't sleep and he snuck into her house and suggested that they go down to the basement and eat all their candy.  He says he tried to kiss her and she screamed.  He tried to cover her mouth but he accidentally hit her nose instead and she started to bleed.  She started to cry.  He pushed her face into the couch to keep her quiet.  He didn't mean to kill her.  He didn't put her into the dryer.  He went home with blood on his shirt and he told his mom what happened.  His mom told him to go to bed.  He thought his mom was going to go and explain things to Beth, but he waited at his window and saw his mom get in the car and drive off.  Goren figures she went to make the ransom call.  Jamie figures she panicked and forgot to get rid of the body so she hid Amberleigh in the dryer.  Jamie says he'd like to speak with Beth if she'll let him.Goren asks why Jamie e-mailed Simon, pretending to be Beth.  Jamie says he doesn't remember doing that.  But he admits that all his years of drug use have caused gaps in his memory.  Then he asks, \"They have meetings in jail, right?\"  Goren confirms that they do.  Goren asks if he thinks Nate blames himself for what happened to Jamie after the murder.  Jamie says his dad doesn't know about any of this.  He was asleep and Nate assumes Jamie lost it because of his mom's death.Eames and Ross were in observation.  Ross remarks, \"Another day, another confession.\"  He asks if they buy it.  Eames doesn't buy the part about e-mailing Fife.  She says the question completely surprised him.  Goren points out that the e-mails were sent in the last three months.  Jamie has been sober that whole time.  Eames doesn't see how a 12-year-old boy and a drunk mom could have kept the secret from Nate.  Ross suggests that maybe Beth will meet with Jamie.  He doesn't think Jamie will be able to lie to her.Goren reports that he's been unable to reach Beth.  He figures she's having a bad day since it's Halloween.  Ross tells him to keep trying.  He also says they should charge Jamie.  Goren thinks there is a piece missing.  He wonders if Jamie is protecting his dad.  Eames mentions that it seems that Nate wasn't protecting Jamie.  She found Jamie has a case file in the Portland, OR, Department of Child Services.  He was living on the street there when he was 16.  Ross notes that Nate made a career protecting Beth.  He wonders why he wouldn't get help for Jamie.  Goren doesn't know.  But then he figures that Nate didn't want him to get help.  In therapy, Jamie would have talked.  When Jamie is out of control then Nate can control him.  Now that he's in a program, Nate had to worry that Jamie would tell someone what actually happened.  Goren figures that Fife e-mailed Nate about his obsession with Amberleigh and Nate reeled him in.  Ross figures that Jamie won't turn on his father, but Nate is loyal to himself.  Ross turns around and asks Rich to contact Faith Yancy's producer and claim to be the DA's office.Eames shows a tape of the program to Jamie.  She remarks that she really shouldn't be showing this to him.  Jamie thanks her for doing so.  Nate is a guest on Yancy's show.  Yancy asks him if he ever saw Jamie's confession coming.  He says, \"Never in his wildest dreams, Faith.\"  She reveals she has info from an anonymous source in the DA's office.  She says they believe Jamie sent many e-mails to Fife, giving him info that only the killer would have.  Nate says that Madeline was a very sick woman and he fears that she's passed it on to his son.Ross comes in and Eames turns the TV off.  He says he was looking for Jamie in the holding cell.  Ross says Goren reached Beth and she's willing to meet with Jamie.Beth is at Amberleigh's crypt at the mausoleum and she tells her it's over.  Nate is with her.  The detectives arrive with Jamie and Nate is horrified.  Beth says it's all right.  Jamie apologizes.  Beth says he was a little boy.  He says it was an accident.  Beth says she knows and cradles his face in her hands.  She says she forgives him and she says so does Amberleigh.  She takes him to the crypt.  Jamie says he wishes he could take her place.  Nate starts to lead Beth away, but Eames says she'll take her home.  Beth thanks her and says she would like to stay and talk things over with Jamie.  Nate tries to stop that.  Jamie says it's OK – he's ready to take responsibility now.  Nate says this isn't about making amends – there are serious issues here.  Goren points out that Jamie already confessed.  Eames points out that Nate already knows that – they saw Yancy tell him on national TV.  She adds that she and Jamie watched.  Nate explains to Jamie that he went on TV so the public wouldn't turn on Jamie.  Nate says Jamie needs help.  Goren says Jamie is getting help.  He's sober.  Goren says Jamie needed help 14 years ago.  Nate says his wife never told him.  Eames says Nate must have seen that Jamie was in trouble.  He says he was concerned but Madeline refused.  He says she didn't care.Beth has been listening to all this and now interrupts and says that's not true.  She tells Jamie that Madeline cared so much.  Nate says Madeline was a drunk and he says Beth knows nothing about his private struggles.  Eames says Jamie does.  Eames says the caseworker in Portland remembers Jamie because Nate called and asked that Jamie not get counseling.  This confuses Jamie.  Goren says it's because Nate didn't want to risk Jamie telling the family secret.  Goren then accuses Nate of tricking Fife into confessing.  Goren says Fife thought Beth was e-mailing him.  Goren asks Beth to confirm that she wasn't.  Nate says it was Jamie.  Nate claims Jamie just doesn't remember.  Jamie denies doing it.  Nate cups Jamie's head in his hands and says, \"You know I love you.  I have always protected you.\"  Goren scoffs and says the only one Nate protected was himself.  Eames says Jamie could have gotten help but Nate told Jamie that he would do hard time.  Nate tells Jamie not to listen to them.  Jamie scoffs and says his dad has been lying to him for 14 years.  Nate says Madeline made the ransom call and he asks Jamie to tell them.  Beth asks if that's true.  Eames tells Jamie that Beth needs to know what really happened.  Jamie now reveals that it was all Nate's plan.  Jamie saw Nate go into the house.  Jamie talks about seeing the light go on upstairs.  Goren asks Beth if she turned the light on.  She says she turned it on when she heard Amberleigh scream.  Nate insists that Amberleigh was already dead.  Goren asks Jamie if he hit Amberleigh.  He repeats how it was an accident.  Goren points out how the autopsy was in Nate's book.  She had bruising front and back from head trauma.Goren says Nate thought Amberleigh was dead and was going to carry the body out and hide it.  But then something happened.  Goren assumes she woke up and started crying and he heard Beth moving upstairs and he panicked.  Goren accuses Nate of smashing her head and throwing her body into the dryer.  Nate insists it was an accident.  Uniformed officers handcuff Nate and take him away.  Beth says, \"You took everything.\""},{"episode_title":"Bedfellows","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/bedfellows-888993\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Two men are playing tennis.  Their dad expresses disappointment that Ted, unlike Adlai, fails to see the whole court and plans ahead.Later, in couples counseling, Adlai remarks that since his wife, Charlene, has continued to see her lover he thinks they should deal with it.  He wants the lover, August Ferrero, to come to the sessions.  Charlene says it's an affair… the whole point is to break the rules.  She accuses Adlai of ruining everything.Later, Adlai shows his son, Henry, how to mix up a health drink.  He lets Henry smell it.  Henry thinks it's \"stinky\".  Later, from a messy living room, Henry calls 911 and says \"Mommy and Daddy won't wake up.\"The EMTs arrive, and find the couple in bed.  They turn Charlene over and she yells, \"Go away!\"  They drag her out of the bed kicking and screaming.Det. Yaro identifies Dr. Adlai S. Copeland, 30, to Goren and Eames.  Goren knows Adlai as an historian.  Eames notes the smell, and Goren estimates Adlai has been dead two or three days.  Yaro says Charlene was in bed with him the whole time.Eames talks to Henry.  He says Mommy wasn't home when Daddy went to sleep.  Goren looks in the fridge and sees it's empty except for \"Daddy's stinky milkshake.\"At the morgue, Dr. Rodgers says, \"Aside from being dead, he's in perfect health.\"  She describes the stomach contents, and Eames says it sounds like the stinky milkshake.  But Rodgers says there were also organophosphate toxins.  She says they can take a couple hours to kick in and describes it as a nasty way to go.  She's aware of it being used as a suicide method in rural third-world countries, but not in Riverdale.  Goren says Adlai was a meticulous historian.  He wouldn't commit suicide without leaving a note – or leave his son unattended.Goren figures if he was poisoned, then it's someone who knew Adlai's routine.  So they go to the funeral.  They talk to the dad, Jules Copeland.  Goren calls Adlai's book \"exceptional\".  Jules remarks to Ted how even the detective knows Adlai's work.  Ted and his wife, Lena, mention they have to get going.  They're having people over to the house.  Goren asks if Charlene will be attending.  Ted doubts it.  He points out that Ferrero, Charlene's gardener, will be consoling her.Back at the office, Eames tells Capt. Ross that Charlene is a former beauty queen and former pharmaceutical rep.  She broke up a doctor's marriage and then left him for Adlai.  The lab calls and they found the toxin, fenthion, in the kefir bottle.Gus Ferrero is brought in for questioning.  Goren sprays some insecticide on him, making it look accidental.  Goren asks if he knows what it's for.  Ferrero says it makes the plants healthy.  Goren pours some into a cup and says it's very dangerous stuff.  Goren asks if Ferrero would drink it.  Ferrero says no but gives permission for Goren to try it.  Eames points out that Adlai did drink it because someone who had access to the house spiked his shake.  Ferrero says he didn't do it.  Ferrero tries to leave, saying he has to get back to the island.  Then Ross brings in Ferrero's attorney.Goren sees a woman waiting for Ferrero.  Goren introduces himself and she identifies herself as Mrs. Lila Gibbs.  She says Ferrero is her landscaper in the Hamptons.  Then Charlene arrives with her lawyer, Ed Planko.  Eames points out that someone beat her to it.Ferrero comes out of the interrogation room and sees Lila first, kissing on the cheek.  Then he sees Charlene.  He says he'll call her in a few hours.  She asks why.  Lila answers, saying, \"Because Gus has an important job he has to finish.\"  Lila pulls Ferrero out.  Charlene leaves in disgust.Charlene is at home, sitting on the floor of the bathroom, on her cell phone, begging Gus to pick up.  There are empty pill bottles on the floor.    Lena talks through the door and says Charlene needs to be strong now.  Charlene says she can't.  Henry is out in the hall looking on.  Charlene passes out.At the hospital, Ted tells Eames that Charlene has done this before.  Every time Adlai was about to get an award or go on a trip she'd pull some stunt.Goren is talking to Charlene.  She says Adlai knew about the affair but forgave her.  She says she took a train to a spa in Rhode Island on Thursday.  She was hoping Gus would come up there, but he was working.  So she came home and found Adlai.Outside, Goren tells Eames that Charlene is a full-on borderline.  The more drama she creates outside herself the calmer she gets.They go to talk to Jules at his office.  Jules mentions that as a graduation present he gave each son a summer to do whatever they wanted.  Adlai went to a reservation to teach Cherokee children to read.  Ted went to the French Riviera.  He blew through his trust by time he was 25.  Eames is looking through documents and sees that Adlai invested $3 million in one of Ted's real estate deals.  Jules recognizes the property as where Ted and Lena used to live.They talk to the current treasurer, Fellows. Ted was treasurer at the time.  Fellows says Ted embezzled $2 million.  They dropped it when Adlai made restitution and made Ted move out.  Lena was mortified, but Ted was shameless.Ted and Lena are at the clinic asking Charlene to sign important documents. She says she will, but is unhappy that she's signing over guardianship of her son.The forensic accountant says Ted is involved in a huge Ponzi scheme.  The deals span four states, but all the documents were notarized by one man in Poughkeepsie.  It seems Ted simply got a notary stamp.  Ross thinks Adlai was an easy mark so Ted would want him alive, but Eames finds a letter where Adlai says he won't invest in any more of Ted's ventures.  Goren figures Ted might have thought he'd have better luck with Charlene.Ross tells them to bring Ted in to prevent him from running before they can make the case.  The detectives arrive and find the door ajar.  They find Ted dead with blood on the carpet.Ross arrives and notes that Ted went from suspect to victim in record time.  There were two shots with a .22.  The first missed.  The second grazed Ted's temple.  That was enough to make him fall back.  And then Ted was stabbed with scissors in the stomach.  Ted tried to crawl away.  The killer then hit him with a statuette of a bear.  The safe was hacked at, but remained unopened.  Ted's wallet wasn't taken, but the files were ransacked.They ask Lena if Ted suspected Charlene of Adlai's murder.  She says no.  They ask about finances.  She says Ted assured her things were about to turn around.  Eames mentions that Adlai refused to invest any more.  Lena says Jules convinced him not to enable Ted.  Goren asks about life insurance.  Lena says Jules made sure Ted's policies were up to date.  She asks if these questions mean they suspect her.  Goren points out that the murder spares her from the embarrassment of Ted's indictment.  She insists that she loves Ted.  She says she was in Connecticut with Jules, her son and nephew, Henry.Eames expresses to Goren that Ted might have had himself killed to save his family.  Goren says it would take a pro to act like an amateur.  Eames notes that Ted had one on staff.  She recognized that their driver, Mac McGregor, was an ex-cop.They find Mac at a boxing gym.  He confirms that Ted had been in Connecticut and was on phone trying to use his brother's death to get loans extended.  Lena was in the city, and called Mac about arrangements.  Eames mentions that Lena is very protective of Charlene.  Mac says that's only since Adlai died.  However, for the first two years, the two women were \"thick as thieves.\"  They'd go to spa in Rhode Island together, but then Charlene turned on Lena.  Mac thinks Lena was better off.Lena is convincing Charlene that Henry need stability.  Lena seems to be implying that signing the papers will accomplish that.  Charlene seems to have misplaced them.  Lena tells her that when the police come, Charlene should forgo the hysterics and stick to the plan.Jules has taken his grandsons to the merry-go-round.  Eames is asking Jules questions.  Jules says, \"I'm sorry.  You've got me confused.  Which of my murdered sons are you referring to?\"  She's asking about Adlai and she asks about the weekend in Connecticut.  He had said that Ted and Lena were both there but Goren points out that Mac disagrees.  Jules only says that he's sure she was there when they received the news.They are interrupted by the boys who want some popcorn.  Jules asks what happened to the dollar he gave each of them.  Henry has his, but Ted's son, Jeffrey, seems to have lost his.  Like father, like son.  And Jules is treating Henry with favoritism.  He won't provide popcorn to Jeff.  Eames notes to Goren that Jules is consistent.  She says Jules always has a scapegoat.  Goren says that the thing about scapegoats is that sooner or later they get blamed for everything being blamed on them.Goren wonders what would happen if they arrested Charlene.They go to see Charlene and they talk in the garden.  She says Lena has temporary custody of Henry until she gets better.  Eames notes that Lena is amazing.  Then Goren asks what had driven them apart last year, asking if it was about the money Adlai gave Ted.  Charlene didn't know they knew about it.  Eames points out that they weren't sure that Charlene knew about it, but now they know.  Eames says that's a $3 million motive.  Charlene insists she loved Adlai.  She points out that she was at the spa.  Eames points out that Adlai's murder was a year to the day when she was at the spa with Lena.  Eames notes that it must have been Lena's idea… \"She's so precise.\"  Goren says the whole thing must have been Lena's idea.  Lena arrives with a lawyer.  Lena says Charlene is done talking.  Goren asks if it's a good idea for Charlene to have the same lawyer as Lena.This breaks Lena's normally controlled demeanor.  She exclaims, \"Oh, for Pete's sake, Charlene, don't be an idiot.\"  But then Lena regains her composure and says that's not what she means.  Charlene says, \"I don't need a lawyer.  I have an alibi.  Lena says angrily, \"Not for Ted's murder, you don't.\"  The lawyer says, \"Ladies.\"  As Jules is arriving, Goren says Charlene doesn't have an alibi for Adlai's either.  The poison could have been added to the kefir anytime before she left.  But Eames says the part she doesn't understand is leaving Henry alone.  He could have drunk the shake, too.  Jules echoes that.  Charlene says, \"Don't look at me, Pops.\"Goren asks Jules, \"Um, what was that you called her?  You called her, a tramp?\"  Jules suggests that Goren misheard him.  Charlene remarks, \"I'm sure he didn't.\"  Goren then says to Charlene, \"Everybody blames everything on you in this family, don't they?  Even these murders.\"  Charlene nods and then says, \"I didn't kill anybody.\"  Goren points out that her alibi is worthless.  And he describes Ted's murder as \"a Charlene temper tantrum.\"  She points out that she was in the hospital, but Goren says it wasn't a locked ward.   He says Lena has a solid alibi.  Charlene says Jules is lying.  Goren wonders why the father of the two victims would do that.  Eames says, \"Unless he didn't know.\"Jules says, \"This is ridiculous.  Please get her out of here.\"  Eames says Charlene hasn't told them yet what happened when Lena took Charlene to the spa.  Lena says, \"We got facials.\"  Charlene scoffs.  Lena decides to take the boys and go, but Charlene gets up and says Lena isn't taking them anywhere.  Charlene follows Lena into the house.  Goren follows and Charlene says it was Lena's idea.  Lena tells Charlene that no one takes a word Charlene says seriously.Charlene spills.  She says they had been drinking… a lot.  Charlene expressed that she was mad at Adlai.  Lena expressed that she wished Ted were dead.  Charlene says she didn't want Adlai dead.  She got back at Adlai with Gus.  But then a month ago, Lena called and said she had a gift certificate for the spa.  Charlene was surprised to come home and find Adlai dead.  But then Lena said she had done her part so it was Charlene's turn.  That's when Charlene took the pills.Eames asks if Lena told her how to kill Ted.  Charlene says Lena gave her a gun.  Charlene admits she went to see Ted, but she couldn't go through with it.  Charlene says it wasn't really Lena's idea.  She got it from a movie that she rented for Charlene.  Charlene says she never got around to watching it.Lena turns to Jules and says Charlene is desperate.  Eames mentions how having temporary custody of Henry gives control of the trust fund to Lena.  Goren finds Strangers on a Train on the mantle.  Lena exclaims, \"Are you completely insane?  That's a year old, Charlene.  You can't keep a video for a year.\"Lena regains her composure, turns to Jules and says Charlene set her up.  Goren says Lena had said Charlene is incapable of foresight.  Lena begs Jules to back up her alibi.  Jules says, \"How could you?  Not Adlai.  He had great work left to do.\"  Jules says Lena told him to back her alibi.  Lena was supposedly at the spa to get Charlene to leave Gus.  She said she didn't think the spa would alibi her.  Jules is horrified as it's all sinking in.Uniforms arrive, and when Lena realizes she's going to be arrested, she says Charlene was in on it.  Lena says, \"I'm the good daughter.  I held this family together.\"  Lena is handcuffed.  Charlene says she never thought Lena would do it but she guesses she should have.  \"Lena is the one who gets things done.\"Jules is going on about losing Adlai.  Goren points out that Jules lost two sons.  Then the grandson's come in.  Jules picks up Henry and ignores Jeffrey."},{"episode_title":"Maltese Cross","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/maltese-cross-881125\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Siren Call","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/siren-call-875077\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"In the teaser we see Ashey Gardela with her much younger sister, 13 year old Emily Wiznewsky. Ashley takes Emily to a party with older teenagers where there is drinking, she offers her little sister beer. Emily isn't comfortable at the party and when Ashley wants to leave to go to a bar in the city, because of a phone call she's gotten on her cell phone, Emily asks to be taken home. Ashley says she'll get one of the guys at the party to drive her home. Next we see Ashley at a bar, a fellow is hitting on her. She has him buy her a sparkling sake, but while he's paying for the drink she's answering her cell phone it's the same ring tone as before \"Oh Canada\".later we see Ashley in her car, she's is attacked, strangled by an unseen assailant by the cell phone recharger phone cord in her car.Back from the credits we see Goren leaning on his SUV, he's been waiting for Alex to come out of her appointment with a counsellor. When she comes out he asks how it went and she responds that she only has 3 more sessions. He says he can drop her off, that a call has come in (he seems a bit uncomfortable with the situation of telling her about a call he's to go to but not take her with him), she says let's go and when he starts to balk about it, she tells him she told the counsellor that she's not getting any better alone. He gives her the keys to the SUV.At the crime scene Eames seems uncharacteristically squeamish about the victim and Goren seems sensitive to that. He does his typical determination of what happened - how she was killed, what was going on with her just prior, and he notes a stamp on her hand. Eames questions others on the scene about the girl and they learn that she's the stepdaughter of a police officer of a small community on Long Island. Officer Ray Wiznewsky, the girl's stepfather shows up, he comments about how the girls death will affect his wife (this will just kill her mother), offers some information about his daughter, that she worked for Jason Raines, wanted to hang out with the rich set and that he didn't know alot about her friends, he seems helpful and remorseful saying he should have paid more attention to her - maybe this (her murder wouldn't have happened) and offers to \"stay out of your soup\".Goren and Eames check out the bar they got information about and locate the man who was hitting on Ashley, he left his credit card at the bar. They bring the suspect into the Major Case Squad and discover that the guy was having a run of bad luck, Ashley didn't accept his offer of a ride he says, Goren then notices the guy has a cut on his finger and asks about it (true Goren FORBIDDENhe hurts the guy a bit doing it), the suspect says he caught it in a taxi door. But wait wasn't he going to give Ashley a ride?  The suspect explains the rest of his bad luck. He drove back into the city when Ashley decided he was \"not old enough or rich enough\" and managedto get his car impounded while he was at another club in the city. The suspect with the great alibi wasn't a total lost, he gave them the information about the \"Oh Canada\" ring tone. Captain Ross recalls seeing an article about Jason Raines (Ashley's boss) and Raines' former super model wife Kelley Sloane-Raines in which Raines was descrbe as being from Canada.Goren ad Eames drive up to the small town on Long Island that the victim lived and worked in to talk to Raines, and out of courtesy Captain Ross calls and tells the local police that his detectives will be up there investigating. When Goren and Eames arrive at Raines' place of business, Goren is suspicious because the blinds are drawn in the middle of the day, as Eames goes to the front door, he goes to a window and peaks in, through the blinds he can see that Officer Wiznewsky has Raines at gunpoint. Goren takes his handkerchief out of his pocket and wraps it around the knuckles of his hand as he nods to Eames. She knocks on the door and calls for Raines to come out. Raines tells her it's not a convenient time but she insist and simultaneously as she opens the door and tells Raines to get down, Goren breaks the window with his hand and tells Wiznewsky to put his gun down. There's a bit of a standoff, while Wiznewsky pleads his case about Raines having killed his Ashley, but eventually Wiznewsky gives in, and his own police buddies come and take him away.Goren and Eames interview Raines after the incident but first he tells them that Wiznewsky wanted him to write a suicide note confessing to killing Ashley. Goren gives Raines a hard time about the layout of the office (it's intimate, there are great sight lines between Ashley's desk and his, the minibar is filled with sparkling sake). They ask about his wife's attitude about Ashley's working for him and he tells them she was fine with the arrangement, that they are happy. Next they interview friends of Ashley's including Nicole Johnson, who dishes the dirt about Ashley and Raines and explains that \"The Smile\" (former supermodel Kelly Sloane-Raines) knew about her husbands affair with Ashley because the gilted ex-boyfriend Brian Murphy walked up to her at a graduation talk She gave and told her about Ashley and Raines.Locals think Raines killed Ashley and are angry that he hasn't been jailed.Goren and Eames move on to interview the supermodel who seems to be as cool as a cucumber except for one bit of information that the pass along. Nicole mentioned that Raines had promised Ashley that she could design jewelry in their company's new product line. Kelly disagrees, she's the only designer in the company.Eames discovers emails from a disgruntled Ashley who has learned that she's not going to be designing jewelry after all and realizing that her relationship with Raines has all been based on sex. She threatens to expose him to his investors.Kelly is furious with her husband not over his having a young mistress that she forgave but the idea that he would have let that girl be a designer, she throws him out.Raines arrives in NYC amidst a bunch of papparazi, he's drunk and angry. Goren and Eames arrive to arrest him for Ashley's murder. He takes a couple of verbal swipes at Goren and Eames and then a literal swing at Goren which goren ducks. Goren manhandles him roughly as he cuffs him.In the interrogation room at 1PP Raines' attorney is trying to explain away his bad behavior as being because he ws drunk and upset - \"he didn't mean what he said\" (The Mel GIbson defense?\"). Eames says in Latin \"In vino veritas\" (translation In wine there is truth) Goren adds a phrase in Italian which he translates to mean it slipped.Raines explains that he did have an affair with Ashley, (\"She seduced me. I've never done anything like this before\"), but that he didn't kill her and that tha night he was waiting for her at a hotel. they are able to confirm his alibi through the hotel records of when he checked in and when he used the various hotel amenities (in room porno movie, minibar, room service). Raines points the finger of suspicion at Ashley's ex-boyfriend Brian Murphy.In interviewing Brian Murphy they learn that the little sister Emily was with Ashley. In the meantime the discover that Ashley wasn't Raines first dalliance he'd been involved with Nicole Johnson and then moved on to Nicole's best friend Ashley. They learn this becasue Nicole goes public with this information.Goren and Eames interview Emily and learn that she told her dad where Ashleigh would be, their idea of what went on that night now changes. They've done some research on Wiznewski and they go to confront him about some of the inconsistencies they are dealing with.They ask him about why he didn't mention his younger daughter being there with Ashley, and he sort of shruggs it off as not important because Emily is a good girl. Goren and Eames try to sound him out more about his family and the hardships he's gone through, as they've already met once with the wife by now they know she's fighting metaFORBIDDEN brest cancer, but Wiznewsky's a tough guy so Goren lets him now he knows where he's coing from and admits that his mother's been diagnosed with Lymphoma so he too know the feelings of rage and helplessness.Goren and Eames discuss the case with Captain Ross. They think Wiznewski killed his stepdaghter, and his partner and for that matter the entire police force is covering for him. Ross agrees but thinks it will be hard to prove because small town police really run their own show, Goren suggests they let them think the same is true of the Major Case Squad. Ross says he'll call the local cops's captain let it leak about the indictment. Eames  protests that they are nowhere near an indictment- but that's something the LI cops don't know.We see Wiznewsky stop by his partner's house and pick up a gun, next he's at his home and his wife wonders what he's doing. He kisses her and tells her he's getting important papers together for her, they will all be in the bottom drawer of his desk.Goren and Eames come to the Wiznewsky home to talk to Wiznewsky. They are shown to the den. Wiznewsky is seated with his back to them and Goren asks him to turn around, when he does he has the gun barrel of a pistol pressed under his chin. He then turns the gun on Eames and Goren. Goren begins immediately negotiatiing with Wiznewsky. Goren tells Wiznewsky he \"has to put the gun on me and let my partner go\". Eventually Wiznewsky agrees telling Eames to take her gun out and Goren's and put them on the table and then go out with his wife and daughter. She complies. Goren continues to talk with Wiznewsky trying to talk him out of suicide, Wiznewsky sure it's better for his family this way and besides he says he wants to kill Goren and then himself, he's angry because Goren got his gun taken away from him for the second time (the first time Wiznewsky had been tired becaause his daughter was just a baby keeping him up at night and he was pulling double shifts and a prisoner in a court room situation got his gun and killed a court reporter). They continue to talk, Wiznewsky tells Goren he doesn't believe him about his mother and Goren reassures him that it's true that his mother is very sick. Goren tries to tell him a deal can be worked out to delay his sentencing so he can be there for his wife. Wiznewsky gets impatient and throws his cell phone at Goren and tells him to call his Mom and tell her goodbye, Goren yells no Ray at him and finally in desperation Goren calls through the door to Wiznewsky's daughter and Eames to come back into the room to see something.Wiznewsky doesn't want that to happen and in the desperation of that moment Goren grabs Wiznewsjy's gun and wrests it away from him. As the gun lays on the floor away from both men Goren continues to plead with Ray to listen.The local police come in to cuff Wiznewsky, Eames tells Goren she'll do the paper work he shouldd drive upstate to see his mom. Suddenly a voice cries out, Gun! the camera pans around and as we see Ray Wiznewsky jam a glock under his chin a shot sounds out. His wife and daughter are shown in shocked grief. A young uniformed officer with blood splattered on him tries to explain that Wiznewsky requested to have his hands cuffed in front of him out of respect for his family, and the next thing he knew the guy grabbed his gun.The final scene - Eames drives the SUV away from the small town, she glances over at her silent partner as he stares out the passenger side window and she asks him, \"Are you OK?\" He looks at her, his expression not changing, he doesn't answer, he looks back out the window.FIN"},{"episode_title":"Tru Love","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/tru-love-870985\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Blind Spot","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/blind-spot-866777\/recap","nth_season":6,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""}]}