{"episode_recaps":[{"episode_title":"To the Boy in the Blue Knit Cap","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/to-the-boy-in-the-blue-knit-cap-1386938\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Goren and Eames are called in to investigate when the bodies of twins Parker and Thomas Gaffney are found in the offices of popular dating website Kizmate. The Gaffneys were apparently seeking out information to use in a lawsuit against Kizmate's founders: Danielle and PJ Edwards. The Gaffneys apparently had the idea for Kizmate first, and asked Danielle to help code the site. Danielle claims the algorithm used on the site was one she devised herself after she met her perfect man (PJ) and was trying to track him down, leaving a message for \"the boy in the blue knit cap\".No security cam footage is available because the cameras were shut off for some reason. Goren thinks that Thomas's body was already unconscious and Parker was trying to drag him across the floor. Parker was himself attacked while occupied with his brother's body.The twins' father claims that Kizmate was the twins' idea and that they did meet with Danielle, even if Danielle claims to not know them. They hired her to program the website, but when Kizmate launched, they realized she'd stolen their idea and asked for their share of the site's profits. She refused and the twins sued.Danielle's alibi is that she was at home and her husband PJ confirms it, but the detectives aren't entirely convinced. Danielle was spotted arguing with Rex Tamlyn (business partner for Kizmate) at a club that night. Goren speaks with Rex, who says that Parker was the man behind the lawsuit, but he doesn't think the twins have any proof. The detectives suspect that Parker may have been at the Kizmate offices that night seeking evidence. Deodorant residue is found on Parker's hands, and it matches the type found on Thomas's body. Parker was dragging Thomas around, and perhaps Parker knocked Thomas unconscious to stop the lawsuit from going forward.Parker may have been seeking out proof that the algorithm that Danielle wrote for their site was also the backbone for Kizmate. The detectives find that a keycard was used that night to access the office, and it belongs to Hildy Whitmore, Danielle's assistant.Goren and Eames question Hildy, who claims she didn't give her card to anyone and becomes huffy when the detectives continue to press. Meanwhile one of the computer techs at Major Case has discovered that Danielle did use the same algorithm for Kizmate as she did for the Gaffneys' site. Danielle denies taking the twins' idea, and Samir (business partner with the Gaffneys) points out that Danielle was with him all night, working on an out-of-court settlement for the lawsuit. He didn't want the twins or PJ to know about it until he was sure Danielle was on board. PJ is very upset that Danielle went to broker a deal outside of court, but Rex reminds him that they're still the public face of the company and they can't have a public falling out. The detectives later confront Rex about his alibi, suggesting that he was with Hildy that night, and Rex says not. When the cameras are turned off, a hidden camera takes a picture of the office, and when he shows the detectives the picture taken from that camera that night, they notice that the camera lens has been covered with a blue knit cap.PJ refuses to be rattled by the questioning but Hildy caves. She admits that she and PJ were having an affair and that they were the ones who turned off the cameras so that no one would know that they were meeting after hours. She knew Parker was going to be there that night because he found out about her affair and blackmailed her into allowing him access to the office. Samir says that he was aware what the twins were up to and why Parker managed to get into the Kizmate office. Goren uses Samir's phone to set up a trap for Danielle in Central Park. She arrives, thinking she's about to meet Samir for another meeting about the lawsuit, but find the detectives instead. They accuse her of informing Thomas about the affair. Then he told Parker about it, which Parker then used to blackmail Hildy. Danielle also had feelings for Thomas, so she warned him, and Thomas said that he was going to try and stop his brother. She was at the office and spotted Parker with Thomas's body. Parker blamed her for making Thomas go soft and turning against him and he went to attack her. Danielle stabbed Parker with a pair of scissors in self-defense. Meanwhile, Goren finds out that his therapy sessions with Dr. Gyson are as much about the NYPD evaluating his job performance as they were about helping him get into his own head. He does have anger and trust issues, but Goren doesn't think any amount of therapy will help with that. Dr. Gyson offers him a business card anyway, and she says that he should be able to keep his job if he manages to curb his anger. She has full confidence that he'll be able to. Goren ponders and agrees to another session with Dr. Gyson next week.The episode ends with Goren and Eames going off to investigate a crime scene at a bank, if they can get there before the feds do."},{"episode_title":"Icarus","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/icarus-1386935\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Cadaver","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/cadaver-1386933\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Trophy Wine","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/trophy-wine-1386937\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"The Last Street in Manhattan","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-last-street-in-manhattan-1384663\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Boots on the Ground","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/boots-on-the-ground-1384662\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"The Consoler","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-consoler-1382933\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Rispetto","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/rispetto-1384659\/recap","nth_season":10,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""}]}