{"episode_recaps":[{"episode_title":"A Person of Interest","nth_episode":23,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/a-person-of-interest-246330\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Zoonotic","nth_episode":22,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/zoonotic-246329\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Graansha","nth_episode":21,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/graansha-246328\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Blink","nth_episode":20,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/blink-245682\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Cherry Red","nth_episode":19,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/cherry-red-239185\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Legion","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/legion-238849\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Cold Comfort","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/cold-comfort-238007\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Former U.S. Senator Randolph Kittridge lies on his deathbed, with his son Jack present. Just before the senior Kittridge passes, Jack's sister Eloise arrives at his bedside and tenderly says, \"It's OK, Daddy. I'm here. I've taken care of everything. We're going to be together again.\" The reunion takes place only three days later, when someone follows Eloise into a public restroom and delivers a single, precise blow to her thigh. Within minutes, Eloise bleeds to death from a slashed femoral artery.Eloise's purse is gone. Goren observes soap on Eloise's hands, indicating that the attacker had waited until Eloise emerged from the stall. Eloise's death wasn't a botched robbery, but a successful murder.A desk calendar at Eloise's home lists a probate court hearing, scheduled for the following afternoon.  However, it's too soon to contest Randolph's will. The district attorney orders Rodgers to comply with a restraining order barring an autopsy of Eloise's body, and releasing it immediately to her lawyer. Workers pack the body in dry ice and take it to Kennedy Airport, where a private jet is waiting.Three private jets left Kennedy Airport within a two-hour period after Eloise's body was taken there. One of them was bound for Scottsdale, Arizona, home of the world's largest cryogenic storage facility. Eloise had wanted her body cryogenically frozen after her death.The court case noted on Eloise's calendar is Kittridge v. Kittridge. Jack Kittridge had sued his sister over the disposal of their father's remains. Randolph's will, and Jack, say that Randolph wanted to be interred at Arlington National Cemetery. Eloise's lawyer says that Randolph had later signed a codicil (amendment) to his will expressing his wish to be cryogenically frozen instead. Eloise was present when her father signed the codicil; Jack wasn't. Since Eloise is not in court to authenticate the codicil, the judge has to accept the will as the final word. Eames learns that Eloise had made the cryogenic arrangements for herself and her father a year ago. However, Jack had sued to stop her only last month.  Deakins wonders why Jack, who's running for the U.S. Senate, would risk bad publicity over a court fight with his sister about their father's body. Goren reports that Jack interred his father at Arlington Cemetery, but in the cemetery's crypt. Jack had the remains cremated.The detectives talk to Randolph's doctor, who tells them the former senator died of lymphoma. At first it had appeared that Randolph would recover, until the doctor found a malignant polyp in Randolph's colon. Randolph had been a candidate for a bone marrow transplant. Eloise wasn't a compatible donor, and Jack was never tested. Goren and Eames locate Roy Monahan, Randolph's Secret Service bodyguard around the time Jack was born. The Kittridges had received death threats because Randolph was actively campaigning in support of the Civil Rights Act. While Randolph was in the nation's capital, Monahan stayed in New York with Mrs. Kittridge and young Eloise. Monahan admits he is Jack's biological father. No one else, including Randolph, had ever known the truth.Goren notices that the tint in one window of Monahan's car is different from the other windows. A month ago, vandals smashed the driver's window. The change in the ashtray and a used stick of lip balm were missing afterward. When one uses lip balm, dry skin cells are left behind on the stick. Two weeks after Monahan's car was broken into, Jack filed his lawsuit against Eloise. Somebody wanted something from Randolph's body, something a reanimated Randolph couldn't live without. That person obtained Monahan's DNA to blackmail Jack for access to his father's remains. Next stop is the funeral home which received Randolph's body.  A staffer tells Goren and Eames that the home originally was going to send the body to Scottsdale. Then a legal complication arose, and they sent the body to the crematorium instead. The Kittridge family provided its own pathologist to prepare the body for cremation. He brought regular scalpels and retractors, and some other surgical instruments the staffer didn't recognize. At Goren's request, she draws pictures of those unfamiliar instruments. Goren determines that the pathologist had removed Randolph's brain.Rodgers says there's nothing in Randolph's medical history which would make his brain worth studying. The biopsy on his colon polyp was performed six months ago at the York Institute. An Institute official tells Goren and Eames that Randolph's tissue sample was one of many collected for a study on the genetics of neurological disorders. The study was terminated because three months ago, someone hacked into the Institute's computer system and retrieved personal data on the donors. The Durning Foundation, which funded the study, then withdrew its support and even sent its own people to destroy the collected data.Goren and Eames visit Spencer Durning, head of the Durning Foundation. The foundation had pulled its York Institute support in favor of equally deserving programs that were more competently run. Eames asks about a cryogenics report prepared by the foundation, which was attached as an exhibit to Jack Kittridge's lawsuit. Spencer's lawyer replies that the foundation had previously funded studies on the subject, and provided their report when Jack's lawyer asked them for assistance. Spencer says that cryogenics is junk science, and that Randolph Kittridge had deserved better than to spend eternity hung by his ankles in a vat of liquid nitrogen. The detectives do their best to bait Spencer into revealing more information. Goren suggests that if an accomplished man like Spencer died of a presently incurable disease, he'd be worth preserving and bringing back when a cure was found. Spencer replies, \"I don't plan on dying.\" Eames suggests that the York Institute study had turned up something unique about Randolph, something worth researching further. Goren also notes a photo of Spencer's son, Nicholas, and a young woman on the credenza behind Spencer's desk. Randolph Kittridge had run for the U.S. presidency in 1976, only to withdraw from the race before the first primary election. During his brief candidacy he had cried during press conferences, experienced unprovoked mood swings, and frequently lost track of his surroundings. At the time, everyone thought he was stoned. However, his symptoms aren't consistent with alcohol or substance abuse, and his medical history is clean. Deakins says, \"You're describing my old man. Except he has Alzheimer's.\" Goren says there's another form of the disease called Early-Onset Alzheimer's, which strikes its victims in their 30's and 40's. It's genetically transmitted, and the accompanying emotional and memory lapses occur at night. Randolph must have had the disease; he was 43 in 1976, and all his lapses during his presidential campaign had occurred late in the day.  But a year later he was back in the Senate, sharp as ever until he left office eight years ago. Somehow he recovered, which would make his brain worth studying.Carver tries, unsuccessfully, to pressure Jack Kittridge into revealing who blackmailed him into suing Eloise. Goren insists they're right about Spencer Durning. Nicholas is Spencer's only child, and he's the right age for Early-Onset Alzheimer's. Other relatives want to carve up the family foundation. So far, Spencer has held them off by naming Nicholas as his sole successor. But if the relatives knew that Nicholas is ill, his succession would become meaningless and Spencer would lose control of the foundation.Goren and Eames locate the woman with Nicholas in the photo in Spencer's office. She is Nicholas' fianceé, Katie Guardino. She tells them that Jack flies her to New York from her home in Rhode Island every week or so, and they spend the day together. She doesn't see him at night because he has a cerebral aneurysm -- nothing life-threatening -- that makes him tire easily. He'll probably have surgery after their wedding. They both want children.Rodgers says that if Nicholas had an aneurysm, he'd be experiencing more symptoms than just fatigue. Goren and Eames tell Carver that Katie most likely doesn't know the truth, because no woman would willingly have children with a man who could pass on a genetic risk. Spencer is using Katie to produce not an heir, but a spare. If a cure isn't found for Nicholas, Spencer will use this grandchild to retain control over the foundation. To force Spencer's hand, Carver issues a material witness warrant for Nicholas' arrest. Goren and Eames pick up Nicholas late in the afternoon, and put him in a holding cell. Told that he'll probably go before a judge later that evening, Nicholas acknowledges having an aneurysm and taking medications for it. The medications are in the briefcase he brought with him. He also readily admits he won't be at his best before the judge. However, he doesn't seem worried about his Alzheimer's symptoms appearing.Spencer arrives and demands to have his son home within the hour. Carver says that won't happen. Goren adds that it won't be before early evening at the soonest.Goren looks up Nicholas' medications in a medical reference book.  In an interrogation room, Nicholas' evening fatigue begins to show. Goren enters the room with the medications and the book. He says that before he can give Nicholas the medications, he has to confirm they are what Nicholas says they are. Goren looks up the first one, which is fine. When he looks up the second one, he shows Nicholas that his pill looks nothing like the one shown in the book. Goren excuses himself, and leaves Nicholas the book.Carver, Eames and Spencer Durning have been observing and listening from the next room. Goren enters and asks Spencer how long it will take Nicholas to figure out his medications aren't for an aneurysm. Spencer insists on seeing his son, and leaves the room. No one stops him.When Spencer enters the interrogation room, Nicholas tells him something's wrong about yet another of his medications. The third one is Lorazepam, an anti-anxiety drug. Why would someone with a brain aneurysm need an anti-anxiety drug? Nicholas then looks up his prescription for Donzepil and finds it's for Alzheimer's disease--and nothing else.  Spencer tries to gloss things over, but Nicholas isn't put off so easily. Nicholas understands now: he has Alzheimer's.Nicholas asks his father how long the latter has known the truth. As Spencer remains silent, Goren says that Spencer didn't want anyone to know that the Durning Foundation's future lay with a man whose memory was slowly fading away. If Nicholas had known, he might have decided not to have children rather risk passing his illness to them.A floundering Spencer tries to save face, assuring Nicholas he's moving heaven and earth to find a treatment. Spencer enthusiastically says that his medical researchers have already accomplished a key step in that direction, thus revealing that they're studying Randolph Kittridge's brain. With the cat out of the bag, Goren tells Nicholas that Eloise Kittridge had had other plans for her father's brain. To get that brain for his own purposes, Spencer had Eloise killed.As a haggard, devastated Nicholas faces his father, Spencer's expression changes from totally loving to totally contemptuous. Spencer shouts that Nicholas got \"those weak genes\" from his mother, and that he had to \"fix what she did to you.\" Anything Spencer did wrong, he did for his son's future. Goren retorts that Spencer had been concerned for his own future, not Nicholas'.  Spencer, the man who didn't plan on dying, was determined to preserve his legacy through the Durning Foundation.  He'd pay any price, or sacrifice any person, to achieve that immortality.Spencer Durning is arrested for the murder of Eloise Kittridge. As he is taken away, Carver, Goren and Eames reflect on the irony of the situation. In another few years Spencer, who wanted above all to be remembered forever by the world, will be forgotten by his own son."},{"episode_title":"Cuba Libre","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/cuba-libre-233898\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Monster","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/monster-232444\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Probability","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/probability-228241\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"After a medical exam in a hotel suite, homeless Leo Gergis returns to the streets with $1,000 in cash. Several days later he's dead, his head crushed in a gate at a warehouse. Goren theorizes Leo was dead before the gate hit him, because the workers who found him would have heard any cries for help. The gate hit Leo on the right side of the head, but the greater injury is on the left. An ink stamp on his arm indicates he stayed at the St. Vincent homeless shelter. Inside Leo's backpack at the shelter are some tiny mustard jars and cartons of cigarettes. Leo didn't smoke, so Goren asks if any of Leo's friends smoked that brand. The shelter attendant remembers John Dikins, another homeless man he hasn't seen there in a month.Records indicate that Dikins died a month ago, of a broken neck from falling through a floor in an abandoned building. Noting the similarities between Dikins' and Leo's deaths, the detectives plow through 12 months of similar cases from all over the city. They compile a list of 14 Caucasian men and women who were all between the ages of 45 and 55, in reasonably good health, and died of injuries involving a massive blow to the head. As Eames puts it, \"Someone's killing the great bums of New York.\"Charting the locations of the 14 deaths on a map reveals no apparent patterns. Goren concludes that someone's working hard to stay under the radar. The lot numbers on the mustard jars in Leo's backpack lead to a hotel. A housekeeper remembers Leo being a guest there, and finding a discarded needle and electrocardiogram patches in his trash. Checking with the Insurance Medical Information Bureau reveals that all 14 victims had been insured for $1 million each, under \"key man\" policies. The insurance companies were told that the victims were executives of (phony) companies located in Paris, France.A claims adjuster, Wally Stevens, is sent to assist the detectives in building a profile of this mastermind. Stevens is extremely knowledgeable and sufficiently articulate, but equally nervous and shy. To relax, he drums his fingers on the table. He says his work stimulates him: \"Looking for fraud, looking for falsehoods -- they always reveal themselves.\"After analyzing the 14 cases, Stevens identifies four skills necessary for this fraud scheme. When no suspect Goren and Eames look at has more than two of these skills, Goren thinks of a fifth one. This mastermind used homeless people for his purpose, meaning he had to find them again when he was ready to kill them. To do that, one would have to work with the homeless. An insurance industry newsletter reveals that a Jack Bernard received a humanitarian award for his \"tireless efforts on behalf of the homeless.\" The athletic-looking Bernard is in their pool of possible suspects. Include working with the homeless in the skill set, and Bernard has three skills out of five.The detectives go to Bernard's home and find him dead of gas asphyxiation from the kitchen stove. The expensive French furniture in his house leads to the furniture company's former human resources director, Jeanne Marie Lofficier. She was fired two years before for taking kickbacks from Bernard. Unable to deny her role in the current scheme, Lofficier offers up the names of two more victims yet to be killed. She had only set up the phony French companies, kept the insurance policies, and collected the checks. Bernard did the rest. After she brought the $1 million insurance check for Leo Gergis back from Paris, Bernard ran off with that money and the previously collected $13 million.Lofficier didn't kill Bernard, because she spoke of him in the present tense during her entire interview with Goren and Eames. The $14 million is nowhere Bernard had access to, meaning there's a third partner who killed him and took the money. Wally Stevens comes to Major Case's office, sent by the insurance companies to help recover the missing millions. Goren talks with Stevens about the current state of the investigation, during which Stevens comments that \"women like men with money.\" Certain aspects of Leo's death aren't consistent with the preceding 13 deaths. Goren figures out that Bernard had killed Leo on his own for the extra check, but botched the job because he wasn't the brains part of the scheme. Multiple small patterns are apparent among the other 13 deaths, and one particular pattern occurs in groups of five. Minus Leo and plus the two other intended victims Lofficier identified, the total body count would be 15. After Goren finds himself unconsciously playing Wally Stevens' finger-drumming rhythm, he and Eames visit Stevens' office. There they find multiple objects--desk photos, push pins in the bulletin board, awards on the wall--all arranged in neat groups of five. Also, Stevens has photos of his children but none of his wife.A background check reveals that Stevens was divorced two years ago, and six months later his ex-wife married a very wealthy man. She obtained a restraining order against her ex-husband because he was coming to her door every week with flowers, asking when she was coming home. Goren determines that Stevens' social awkwardness is due to Asperger syndrome, a high-functioning form of autism whose symptoms include the need to create and duplicate patterns, impairment of nonverbal behavior particularly eye-to-eye contact, and a tendency to become preoccupied with a single subject. This description fits Stevens to a T. Stevens is the third partner who killed Jack Bernard, and the skill set he identified for Goren and Eames is his own!Goren and Eames visit Stevens at his home and confront him. Stevens had hatched this fraud scheme in a bid to win back his ex-wife; after all, women like men with money. He had the insurance industry brains; Jack Bernard had access to the homeless and the foreign corporation know-how. When Goren shows him a medical textbook description of Asperger, Stevens is stunned to recognize himself. No one suspected he had the syndrome because it was identified only in 1994. Stevens had unconsciously revealed his own fraud and falsehoods in the multiple small patterns he made throughout these seemingly accidental deaths. If Jack Bernard hadn't made a mess of killing Leo Gergis, those small patterns would never have revealed the deaths as the murders they really were."},{"episode_title":"See Me","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/see-me-228194\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Suite Sorrow","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/suite-sorrow-221246\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Nan Turner, wealthy owner of the Townson Hotel, is found drowned in her bathtub. Her lungs are full of water, and her body sank instead of floating on the surface. Her throat didnâ€™t close, which the body would normally do to fight drowning. On her forehead are several blister and pinprick marks, which Eames guesses are from Botox shots. In Nanâ€™s bedroom are several prescription bottles, and her bed had been slept in. Goren and Eames meet Cooper, the hotel detective and a former NYPD officer. Ben Turner, Nanâ€™s husband, says that Nan took over the hotel after her fatherâ€™s death, and was determined to keep it in the family. There was industry stalk that rival hotelier Helen Grimwald planned to make an offer for the Townson. Ben doesnâ€™t know much about that rumor, as the family trust passed the hotel directly to Nan and then to their daughter Julie. The next day Goren and Eames interview Julie and her fiance, Kenneth Rayfield. Julie says sheâ€™d seen her mother earlier that night, and Nan had been in good spirits. From there Julie went to Kennethâ€™s home; heâ€™d just returned from the gym. They spent the rest of the evening there. Helen Grimwald always had her eye on the Townson, but like everyone else she underestimates Julie. Julie isnâ€™t going to sell the hotel.Rogers finds a massive overdose of Botox in Nanâ€™s system, which left her paralyzed and defenseless against her killer. However, she didnâ€™t obtain her treatments from her doctors. Goren and Eames visit the Townsonâ€™s beauty salon, whose manager points them to cosmetologist Jason as most likely to dispense Botox without a license. Jason admits he ran out of Botox the night Nan died, and that Helen Grimwald and Nan were both clients of his. Helen was always asking Jason about Nanâ€™s health, and told him that a little bird told her to be patient about making an offer for the Townson. Jason figures the little bird is the same person who saved her a lot of money when she bought the Baronet Hotel.When the Grimwalds bought the Baronet, they obtained a loan from Kenneth Rayfieldâ€™s financial firm. It would appear that Kenneth was positioning himself to eliminate Nan, sweet-talk Julie into selling the Townson, and collect both a nice sales commission and a nicer marriage dowry. Goren points out only one flaw in that theory: Nan had been in frail health, and might have died soon anyway. Why would Kenneth kill her before marrying Julie and locking in the profits?To learn what forced Kennethâ€™s hand, Goren and Eames go through Nanâ€™s business records. Ben Turner is present, and tells them that Julie is the type of person who if pushed one way, tends to go the other. Sheâ€™d been engaged once before, to Junker Dalton whom Nan checked out and learned was a loser. Goren finds that a stub is missing from the trust checkbook. The checks before and after were written the day Nan died. Ben says the trust was strictly Nanâ€™s domain, so he doesnâ€™t know what the missing check might have been for. Nanâ€™s accountant tells the detectives that Nan transferred $100,000 into the trust account on the day she wrote the missing check. Three years ago she also paid Dalton $30,000 in â€œmoving expensesâ€ to go away. Goren and Eames visit Julie at home and question her closely about the night of Nanâ€™s murder. To test what Ben told them, they deliberately find fault with every answer she gives. Her account of her and Kennethâ€™s activities the night Nan died, doesnâ€™t add up. Kenneth must have killed Nan and then raced around establishing his alibi, while Julie waited at his home alone.During this cross-examination, Goren observes homeopathic remedies for migraine headaches in Julieâ€™s living room. Under their relentless questioning she grows more and more agitated, eventually throwing a screaming fit. Julie admits that her mother gave Kenneth $100,000 to go away, but Kenneth told her about it and tore up the check in front of her. As Goren and Eames leave, they realize that Kenneth is covering for Julie, not the other way around.Jason, the cosmetologist, admits that Julie came to see him the day Nan died. Julie has prescription medications for her migraines, but she hasnâ€™t refilled them in several months. Smoothing wrinkles isnâ€™t the only thing Botox is good for. Jason sold Julie his entire Botox supply, and realized only afterward why she wanted it.Goren and Eames arrest Julie for Nanâ€™s murder, and take Kenneth in for questioning as well. Kenneth says he only told Helen Grimwald that Nan had concerns about Julieâ€™s ability to run the Townson. He confirms tearing up the $100,000 check, and adds that he also broke the engagement at that time. Nan would have been the classic mother-in-law from hell. Only then does he realize that Julie hadnâ€™t told them about the broken engagement. Kenneth then admits that on the night Nan died, he called Julie from his gym and told her to meet him at his home. She feared being accused of her motherâ€™s murder. He said they should just say that the two of them were together that evening.Julie says she bought only enough Botox for one headache from Jason. Goren and Julie exchange heated words about Nanâ€™s constantly undermining her. Nan let Julie indulge her passion for renovating even as Nan was planning to sell the hotel, paid the men in Julieâ€™s life to go away, and so on. Everyone in Julieâ€™s life has undermined her to the point that sheâ€™s lost faith in her own judgment. Julie defends Nan, saying that her mother had been right about Dalton and had shown her the photographic evidence of his infidelity. If Nan had had anything on Kenneth, sheâ€™d have shown it to Julie. She didnâ€™t.Townson house detective Cooper says that he investigated Dalton for Nan, but not Kenneth. Nan turned down Cooperâ€™s offer to investigate Kenneth because she didnâ€™t want another incident. When Nan showed Julie the photos of Dalton, Julie slugged her. However, they apparently made up because the two of them went to Florida the weekend before Danâ€™s death, and came back very happy.Convinced that someone is framing Julie, Goren persuades Carver to delay responding to her lawyerâ€™s offer for a plea bargain. Nan wrote the check to Kenneth after the trip to Florida; Kenneth must have committed his compromising act that weekend. Goren and Eames determine that Kenneth and a male guest visited a nightclub, where they had their photo taken and bought it immediately. Goren then has a new thought:  If Julie goes to prison, whoâ€™s left standing?At Carverâ€™s office to discuss the plea bargain, Goren and Eames show Julie and her lawyer the evidence against Kenneth. Nan had loved her daughter, enough not to show her the incriminating photo of Kenneth because it would have destroyed Julie. Kennethâ€™s date at the nightclub, the man he was photographed kissing, was Ben Turner. Presently charged with her motherâ€™s murder, Julie canâ€™t administer or access the family trust. Sheâ€™s signed a power of attorney temporarily giving her father that authority. While pretending to believe in and support Julie, heâ€™s been skillfully manipulating her to put himself in a position to sell the Townson. To prove Julieâ€™s innocence, the police have to make a case against Ben Turner. They find a clause in the trust agreement which may help, and Julie agrees to cooperate. Ben arrives home later to find Julie waiting for him in the parlor. As the police watch from another room through a hidden camera, Julie tells her father that she visited the doctor after leaving Carverâ€™s office. Sheâ€™s pregnant, and she and Kenneth are going to City Hall the next morning to get married. Ben takes the bait and reveals his firsthand knowledge of the trust agreement clause. If Julie becomes unable to administer the trust for any reason, that authority passes to her child or to her childâ€™s guardian. Ben insists that Julie canâ€™t marry Kenneth, and mentions the compromising photo of Kenneth kissing another man. Julie walks out of the parlor and out of camera range, which wasnâ€™t part of the plan. The police frantically race out of the surveillance room, through the parlor and into the study. Ben lies dead on the floor with a knife in his chest, with Julie screaming ferociously at him. Eames tries to console Goren, saying that if anyone deserved this, Ben did. Goren isnâ€™t comforted, saying he should have seen this coming. The scheming Ben Turner may have deserved his fate, but his mistreated and manipulated daughter does not deserve hers."},{"episode_title":"Baggage","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/baggage-221245\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Con-Text","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/con-text-220667\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Shandeh","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/shandeh-212317\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"The Pilgrim","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-pilgrim-205535\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Tomorrow","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/tomorrow-205534\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Malignant","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/malignant-204741\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Chinoiserie","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/chinoiserie-202596\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Best Defense","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/best-defense-201323\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Anti-Thesis","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/anti-thesis-198159\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Bright Boy","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/bright-boy-197783\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Dead","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/dead-187514\/recap","nth_season":2,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""}]}