{"episode_recaps":[{"episode_title":"Revolution","nth_episode":18,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/revolution-1269840\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Alpha Dog","nth_episode":17,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/alpha-dog-1270213\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Major Case","nth_episode":16,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/major-case-1274410\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"All In","nth_episode":15,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/all-in-1274409\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Passion","nth_episode":14,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/passion-1274408\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Lady's Man","nth_episode":13,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/ladys-man-1274407\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Salome In Manhattan","nth_episode":12,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/salome-in-manhattan-2420885\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Salome in Manhattan","nth_episode":11,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/salome-in-manhattan-1270214\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Lady's Man","nth_episode":10,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/ladys-man-2420884\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Family Values","nth_episode":9,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/family-values-1273002\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Paul Devildis is watching a Christian high school theater production of Cyrano de Bergerac.  Paul is fixated on the actress playing the part of Roxane. He suddenly leaves the play alone.Paul is next seen sitting in his car in front of a house and is reciting from the Bible, Rev. 17:4.The action returns to the ending of the play and the applause of the audience.  The school's drama teacher, Vilma, is called forward and given a bouquet of flowers by Roxane.  The part of Roxane is played by Paul's teenage daughter, Kathy.  She is disappointed that her father left in the middle of the garden scene, but her mother, Mary Devildis, tells her he was called away.Joe arrives at the house where Paul is already inside. He is sitting in the kitchen wearing a pair of rubber gloves and sipping on a cup of coffee.  Lying on the floor in a pool of blood with a towel draped over her breasts is the body of Joe's wife, Millie.  Joe enters the kitchen, and sees Millie on the floor.  Paul is behind Joe and when he turns, Paul bludgeons him to death with a hammer.  Paul, covered in blood splatter, unemotionally moves the cup of coffee.Next morning, Goren and Eames arrive at the residence of the murders.  Goren pieces together certain facts such as the coffee cup, lack of evidence of sexual attack, and that money was scattered under the Joe's body.  He concludes that the victims knew their assailant and that the murderer was very familiar with the household.  Dr. Rodgers states that the murder weapon is most likely a hammer.  Goren also believes that the murderer was in complete control of his emotions due to the organized nature of the attacks.After a brief discussion with Capt. Ross concerning possible scenarios, Goren and Eames are called when the victims' sister and brother-in-law arrive to identify the bodies.  The brother-in-law is the murderer, Paul, and his wife, Mary, whose sister Millie is one of the victims.  The detectives question the couple and learn about the play the previous evening. It is also revealed that Millie was pregnant.On questioning the foreman at Joe's job site, Goren and Eames are told that Joe may have had financial trouble and that Joe was hoping that Paul, who is a banker, would be able to help with the mortgage.Paul is standing outside Vilma's studio at night as she approaches.  He wants to discuss Kathy's participation in the drama and Vilma invites him in for coffee.  Paul is later seen in an alley, dropping a blood-soaked hammer into a dumpster.Goren and Eames arrive on scene the next morning.  Dr. Rodgers tells them that the teacher died the night before from blows by a ball-peen hammer.  A flier advertising the play Cyrano and a broken coffee cup are found at the murder scene.  Goren, Eames, and Rodgers note the similarities with the murders of Joe and Millie.The detectives follow-up on the flier with the school's principal.  She tells them that Vilma's s were always full and no problems were noted with any of the play selections.  However, she does tell Goren and Eames that plays like Cyrano may have generated concerns with some of the parents, but that letters of consent were required before a student could participate.Paul is constructing a pipe bomb while on the phone with his former boss, Ray Balger.  Paul tells him he has a new restructuring plan that he would like Ray to look at.  He tells Ray he will send it to the bank but that it is for Ray's eyes only.The next morning, Goren and Eames, approach Devildis at his home.  They inquire as to why Paul did not sign the consent form to allow Kathy to appear in Cyrano.  He says that Kathy is his \"little girl\" and he has trouble with the fact that she is getting older.  Paul also lies about the fact that he saw the play in its entirety.  Kathy knows he is lying.Later that day, Paul is giving the eulogy at a service for Joe and Millie.  He is quoting from Rev. 17:15-17.  Meanwhile, a package, containing the pipe bomb, arrives at Paul's former bank.  An explosion occurs, killing Ray Balger and injuring another employee, Greg Phillips.  Goren and Eames investigate the blast site where they find one of the fliers for the play.  They question Phillips at the hospital and learn that Devildis delivered the package containing the bomb.  They also find out that Paul was once a manager but was transferred to a loan department.  When loans started to default and people lost their homes, Paul was made the scapegoat and was fired from his job.  The Devildis home is raided, where Goren and Eames find a dead family dog and Mary Devildis who was dead from a gunshot wound, then neatly tucked into bed.  Paul and Kathy are not in the house.In Capt. Ross' office, Goren and Ross discuss the possibility that Paul's mother may be the next target. Eames enters and tells them that Kathy had spent the night at a friend's house but that Paul picked her up early that morning.  With the possibility that Kathy may still be alive, they decide to look for another residence that Devildis may own.Paul and Kathy are driving on a secluded stretch of highway.  They are headed for a cabin in the woods that is owned by the Devildis family.  Paul, in an apparent trance-like state, suddenly accelerates the car to a high speed and nearly loses control.  Kathy is frightened by the incident and Paul regains his composure. Paul and Kathy are at the cabin trying to jump start a truck.  Kathy is in the car while Paul is working on the truck.  She turns on the car radio and hears the news of her mother's death.  Paul overhears the radio and checks the car.  He sees Kathy fleeing into the woods and begins to chase her.  Paul catches Kathy who is horrified about the murders her father has committed.  He tells her that he is only trying to save their souls and give them eternal life.  Paul also tells Kathy that he is going to kill her grandmother so they can all be together in the after-life. Kathy convinces her father not to kill her until he brings her grandmother because she is afraid to die alone.  Paul agrees to her plea.Ross, Goren, and Eames determine that Paul does have an isolated residence and that he is preparing to pick up his mother at a bus station.  When Paul arrives to get his mother he is arrested by the FBI.  Goren and Eames are also on the scene and take him into custody.At the cabin, a thorough search is being conducted to find Kathy, but to no avail.  Capt. Ross is also present. Goren finds evidence that Kathy has been bound with cable ties and that she tried to leave clues as to her whereabouts.  A box with a cross on top has been drawn in the dirt and a large stone has been inscribed with with a cryptic symbol.  The information leads them to believe that she may be in a cemetery. Goren takes Paul inside the cabin and begins to question him about Kathy's location.  Using the story of Abraham and Isaac from the Book of Genesis, Bobby forces Paul to question his faith.  Bobby convinces Paul that his faith has not been in God and that he has been harboring suppressed sexual feelings toward his own daughter.  He tells Paul that he has been serving the \"Tempter,\" the \"Master of All Deception\" and not the God of Abraham.  Bobby then gets Paul to realize that he has been serving evil and Paul breaks down. He gives Kathy's location.In the closing scene, night has fallen and the searchers track through woods to find Kathy gagged and bound to a post.  The motion slows to an almost dreamlike state as Kathy looks at Bobby.  The episode ends with Ross, Goren, and Eames staring at a rescued Kathy being taken to safety."},{"episode_title":"The Glory That Was…","nth_episode":8,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/the-glory-that-was-1235919\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":"Nichols and Wheeler investigate two related homicides.  Capt. Ross is also actively involved in the case.  The first victim, Caroline Walters, is a trade representative for the Belgian consulate, very wealthy, and former Olympic equestrian gold medalist.  She was shot in the head in an apparent robbery.  The second victim, her bodyguard, disoriented by a blow to his skull, wanders away from the crime scene and stumbles into an oncoming car where he dies in the middle of the street. Since Caroline is wealthy, her husband Paul becomes the first person of interest.  On questioning him, Nichols senses an aloofness in his answers and suspects that Paul and Caroline might be in the process of a divorce.  As it turns out, they are already divorced; however, after questioning, Paul is eliminated as a suspect.On entering the Belgian Consulate, they are met by Jack Tayler, the head of a private international security firm that provides service to both the Belgian and Austrian Consulates.  After searching Caroline's office, Nichols and Wheeler come away with two vital clues.  One is a shredded DVD that contains a video of Caroline in bed with an unidentified woman and the other clue is a name, Laura G., on Caroline's personal calendar.The investigation then splits into two different directions, Caroline's bodyguard and  Laura G.   The bodyguard is an ex-Secret Service officer named Jamie Riggs.  He was also a former guard at the Austrian Consulate. Laura G. is Laura Green, an aspiring equestrian with her sight set on the Olympics.  After being revealed as the other woman in the video, Laura tells Nichols and Wheeler that she and Caroline were being blackmailed .  After further investigation, Nichols and Wheeler learn that Laura was formerly a prostitute and is currently married to one Kip Green.  They co-own a public relations firm.On searching the bodyguard's apartment a new trail develops, that of Jack Tayler.  In Tayler's office, Nichols accuses him of lying since their first meeting at the Belgian Consulate.  Tayler knew both murder victims very well and the coincidence doesn't slip past Nichols.  Later, Nichols discovers a link between Caroline Walters, Kip Green, and Jack Tayler.  Tayler was a member of the U.S. gold medal skeet shooting team the same year Caroline won her gold medal for Belgium and appears in a photograph with her in a very affectionate pose.  Also, a much younger Kip Green appears in a skeet shooting team photo as a publicity staff member.  All that remains is Laura Green's involvement.In a surprising plot twist, Laura and Kip are in a grocery store when it is robbed.  The robbery was just a cover for the real crime, murdering Laura and Kip.  Kip is killed but the storekeeper foils the attempt on Laura's life and the assassin is killed.  The assassin manages to kill the grocer before he dies. Nichols and Wheeler determine the the shooter is a member of the Mexican mob and there is no way to learn his identity.  They find a picture of Kip and Laura on the killer to help him identify the targets.  The digital signature on the photograph leads to a camera belonging to Jack Tayler.The Greens' apartment is searched and the evidence leads to a fleeing Laura, who is arrested on a plane headed for Morocco.  She is taken in for interrogation and reveals the reason behind the blackmail.  Jack Tayler knew that Caroline was a voting member on which city would host an upcoming Olympics.  Tayler's firm stood to land a huge security contract if  Rio de Janeiro was chosen.  Tayler asked Caroline to cast her vote for Rio but she declined for obvious ethical reasons.  Knowing Laura's background, Tayler propositions her to seduce Caroline and that is the origin of the video.  Tayler was using the video as leverage against both Caroline and Laura to force the vote in his favor. After getting a search warrant for Tayler's apartment, the photograph of Laura and Kip is linked by digital signature to one of Tayler's cameras and therefore Kip Green's murder by the Mexican assassin.  Laura agrees to testify against Tayler in using her to seduce Caroline for reasons of blackmail.  Laura confesses that Kip killed the bodyguard and also killed Caroline because he was jealous that Laura had unintentionally fallen in love with Caroline.  Nichols and Wheeler arrest Tayler for Kip's murder.The episode ends in a poignant conversation about Wheeler's ex-fiancé."},{"episode_title":"Folie a Deux","nth_episode":7,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/folie-a-deux-1235920\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Astoria Helen","nth_episode":6,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/astoria-helen-1267493\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Faithfully","nth_episode":5,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/faithfully-1234807\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"In Treatment","nth_episode":4,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/in-treatment-1267487\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Identity Crisis","nth_episode":3,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/identity-crisis-1265313\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Rock Star","nth_episode":2,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/rock-star-1262577\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""},{"episode_title":"Playing Dead","nth_episode":1,"corpus_url":"http:\/\/www.tv.com\/shows\/law-order-criminal-intent\/playing-dead-1262575\/recap","nth_season":8,"source":"http:\/\/www.tv.com","show":"criminal_intent","corpus":""}]}