{
  "episode_recaps": [
    {
      "episode_title": "Silence",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/silence-144241/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "Father Michael finds a murdered transvestite in his church and the SVU is called to the scene. The word \"pecavisti\" is written in the confessional's door and Elliot thinks it is a confession from the killer saying \"I have sinned \". The M.E. finds fluids and some unusual traces on the transvestite's body; she believes that whoever had sex with the victim used a steel wool sponge with scouring powder to scrub his own penis before having sex with the victim. Olivia and Elliot talk to the priest who found the boy and he says he didn't know the boy, but says Sister Peg might know who he is. Sister Peg tell Fin he is James Doyle, he ran away from home was trying to earn money to have a sex change operation. Fin asks her about Father Michael and she says he is good priest. The lab finds a match in the system for the DNA from fluids found in the victim, it is from Gus Yoder, a recently paroled arsonist. Munch and Fin arrest the guy, but he claims James Doyle was alive and well after they finished. Dr. Huang observes the interview and says Gus has obsessive compulsive disorder; he asks to look at the crime scene photos and says Gus is not the killer, a person with his type of OCD would never go near a dead body or touch the blood. Dr. Huang also says that \"pecavisti\" does not mean \"I have sinned\", it means \"you have sinned\", he says that this probable is an accusation to the priest or to the church, and that maybe James's death wasn't part of it, he just interrupted the person who was doing it and got killed so he wouldn't tell anyone.Olivia finds out that Father Michaels used to work in a school before he went to that parish and there were some rumors of a priest abusing children there at the time he left. She and Elliot go confront the Father about the rumors, but he says nothing. Meanwhile Fin and Munch talk to the police officer in charge of the abuse case, he says he found at least four boys claiming they were molested, but then the church paid two hundred thousand dollars to each family and made them sign a confidentiality agreement, so there was no case anymore. Olivia manages to track down the boys, she and Elliot go talk to Ben Campion while Munch and Fin talk to Todd Ramsay. Ben says Father Michaels is a good priest and he never touched him. Ha says it was Father Michaels that invited him to run the youth center. Todd isn't very cooperative and says he won't tell anything because of the confidentiality agreement. Fin and Munch then talk to Bobby Douglas, they confront him and he confesses to killing James, he says he had to expose Father Michaels for what he'd done, that the Father ruined his life. The police search Bobby's room and find James's purse and a flashlight with blood. The lab later confirms it is James's blood. Bobby is arrested and Elliot interviews him along with Olivia. Bobby's lawyer wants Alex to make a deal, but she says it depends on what he has to say about the abuse allegations. Bobby gives a statement about the sexual abuse he suffered. Alex gets a warrant to search Father Michaels's room. At the church Rory O'Halloran and Bishop Mallinson try to discourage Elliot and Olivia to execute the search. The detectives do not budge, hoping to find a lot of evidences, but end up finding only a videotape hidden in the shelves. At the precinct they play the tape and in it is Father Michaels saying he likes to watch the boys in the shower room and to touch them. Dr. Huang says it is a common therapy practice of behavioral modification, and because of that Alex's boss says the tape is inadmissible in court so she'll only prosecute Father Michaels if the police offer solid evidence, since a murderer's testimony is not very convincing. Olivia and Elliot ask Ben if they can ask the boys at the youth center about Father Michaels, he says they have to ask permission from the parents. Elliot asks if there is any boy that left the center abruptly, and he answers only one, Darius Retafian, about the same time the Father left the center. Elliot and Olivia talk to Darius's mother and she confirms her son left the center because of Father Michaels. He is arrested, and at the arraignment Mr. O'Halloran, the church's lawyer, threatens Alex saying that if she proceeds with the trial, he is going to do whatever it takes to clear Father Michaels. While Alex is prepping Darius for his testimony on the trial, Mr. O'Halloran shows up at the precinct and suggest Alex to ask Darius about the Father's TV and that if he is telling the truth, he'll be able to say the TV is black and white. She realizes Darius is lying and accuses his mother of making false accusations after settling with the church for the abuse of her son by another priest. Meanwhile they receive the news that Bobby was killed in jail.When Elliot confronts Father Michaels about it, and realizes he was never guilty and was protecting someone else. The Father says he feels guilty for not being able to protect the boys, but the real abuser confessed to him and he can't break the seal of confession. Alex gets a subpoena for all the church's documents regarding sexual abuse by priests to try and find out who could've been the priest that really abused those boys. They learn that Bishop Mallinson, former Father Mallinson, was a Latin professor at the school by the time of the abuse claims. Elliot again talks to Father Michaels and try to reason with him. He says he knows who the real child abuser is, and that he must tell what the bishop told him, he asks the Father what is more important, not breaking his vows, or protecting innocent children from a child molester. Father Michaels finally gives in to his guilt so Elliot arrests the Bishop."
    },
    {
      "episode_title": "Competence",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/competence-144240/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A woman comes to the precinct to report her daughter's rape, the only problem is that the girl has Down syndrome and doesn't even know what sex is. Olivia and Elliot try to talk to the girl, but she is embarrassed to talk to them and is afraid of her mother's reaction. Elliot asks Katie's mother if she knows of anyone who could've done this, and she tells them Katie is at the day center and at work during the day, so it could've happened any time in one of those places. Elliot and Olivia talk to the supervisor at the day center, he tells the detectives that Katie's mother is over protective and doesn't let Katie take the classes about dating, sexual education and independent living, and that way anyone could've easily take advantage of Katie's lack of knowledge about this subjects. Elliot talks to Katie's best friend and he tells Elliot Katie complained that the bus driver touched Katie inappropriately. Olivia and Elliot also talk to Katie's boss, who confirms the story about the bus driver.Alex tells the detectives they can't arrest the bus driver based on what other people told them, they have to make Katie talk to them and tell them exactly what happened in order to get an arrest warrant for the bus driver. Elliot convinces Mrs. Tolliver to let them talk to Katie again, and they meet at the zoo. Olivia and Alex ask Katie about the bus driver and she tells them he stole her necklace and threatened her is she told anybody, she tells them that he touched her in inappropriate places. Alex says it is enough to get a warrant for his apartment. The bus driver claims it was a gift, but the detectives don't buy it. They ask him if he raped Katie and he denies it, when the detectives tell him Katie is pregnant he says he had a vasectomy, so the baby isn't his. Elliot pleas to Mrs. Tolliver to let Dr. Huang talk to Katie, and she finally gives in. Dr. Huang and Alex talk to Katie and find out Katie's best friend is in fact her boyfriend, she tells them she got her baby from Danny, but when asked if she and Danny touched each other private parts, she denies it. They break the news to her mother and she reacts badly, she says she made an appointment for Katie to have an abortion.At the abortion clinic in the last minute, Scott Lucas the day center manager comes in with an injunction to stop the abortion. He filed a petition to take Katie's custody from her mother. Alex says it is a loose-loose situation, if Katie is considered capable enough to decide if she want to keep her baby or not, the defense lawyers from the rape case can claim she knew what she was doing and consented to having sex. Katie's mother calls the precinct and tells them Katie is missing. The detective find out Danny is also missing. Olivia and Elliot soon find their trail and find the apartment where they are hiding. Katie and Danny agree to go to the precinct. Later at the station, Danny says he told Katie about sex, but she said that what he described was not sex, it was exercise and she did it every day at work. Elliot and Olivia realize that Katie's rapist is her boss at the grocery store.Olivia talk o Katie and her mother, and Katie tells them Mr. Chaney taught her to exercise like that, and made her do it every day. Munch and Fin go talk to Mr. Chaney, but he denies everything, claiming that Katie can't distinguish reality from fantasy sometimes. When Munch asks him to volunteer his DNA for comparison to Katie's baby, Mr. Chaney tells them to talk to his lawyer, furthering suspicions. Alex and Dr. Huang are subpoenaed to testify in Katie's competence hearing, and Alex begs Katie's mother to change her mind and not do the abortion, so the competency hearing is dropped and the rape case is not jeopardized, but Mrs. Tolliver is adamant. At the Competency hearing after Alex's and Huang's testimony and upon seeing her daughter crying on the stand, Mrs. Tolliver decides to stop it and gives up her guardianship of Katie. At the station, Elliot tells Alex that the DNA from Mr. Chaney matches the DNA from Katie's baby, but she says now the defense lawyers can argue Katie is competent and consented to having sex. Olivia and Elliot ask Katie if anyone else knows about the exercises she did with Mr. Chaney, she says no one knew, but she caught him exercising with another girl once, and the other girl has a baby. They investigate it and find out Mr. Chaney had many babies with girls who worked at his markets. Alex proposes a deal and Mr. Chaney agrees to pay child support to all of the children and they inherit a percentage of his businesses when he dies."
    },
    {
      "episode_title": "Denial",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/denial-144239/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A woman is found passed out and raped at a party. At the hospital the nurse gives Fin the rape kit exams and tells him that his victim is a heavy drug user. The investigation takes a turn when the police officers, looking for the victim's ID in her purse, find a human finger inside it. Fin talks to Claire about her rape, but she doesn't remember anything. He asks about the finger in her purse and she claims she found it in the street the night before. Dr. Warner analyzes the finger and is able to tell it is from a small child, and there are no signs of it being on the street, since there is no dirt in it. Elliot and Olivia go search Claire's home with a warrant. She lives with her Grandmother who tells the detective Claire has a turbulent relationship with her mother. After that the detectives go visit Claire's mother, she doesn't offer much help, but is not impressed to know Claire was raped or that she was carrying a human finger in her purse.Fin gets the sketch of the man that raped Claire and is able to track him down and arrest him. At the station, Olivia tells everyone that the DNA from the finger matches the DNA from Claire, so the child is her blood relative. Elliot and Olivia interrogate Claire about it and she tells them the finger belonged to her little sister. She claims her mother killed her and put the body in a trunk inside the closet. Olivia and Elliot talk to Claire's mother, Grace, and ask for permission to search her house for the body, but she refuses, even when the detectives tell her it will clear her name. Later the same day, the Captain informs the guys that Grace has agreed to let the police search her house the next day when she gets back from work. They find it suspicious and go watch her place to see if she'll try to get rid of any evidence she might be hiding. Fin is skeptic about it and when he is ready to give up, Grace comes out of her building carrying a trash bag and puts it in the dumpster. They arrest her and call forensics.Grace claims it was Claire who killed the girl and she hid the body to protect Claire. At the lab, Dr. Warner examines the remains and concludes the girl was stomped to death. Grace tells Olivia and Elliot that Claire was violent and killed Lisa because she was jealous of her. At Grace's arraignment the judge orders ADA Cabot to Charge Claire as well, and when Alex says she won't file charges against a person she thinks is innocent, the judge holds her in contempt. Ate the cell Alex's boss gives her a file corroborating Grace's testimony that Claire was a violent child that had rage attacks. Fin is forced to arrest Claire.Claire's Grandmother posts her bail, and when she is late for court, Fin frantically searches for her. He finds her in a cheap motel, overdosing on heroin and calls an ambulance. Ate the hospital Fin presses her for the truth, she says she didn't kill her, but she feels guilty for not being able to protect her. Fin talks to Alex about it and she agrees that Claire isn't the one who killed Lisa, but with her priors, the jury will probably convict her. Fin and Alex decide to talk to the Grandmother again. Elliot and Olivia question her about Grace's maternal skills. They decide to investigate the death of Grace's first child, a baby boy that died a sudden death when two months old. At the Rikers Penitentiary they tell Grace that they exhumed the baby's body. When confronted by her own mother, Grace confesses to killing her son and her younger daughter. When asked by Grace's lawyer what offer she could make, Alex responds no offer, she will be seeking the maximum penalty against her. Mrs. Rinato is arrested for helping Grace cover up the murder of her son.Fin gives Claire a picture of her sister, and tells her to finally go to a rehab clinic, she starts to cry looking at her sisters face, and thanks him."
    },
    {
      "episode_title": "Greed",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/greed-142421/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A woman is found by her husband raped and beaten. He tells Olivia and Elliot that he got home and found her lying in the kitchen floor, the alarm wasn't on and she didn't hit the panic button. Mrs. Todd state is delicate and she is paralyzed in her right side and is not able to talk. The police suspects burglary gone wrong and ask Mr. Todd if anything from the house is missing, he says he can't find his wife's Rolex watch and doesn't remember if she was wearing it when she was found.Captain Cragen and Fin question the maid and she tells them she doesn't quite like Mr. Todd, and that he made her move out the house after he married Jessica. She tells them her boyfriend took her keys by mistake and they immediately suspect him. They go to talk to Catarina's boyfriend and he tells them about a fight between Mr. and Mrs. Todd.The DNA from Mrs. Todd matches another unsolved rape, so Olivia and Elliot go talk to the victim. Mrs. Johansen tells them she was already in bed when she was attacked and the attacker stole a diamond bracelet, but didn't hit her like Mrs. Todd. Elliot and Olivia discover that both houses had recently changed locks in the same locksmith. They interview the man who changed both locks and he claims he is innocent, but the lab matches his prints to the ones found in both crime scenes, the Johansen bedroom and the Todd kitchen. The police search the van he uses at work, Elliot finds the stolen watch and bracelet in Mr. Ryan's toolbox.In the court, the evidence from the toolbox is suppressed because police searched it without Mr. Ryan's permission or a search warrant. Meanwhile the DNA report is back and it doesn't match Ryan's, so police suspects someone was trying to frame him. They get Mr. Ryan'spermission to search the toolbox for prints and find Mr. Todd's prints in the diamond bracelet. They talk to Mr. Todd and he lies about touching in the locksmith's toolbox and about where the locksmith has been in the house.Olivia and Elliot find out that Mr. Todd is a 72 year old man that hasn't been to New York in twenty years and never met Jessica. They find out that the fake Mr. Todd is scamming Jessica for her money and didn't run away yet because he didn't had all the money he needed. They suspect that Mrs. Johansen is involved in the scam too. Elliot and Olivia tell everything to Jessica but she doesn't believe them, they ask her if he has access to her money and she tells them only when she dies.The police find a common telephone number in fake Mr. Todd's and Mrs. Johansen's phone records and go to the address, the neighbors recognize them from the pictures and say they are Mr. and Mrs. Brown. Captain Cragen gets a warrant and they search the apartment. They find a used boarding pass to Winnipeg under the couch cushions. They talk to the Canadian police and find out that fake Mr. Todd visited Canada a few times lately. Captain Cragen tells Elliot and Olivia to send the prints found in the apartment to the Canadian police to see what they can find out.Fin points out that they still don't know whose DNA it is in both victims, since it doesn't match Mr. Ryan's or fake Mr. Todd's. Olivia says maybe Mrs. Johansen user he husband's DNA, since he would never be a suspect, police would never take his DNA to compare with and the case would never be solved. They tell all to Mr. Johansen and ask for him to give a sample of his DNA for comparison. The lab results confirm is Mr. Johansen's DNA in both women.The Canadian police send the real identities of Mr. Todd and Mrs. Johansen and that they were both arrested and convicted for fraud. Olivia and Elliot try to convince Jessica that her husband planned it all to scam her and show her all the papers from the Canadian police but she isn't convinced. She says he confessed everything to her the night before and asked for forgiveness, and she forgave him. She says her husband's lawyer told her she could never testify about what he told her because she is his wife and conversation between spouses is privileged. Mr. Johansen too heard his wife confess to him and later got the call from her lawyer telling him he could not testify.The police do some research and find out that Ed and Denise got married in Mexico before getting married to Jessica and Mr. Johansen, so their marriage to them is void and they both can testify against Ed and Denise. Ed tries to charm Jessica, but she doesn't fall for that anymore."
    },
    {
      "episode_title": "Justice",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/justice-131030/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A girl is found rapped and almost beaten to death. She is rushed to the hospital, but dies a few minutes after going into surgery. Elliot finds the girl's jacket and a bottle of percosed belonging to Emily Porter. They track down Mrs. Porter and her daughter confesses she sold the pills to a dealer in the park.Fin busts the dealer and he tells Fin the dead girl bought the drugs and went to a motel nearby. The motel receptionist recognizes the girl, and says she met an older man at the reception, they argued and he dragged her into his room. Olivia and Elliot search the room, but the room hasn't been cleaned in a long time, so any fluids they find there are useless. They find a hat, and it's exclusively made for one store. The store says the hat was shoplifted, and even have the picture of the girl in their black book, but no name. The manager says they pressed charges and give them the police officer's name. Elliot and Olivia talk to the officer and discover she is that step daughter of a Judge.The Judge is an old friend of Captain Cragen and he decides to step in the investigation and notifies the family. Judge Walt Thornburg tells the Captain that Patricia was a troubled child ever since he married her mother, and she was sent to a boarding school for some time, but was back at home for almost a year now. Olivia and Elliot talk to the nuns at her school and they tell them she was rebellious, skipping school, cutting herself... Her only friend at the school tells them she had been pen-palling with convicts. ADA Cabot realizes all the convicts Patricia was corresponding with were sent to jail by judge Thornburg.Meanwhile Olivia and Elliot are notified that the judge has just been shot outside his house. They both go to the hospital and talk to his wife, she says she didn't see anyone, she just heard the shot. Olivia asks her if she ever heard her daughter mention the name Thomas Gordon, one of the convicts she was writing to.Fin and Elliot talk to Tomas's parole officer, his employer and co-workers. One of them says Thomas borrowed his van and didn't return it yet. Captain Cragen puts an APB on the van. Olivia finds the van and a gun inside it, and they take it to the lab to match it with the bullet from the judge. Elliot and Finn arrest Thomas and the lab matches his DNA to the one found in Patricia. The gun is also a match to the one in the judge.Thomas tells them Patricia was the one that started to write to him, promising sex when he got out of prison. They met in the motel the day she was murdered, he says she was supposed to give him percosed in exchange of a favor. She said she would have sex with him if he killed the judge. He claims she was alive and well when he left.Elliot and Olivia talk to Patricia's aunt and she tells them Patricia was never in boarding school, she was in a kid's correctional facility. Fin talks to the director and discovers Patricia was sent there when she was 12 to conceal a pregnancy. Olivia and Elliot confront her mother and she says Patricia never told who the father of the baby was, she says Patricia told her she didn't know who the father was.They investigate and find out that the judge's adopted son has the same birth date as Patricia's son. They suspect Patricia was sexually abused by the judge and the boy is his son. ADA Cabot gets a warrant to get the boy's DNA and run a paternity test. The test is done and it proves judge Thornburg molested Patricia and is the father of her son. Captain Cragen talks to the judge and he still denies he killed Patricia. Olivia and Elliot go to the lab and find a fingerprint in the bottle that killed Patricia, it is Mrs. Thornburg's. They confront her and she confesses she went after her when the school called, they had an argument about her pregnancy and Patricia finally told her who the father was, she says she just snapped and hit her with the bottle."
    },
    {
      "episode_title": "Guilt",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/guilt-131029/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A teenage boy, Sam, meets a man, Roy Barnett, in a train station. As they talk, the boy asks what to say to his mother- she suspects something happened between them. Meanwhile, the SVU team is listening to the conversation. But before the man can say anything incriminating, the boy warns him and tells him to run. Elliot, Fin and Olivia run after the man and Fin catches him running out of the station. Even though they don't have anything incriminating  caught on tape, they arrest the suspect.When Olivia and Elliot interview Roy Barnett, he claims that Sam is lying about being molested because he is a troubled kid. Olivia says it's funny how he seems to meet a lot of troubled kids [that lie about being molested by him]. He had two previous arrests with the same charges, and pled guilty to coercion and endangering the welfare of a child. He claims it is all a misunderstanding. Alex is frustrated they didn't get the incriminating tape, and is puzzled as to why Sam warned him instead of letting him incriminate himself. Dr. Huang explains that is common for most victims of long term abuse to care about their abusers;  they then have a hard time reporting them or testifying against them. He says that Alex should talk to Sam again and try to convince him to testify in court. She talks to him and asserts him that it's not his fault about warning Mr. Barnett. She tries to make him feel better about the whole thing, but he ends up thinking she implied he was gay and storms out.Alex, Dr. Huang, Elliot and Olivia try to reason with his mother, and have her convince Sam to testify. But she won't force him to do anything he doesn't want to. They only have a few hours to make the case against Barnett without Sam, but they have no other evidence. Alex gets a warrant for Barnett's apartment and the team searches it. They find a large amount of adult porn, but nothing of children, and nothing illegal.Munch and Fin talk to Barnett's parole officer and he tells them he doesn't believe he will ever stop. Barnett once admitted to him that he molested over a hundred boys. Alex's boss pressures her and tells her without Sam's testimony they don't have a case. At her urging, Alex talks to his mother and pleads for her not to let the man who ruined her son's life walk away free. Sam agrees to testify.Elliot waits with Sam at the court house and reassures him that he still gets nervous before testifying despite his experience. This helps to calm Sam before he testifies. Afterward, Sam is walking out of the courtroom with Alex and Elliot and they bump into Barnett. This makes Sam gets nervous. Suddenly a man comes charging against Barnett, knocking Alex on the floor. He is arrested for assault. He gives a statement to Olivia and Elliot and tells them he was molested for 5 years by Roy Barnett when he coached his team. Barnett stopped molesting him when he got older, starting on his younger friends. Olivia and Elliot ask for the names of other boys Barnett might have molested.Alex prepares Sam for the trial and asks if he knows about any other boys he might have molested. Sam remembers some good moments with Roy Barnett, before the abuse started. Alex explains it is what child molesters do, they make their victim like and trust them before starting the abuse. It saddens Sam to know Barnett never truly cared for him. Later that night, Alex gets word that Sam tried to kill himself. At the hospital his mother lashes out at Alex, blaming her for what happened to her son. Sam may never wake up, and may have severe brain damage if he does. Barnett's lawyer files a motion to dismiss, but the judge gives Alex three days to make a case against Roy Barnett.The team finds another victim of Roy Barnett and go to talk to him. But he is a convicted pedophile and doesn't make for a good witness. He does tell them Barnett used to send his victims videotapes of their sexual acts, and that they should search Sam's house. They talk to Mrs. Cavanaughm, but she refuses to let them search her house. Tempers flare and Alex argues with Captain Cragen and the detectives. She fears she has no choice but to let the case be dismissed.Later, Alex calls Elliot and Olivia to search the Cavanaughs' house. They find the videotapes hidden in Sam's closet. They arrest Barnett just as he is moving out of his apartment. As they are leaving the station to celebrate, Olivia and Elliot are scolded by Captain Cragen for making an illegal search. They claim they didn't know Alex didn't have a warrant. Even though the search was not permitted by Mrs. Cavanaugh, the judge does not suppress the video evidence. Barnett's lawyer brings it up, and he has no jurisdiction to do so- Mrs. Cavanaugh's rights were violated, not Barnett's.Roy Barnett is indicted on six counts:  sexual abuse in the second degree, sodomy in the second degree, use of a child in a sexual performance, promoting obscene sexual performance by a child, possessing obscene sexual performance by a child. Alex is suspended for her behavior."
    },
    {
      "episode_title": "Surveillance",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/surveillance-123757/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A woman is attacked after being dropped home by her boyfriend, her clothes were shredded and her hair cut short. Olivia rides with her to the hospital while Elliot stays in the crime scene. CSU find some hidden cameras in the woman's home. Munch and Fin go in search of the peeping tom.Olivia talks to Cassie, the cellist who was attacked, and tells her there's no sign of sexual assault, but this was definitely a sexual motivated attack. Elliot interviews the boyfriend, and he says that the Orchestra conductor is the one they should look at. He's been after her and even lended his apartment to her. He becomes a suspect of having planted the cameras.Elliot and Olivia talk to an ex-girlfriend of him, who was a violinist in the Orchestra before Cassie. She tells them she broke off the relationship because she discovered tapes of her and other girls before her in his closet.Fin and Munch trace the filming gear to a deceased man. ADA Cabot says they don't have enough probable cause to search Robert Prescott's apartment. The guys pressure her for a way to search his house, since he must've taped the attack, and she manages to get a warrant. They search the place and find a big collection of secret tapes of him and many different girls, even Cassie. Olivia and Elliot suspect Cassie is hiding something from them and confront her.She tells them she ended the affair after she caught him in bed with another girl, but he showed her the tapes of them and blackmailed her into staying in the Orchestra. She says he have been calling and leaving flowers to her ever since.Robert Prescott goes to the department with his lawyer to give a statement. Olivia and Elliot interview him, and while they are at it, another attack happens. Elliot rushes over and Munch and Fin show him a broken cello with a message that reads \"die bitch\".Mr. Prescott is cleared as a suspect and they start thinking it may be a disturbed fan. They trace the date of purchase of the filming gear and investigate who had access to Cassie's apartment during that time. The doorman of the building gives the police the name of a security technician that was in her apartment at that time. The manager of the security tech company tells Elliot that Ray Campbell, the man he's looking for is a model employee, and has been working for him a long time. But when he checks, he finds out that he was supposed to be in another location on the day he went to do maintenance in Cassie's apartment. Elliot goes talk to Ray and is informed that he had his uniform, tools and his employee number stolen, and the signature on the maintenance invoice for Cassie's apartment is not his.They find another address where Ray's signature was also forged to install a DSL connection, and figure it is where the stalker was sending the images from Cassie's apartment. They find the website where the images are being hosted and there is only one IP accessing it. Elliot, Olivia, Munch and Fin go to Terry Willard's apartment. He isn't home, but they find a shrine he made for Cassie, with pictures, flowers and things he took from her. His girlfriend tells them he works in a webdesing place, but when they check, they find out he was fired a few months back. His former boss explains he was distracted and missing days of work before being fired and turned violent when he was finally let go.Captain Cragen calls Cassie to the precinct, they show her a picture of Terry and tell her he's been stalking her since she was in college. She doesn't remember him from college or anywhere else. They ask Cassie's help to get him, she has to send a message to him in her next performance, so maybe he will try to talk to her and they can catch him. They set a face recognition program and stop a few suspects, but none of them turn out to be Terry. A crew member finds a box with flowers and a dead rat in Cassie's dressing room. The facial recognition finally gets the right guy and they arrest Terry. Elliot interviews him with captain Cragen, but he swears he wasn't the one who attacked her. A few hours later Terry's girlfriend, Amy bails him out. Meanwhile Captain Cragen announces Cassie's been shot. Eliot goes to track Terry down, while Olivia stays in the hospital waiting for Cassie to wake up. Munch and Fin go to talk to Amy, she says she didn't see Terry and takes off in a cab. Fin and Munch follow her to a hotel room. Olivia and Elliot go there and the four of them break the door down. She confesses to attacking Cassie both times, Elliot finds Terry dead in the bathroom."
    },
    {
      "episode_title": "Popular",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/popular-121561/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "Elliot and Kathy are discussing their daughter's troubles at school, when Kathy reveals that a friend of hers from work told her about a girl the same age as their daughter was rapped, but was scared to report it, and can't understand why, because she comes from a stable home and have good parents.Elliot asks a few questions to his wife about the girl and then starts investigating it, even though the girl didn't report it and Kathy and her friend could get in trouble for violating a 13 year old girl's privacy. He convinces Olivia to help him find who the girl is to try to convince her to report the rape. They find the name of the girl and convince the Captain to let them open an investigation and talk to the girl.Olivia and Elliot go to the school to talk with Cynthia Wilmont, the raped girl, but she is really scared that her parents would find out about it and refuses to say anything. They try to assure her that her parents wouldn't know but she doesn't believe them, since the nurse that examined her was the only one that knew and the nurse promised her nobody would know.A few hours later they are called to the hospital, Cynthia was admitted after being tossed through a flight of stairs. She claims she fell, but her injuries aren't consistent with a fall. Olivia and Elliot talk to her parents, but don't tell them yet about the rape. Olivia suspects that maybe Cynthia made the rape story up to cover sexual activity from her parents. They go talk to Cynthia's best friend to find out how much she knows about all this. Amy tells them that they have a \"club\", Cynthia's boyfriend and his friends supply the girls with beer in exchange of sexual favors, like oral sex. She tell them that they fooled around but never went \"all the way\". Olivia asks why they do that and Amy replies that is because the guys are popular and whoever they date is popular too.Fin and Munch go to talk to the boys and Tommy says that the last time they had a party he didn't have money for the beer so Cynthia offered to get the beer from someone else, an older guy. They find out that Ross McKenzie, a 24 year old substitute teacher was present in a few of these parties, including the last one.Elliot and Olivia go talk to Cynthia's parents about it and try to make her report the rape. She finally admits that Ross McKenzie raped her, and the detectives arrest him. The DNA is negative and Ross admits that he wanted to have sex with her, but she changed her mind at the last minute and he left her with her boyfriend. When confronted with the evidence, Cynthia tells the truth. Tommy told her to have sex with his best friend Nick who was a virgin because it was his birth day. She went with him to the bedroom but couldn't do it. Nick confesses to having consensual sex with her, and when he thought she was going to report him for rape, he beat her up."
    },
    {
      "episode_title": "Execution",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/execution-114141/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "Huang and Stabler are interviewing an inmate two hours before execution. The inmate taunts Elliot and Huang. He begins to describe how he killed a girl his 'first time'. Huang says the interview is over and presses an alarm. The inmate says \"relax chief, the guards are changing shift\". Huang yells at Elliot to get up from the table just before the inmate overturns it. He then seizes Huang and bangs his head against a wall, his hands around Huang's throat. Elliot attempts to pull the inmate off Huang. Huang slides down the wall, unconscious, while Elliot fights the inmate.Three days until execution: Allan and Hannah Cooper, whose daughter Debbie was murdered 11 years earlier, visit Stabler (who worked on the case previously) at the precinct and tell him they know who murdered their daughter. A death-row signature killer Matthew Brodus mentioned Our Lady of Light, Debbie's old school, in a television interview. Cragen, Stabler and Huang compare Brodus' previous murders and they match, despite the fact that Debbie was blinded by her killer, leading them to think Debbie knew him. Stabler reveals his ex-partner \"put a slug through his jaw\" over this case.Stabler and Munch go to Debbie's old school. The principal tells them they had a boiler system was replaced around the time of Debbie's death (Brodus was a plumber).  They go to the business that did the job but the boss says Matthew Brodus never worked there. Stabler and Huang interview one of Brodus' ex-cellmates, but leave when he wants a deal. Stabler and Huang argue about the best way to get information, Huang saying no deals. Alex talks to the ADA in New Jersey and tries to get the interview, but is denied. Despite what Huang thinks, Stabler asks Alex to offer a deal to the ex-cellmate.Two days until execution: The ex-cellmate asks Elliot to call his daughter or else he won't give Elliot any information about Brodus. He rings, but the woman on the other end of the line hangs up. Elliot goes to see Huang and admits that the cell-mate only told him things he'd read in the newspaper or seen on TV. Huang muses that one day Elliot will see that he knows what he is doing. Two detectives from Brooklyn SVU arrive and say that the call Elliot made was actually to a rape victim. Cragen reprimands him but smooths it over. Munch tries to find one of Debbie's teachers, Vivien Parrish, who dated Brodus.Elliot goes to see the other ex-cellmate, who doesn't want to speak because he is now religious. Elliot visits the father of boy who the cellmate killed in order to get answers. The cellmate tells Elliot what he knows about Brodus, saying he thought he was smarter than everyone. He revealed that Brodus blinded and killed a girl close to home. One day before execution, Cabot makes an appeal to get an interview; the New Jersey ADA allows it as long as they don't prosecute, no matter what Brodus reveals.Four hours before the execution, Huang is prepping Elliot for the interview, warning him about Brodus. In the interview, Elliot asks about Debbie's high school, but does not mention her name. He questions Brodus about Vivien Parris, and makes a comment about Brodus' mother and how she abandoned Brodus. He angers Brodus by saying Vivien Parish mentioned Brodus' 'shortcomings'. While Brodus rants about Vivien, he accidentally says 'Debbie' instead. He realises his mistake, but says to Elliot \"you're not as smart as you think you are.\"Cabot and the New Jersey ADA arrive at the prison. The alarm sounds because Brodus is attacking Elliot and Huang. The guards run in and pull Brodus off, but one of the guards hits him several times and knocks him out. The execution cannot go ahead because he is in a coma, and they can't execute and unhealthy man. Elliot says he will break the news to the rest of the victims' families, but at least they got a confession about Debbie. The ADA says \"They won't care. Would you?\" As Elliot leaves the prison through a large group of death penalty protesters, he spots Debbie's parents and goes over to give them closure."
    },
    {
      "episode_title": "Counterfeit",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/counterfeit-114140/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "A woman is found raped and murdered near her car in a lover's lane by two police officers. Olivia arrives at the scene all dressed up and angry for having to leave in the middle of her date. Fin is already there and gives her the info he has. They pop the trunk of her car and find boxes of a very expensive new cancer medicine called Rytex.The victim, Paula Grey worked in a pharmaceutical company, but they are not the one that makes the Rytex, so they have no idea what she was doing with the drugs and how she got them.  The police lab analyses the drugs in the trunk and turns out they were placeboes. The police suspects she was selling fake drugs to make their makers look bad and the drugs from her company sell better. Munch fids out that she was tipping the FBI about what her company was doing, and they suspect that maybe that's what got her killed. They bring her boss in for questioning, he was paying for her apartment and her car, and had all the motives to kill her.Meanwhile another victim fitting the same MO is found, still alive, so they go to interview her. She says it was a Cop who raped her, he pulled her over and made her get out of the car to take a breathalyzer and told her he wouldn't fine her if she had sex with him. When she refused, he raped her and kept her driver's license.Fin suspects she is lying to get out of a DUI and Olivia gets worked up by his suspicions. CSU tells them that the fibers under the victim's fingernails were the same as police uniforms. Olivia and Fin investigate which officers were around that area and find that two cops were over there and were unaccounted for at the time of both rapes. Fin still doesn't believe any cop could've done this.Cap. Craigen calls IAB and finds out they're investigating one of the cops, Marcosi, for a Year, for having sex with a prostitute in exchange of letting her of the hook. Olivia an Finn search Marcosi's locker and his police car, but the car was cleaned and the tires were changed. Marcosi is arrested.While Olivia and Finn are questioning Marcosi, another victim comes forward after seeing the case on the news. She was raped six weeks ago, but was afraid of reporting a cop. They investigate and find Marcosi had an alibi for this rape. Marcosi claims he's innocent and they can put him in a line up.Olivia and Finn go get Francesca, the second victim, for the line up but when they get to her house the neighbors say another police officer already took her, so Marcosi is of the hook. They come to the conclusion that it is a cop impersonator. They find a suspect and get a warrant to search his house, the search is frustrated and they only find some blood in his bed.ADA Cabbot, sends Olivia and Finn to arrest him in his work, but they decide to follow him around to find out where he hid Francesca. They follow him to a bar and talk about the rapes to try to make him nervous. He bites the bait and goes to where he hid Francesca, with Olivia and Finn right behind him. They arrest him and save Francesca's life. In the wall they find dozens of woman's drivers licenses."
    },
    {
      "episode_title": "Prodigy",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/prodigy-108239/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Protection",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/protection-108238/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Monogamy",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/monogamy-107563/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Ridicule",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/ridicule-102886/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "Andrew Green stops by his old apartment, where his estranged wife Sydney still lives since their recent separation. Soft music is playing and candlelight is glowing in the bedroom. Andrew peers through the door and sees Sydney dressed in a satin teddy, kneeling on the bed. When he enters the room, he finds she's been hanged from the ceiling fan.Warner is away at a conference, so Assistant Medical Examiner Justin comes to the scene. To him it's a textbook case of accidental death by autoerotic asphyxiation, though he still has to perform an autopsy. Andrew Green tells Olivia and Elliot that Sydney wasn't an autoerotic or anything of the sort. They had separated two weeks ago after a stormy six months of marriage. The visitor log at Sydney's building indicates that around lunchtime the day of her death, she had two other visitors: Pam Adler and Amelia Chase. Adler, a prominent criminal defense attorney, tells Olivia and Elliot that she and Chase had a lunch date with Sydney that day. When Sydney didn't show, they went to her apartment. Sydney was depressed about her marital problems, and told them she wanted to be alone.  Eventually Adler asks if the detectives suspect foul play. Elliot replies that until the cause of death is determined, the law requires them to treat the matter as a homicide. Adler scoffs, \"What you know about the law I could fit in the palm of my hand.\"Amelia Chase, a day trader, tells Munch and Fin that she and Sydney met at Goldman Sachs.  They became friends because there were few women in their business. Both of them enjoyed making money in the stock market, and upstaging men while they were at it. Chase paints Sydney as a big risk-taker and a sexual adventuress who was particularly into choking herself.A check into the Greens' finances reveals both Andrew and Sydney were broke. However, thanks to life insurance Andrew will inherit about $50,000 in cash.  Because of a premarital agreement, he would have received zero in a divorce.  Andrew admits that he and Sydney met not on a vacation as they'd told everyone, but in drug rehab for addiction to painkillers. They'd been fighting because Sydney had been using drugs again, and during her bachelorette party she and some friends raped a male stripper. The police had been called, because they were waiting on the doorstep when Andrew and Sydney returned from their honeymoon.  Olivia and Elliot catch up with the stripper, Peter Smith. He asks if they've gotten the names of the other women who raped him. When they tell him Sydney Green's dead, he denies killing her. His alibi for that day is confirmed.  Assistant ME Justin officially rules Sydney's death accidental. However, SVU still has an open rape case:  Peter Smith. Elliot doesn't believe Smith's story, but Olivia and Alex Cabot do.  Alex tells the detectives that in January, the law defining first-degree rape had been changed to include attacks by women on men. At Alex's order they interview Smith, who with great difficulty describes the attack by Sydney and two unidentified friends. When he threatened to call the police, one of the friends said,  \"What you know about the law wouldn't fit in the palm of my hand.\"Smith identifies Adler and Chase in line-ups. Adler readily meets with reporters and says Smith is \"a venal [susceptible to bribery]  young man who wants to be famous.\" Adler's defense attorney, Carolyn Maddox, asks the judge to dismiss the rape charge because the law is unconstitutional. The violation of rape occurs through penetration, and women aren't anatomically equipped to penetrate men. Therefore, women can't be equal to men under this law. The judge replies that the First Amendment doesn't provide for selective equality. Either women are equal to men, or they aren't. She refuses to dismiss the charges, and the trial is on.At the trial, Pam Adler steps forward when it's the defense's turn to cross-examine Peter Smith. The judge  shares the prosecution's outrage, but legally she can't block attorney Adler from conducting her own defense. Adler asks Smith: Did you file a civil lawsuit for $5 million against Sydney Green?  He is forced to answer yes. Adler presents a copy of the suit to the court, and asks that the rape charge be dismissed.The prosecution team scrambles for damage control. Smith hadn't mentioned the civil suit because it would have given non-believing Elliot a perfect reason to drop his case. Since the police wouldn't help him, Smith had sued Sydney to get the names of her two partners in crime. The tactic had worked: Sydney had called Smith's attorney the day before her death, to set up a meeting. Andrew Green didn't know about the suit, which was erased from the court's records after Sydney's death ended the matter. Therefore, Adler had to have obtained a copy while Sydney was still alive. But how did she know it even existed? Answer: Sydney told her and Amelia Chase about it, and that she was giving in to Smith's demand.  Olivia and Elliot revisit Sydney's death with Warner, who sees beyond the obvious and immediately recognizes it was no accident. Sydney hadn't had a towel or silk scarf, to keep the rope from chafing her  neck. Some chokers don't use a buffer, and wear turtlenecks or scarves to hide the rope mark.  The ropes were tied correctly, so a practicing autoerotic staged the bedroom scene.The three of them go to Sydney's apartment and re-enact the killing, during which Olivia stands on the bed to reach the ceiling fan. When she instinctively places her hands on the ceiling to steady herself, she and Elliot remember that CSU had checked only the area immediately around the fan for fingerprints.Amelia Chase constantly wears turtlenecks and scarves. The police find her fingerprints on Sydney's bedroom ceiling, and autoerotic paraphernalia in her apartment. Chase accepts a deal to testify against Adler, but Maddox cleverly turns Chase's testimony to Adler's advantage. The jury convicts Adler of only one charge out of four, third-degree assault. As Adler and Maddox exit the courtroom to the clamor of reporters, they're also greeted by Olivia and Elliot who immediately arrest Adler for the murder of Sydney Green."
    },
    {
      "episode_title": "Care",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/care-97620/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Inheritance",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/inheritance-94104/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Sacrifice",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/sacrifice-90118/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Redemption",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/redemption-85432/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Tangled",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/tangled-85429/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "While Max and Peyton Kleberg are out at dinner celebrating her birthday, friends arrive at their home to set up a surprise party. The friends are surprised to find the couple in the dining room. Max is dead, gagged and bound to a chair with duct tape. Peyton, who's been raped, is gagged and tied to a table.Warner determines that Max was pistol-whipped to death. She also finds animal hairs, from either a dog or a cat, in the adhesive from the duct tape used to bind him. A surgical scar on his chest indicates that Max had had heart surgery within the past year.At the hospital, Peyton tells Elliot and Olivia that they never left for the restaurant. Max had insisted on taking out the garbage first, and returned with a masked gunman. The gunman tossed Peyton a roll of duct tape and forced her to bind and gag Max. He then tied her to the table, and spent the next two hours alternately raping her and beating her husband until Max was dead. Elliot tells Peyton that a lockbox in the bedroom was broken into. Peyton says it had contained $10,000 to $15,000 in cash, and her grandmother's jewelry.The Klebergs' apartment doorman tells Munch and Fin that several months ago, a very agitated man came to see Max. The man said that Max, a physician, was \"a mad scientist [who] ruined his life.\" Max nervously told the doorman to call the police if the man didn't leave.Elliot and Olivia visit Dr. Carr, chief of urology at the hospital where Max practiced. While waiting to see Carr, they talk with his secretary, Lara Todd. She tells them about a disgruntled patient from one of Max's research trials on impotency, and offers to look up his file.Carr tells the detectives that Max had been better than new after his heart bypass surgery six months ago.Peyton had devotedly nursed her husband back to health. As a urologist, Max had specialized in sexual dysfunctions. At the time of his death, he had been testing a new impotency cream. However, Carr declines to comment on the patient Lara mentioned.  As Elliot and Olivia leave, Lara gives them a copy of the patient's file.Martin Welker had abruptly quit Max's research trial after Brooklyn SVU arrested him for attempted rape. Welker denies both killing Max and raping Peyton. He tells Munch and Fin that Max didn't tell him about the side effects of the impotency cream. At Welker's trial Max testified that Welker's own violent tendencies, not the cream, had caused the sexual assault. Welker had sued the hospital and the pharmaceutical company, but not Max because the doctor had no money to his name.Max's accountant tells Munch and Fin that because of Max's heart condition, no malpractice insurer would cover him. To continue practicing medicine, at the accountant's advice Max shielded his financial assets by moving everything into Peyton's name. Asked if anyone else could be after those assets, the accountant replies that Max recently had trouble with Jesse, his son from his first marriage. Max had cut off Jesse's trust fund after catching the young man in his apartment, trying to steal Peyton's jewelry.Jesse, who has a serious gambling problem, is brought in for questioning. He says he became a gambler because his mother and Peyton are both \"charity junkies\",  and the biggest fundraiser for any charity is casino night. He admits having tried to steal his stepmother's jewelry because he was in major debt to his bookie. Neither his father nor his stepfather would help him because they believed he was involved in drugs. However, he denies the rape and the murder.Jesse's mother, Marilyn Dunlap, arrives at SVU with a lawyer. Both she and Jesse resented Max, who deserted them after she put Max through medical school. Nevertheless, Dunlap insists that Jesse had nothing to do with the crimes. If anyone in this case is resentful, it's Peyton. After recovering from his bypass surgery, the revitalized Max \"had been nailing just about anything that moved.\" Peyton has known about her husband's chasing since at least the previous month, because Dunlap told her when they happened to meet at a fundraiser. Dunlap knows for a fact that one of Max's paramours had been Lara Todd.Lara admits to having had a fling with Max, but says it ended months ago. Elliot and Olivia tell her that DNA testing has cleared Martin Wexler. Asked whom Max pursued after her, Lara points them to Judy Trahill in the hospital's radiology department. Trahill says Peyton had \"cared too much\" about Max during his recovery. She did everything for him, which made him feel like an invalid. After Trahill, Max targeted another nurse at the hospital.  However, that time Peyton unexpectedly visited, caught him in the act, and slapped the nurse. Jesse Kleberg volunteers a DNA sample, and is cleared. Max's cell phone records indicate 1,000 minutes of calls during the last month, all to Lara Todd. Elliot and Olivia go to her apartment, where they find her gagged and tied to her bed. She's been raped and beaten.Lara says she lied about when her affair with Max ended, to keep it out of the news reports of his death. Peyton hadn't known about their affair till the very end. Three days before Max's murder, Peyton came to Lara's apartment and threatened to ruin both their lives if Lara didn't stop seeing Max. Cat hairs, most likely from a tabby, are found in Lara's bedroom. SVU now wonders if Peyton, the wronged wife, might have staged the crimes at her home to punish Max for his philandering. None of Peyton's missing jewelry has turned up at the pawnshops. Suspecting insurance fraud, Cragen has Cabot obtain Max's financial records for evidence to justify a search warrant for Peyton's apartment.A bank official, who knows Peyton socially as well as professionally, tells Munch and Fin that Peyton had taken some of her jewelry from her safe deposit box shortly before Max's murder. Bank records show that eight days before the murder, Peyton had also taken out $10,000 in cash. For a hit man, perhaps?A search of Peyton's apartment turns up the jewelry, inside a cigar box. Peyton says she can't explain how the jewelry got into the box. She admits that she took out the $10,000 in cash to pay a private investigator, which was how she found out about Lara. Munch and Fin catch up with the investigator, who has only pet dogs and doesn't eliminate husbands. He gives them copies of the photos he took of Max and Lara. The same man appears in the background of two of the photos, as if he were stalking Max. Lara identifies the man as her downstairs neighbor, Vincent. Elliot and Olivia visit him, and find that he has a tabby cat. He refuses to talk to them.Vincent has a criminal record for robbery and assault. Peyton and Lara's rape kits show that the same man attacked both women. Each person in this tangled web has connections to some, but not all three, of the others. The only thing connecting all four of them is the tabby cat hairs found at both Peyton's and Lara's rape scenes.  And Vincent has a tabby.While Munch and Fin search Vincent's apartment for the cat, Elliot and Olivia check in on Lara. She has fresh bruises on her face, but she refuses to tell them what happened. She does let Olivia take her to a women's shelter for her own safety.The lab confirms that the cat hairs from both rape scenes came from Vincent's pet. When Elliot and Olivia go to his apartment to arrest him, Lara is standing over his dead body and holding his gun. At SVU's office, she tells them she told Vincent two years ago that she wanted to be only friends. But he was so persistent and sweet, he finally wore her down. Afterward he became possessive and violent, in classic abusive relationship form. Meeting Max had given Lara the strength to finally say no to Vincent. Max had been about to leave Peyton, after which he and Lara were going to move in together. Then one night, Vincent told Lara that Max was dead. She was in his apartment because he had located her at the shelter and forced her to return with him . He tried to rape her again, and she managed to reach his gun and shoot him.Since Vincent killed Lara's lover, a jury could interpret Lara's killing of Vincent as an act of  revenge. The lab confirms that Vincent's gun was used to kill Max, and that Vincent raped both Peyton and Lara. Huang argues that Lara is a classic domestic abuse victim. Cabot is unwilling to close the case without pressing charges, absent clear evidence that Lara had acted in self-defense. Munch and Fin return to Vincent's apartment to search for evidence supporting \"a case against Vincent that would put him away for life if he weren't already dead.\"Later in her office, Cabot has Lara sign her police statement. Cabot then plays a videotape, in which Lara offers Vincent $15,000 to kill Peyton Kleberg. The only relationship between Lara and Vincent had been in Vincent's own unstable mind. Still, Lara made use of Vincent's obsession with her to hire him to kill Peyton. Realizing that Max and Lara wanted to be together, Vincent killed Max instead. However, eliminating Peyton had been Max's idea in the first place. Lara says, \"Where do you think I got the $15,000? And who do you think hid the jewelry?\"A stunned Peyton says that while Max had changed after his heart attack, their marriage had finally been returning to normal. He had stopped seeing Lara after Peyton found out about the affair. Surely that was why Lara had Max killed, when he didn't leave his wife for her after all. Olivia regretfully tells Peyton that Max had planned the whole thing.  Peyton says, \"That doesn't make any sense. Why would Max set up his own death?\" Elliot quietly replies, \"He wasn't supposed to die. You were.\""
    },
    {
      "episode_title": "Rooftop",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/rooftop-83016/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Stolen",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/stolen-80325/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Wrath",
      "nth_episode": 22,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/wrath-78050/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": "As the episode opens, two forensics doctors are in their experimental site (a federal facility referred to as a \"body farm\") studying the effects of decomposition on bodies. As they check, one of the doctors stumbles over three dead bodies tied together who aren't part of the experiment. SVU is called and Detective Stabler arrives on the scene. Upon questioning, Stabler finds out that the bodies were dragged to the area. IDs include an adult Hispanic female who had been a rape victim and whose case was previously handled by SVU. Detective Benson had been the primary investigator on the case. The white male was the father of a rape victim and had also been one of Detective Benson's cases. The minor's identity has yet to be determined.Back at the station house, Benson asked Stabler why she wasn't called since she had been the primary on all three cases. Arriving in the squad room, Benson relays to the squad the identifications of all three victims. Victim #1 was Peter Cordell, the father of a woman who had been raped and murdered. Benson handled his case, including driving him back and forth to court each day, and even held his hand when his daughter's killer, Victor Klaussen, was acquitted due a lab mix-up which contaminated the evidence. Victim #2 was Carmella Barrantes who had been raped and beaten three years ago by a gang banger currently serving 8  10 years in prison. Stabler offers that this clears the man as the murderer in this case, but Fin and Cragen consider the possibility of gang revenge although noting that there's no evidence of a gang-related link with the other two victims. Benson continues with victim #3 who was Clayton Derricks. The young boy had been physically abused by his father, Bruce Derricks. Clayton was removed from his home and placed in a group home where he was again sodomized by an older boy, then he was placed in foster care and Benson confesses how long it took for him to begin to trust her. Munch adds that the boy's foster mother had filed a missing person's report the previous day. He also adds that cause of death for all three victims was a combination of sedatives and potassium chloride which made for painless deaths. Cragen orders the squad to interview the families and find a common connection other than Benson.Benson and Stabler go to Adam Cordell's home and ask the young man if his father might have known Carmella Barrantes or Clayton Derricks. Adam says he never mentioned those names. He says Victor Klaussen killed his sister and probably killed his Dad. He said that Klaussen was laying carpet in Queens. He added Klaussen was married with a baby on the way. Benson asked Cordell if he had been stalking Klaussen. He replied that he hadn't, but his father used to follow him and tell everyone around him what kind of person Klaussen was and that probably got Peter Cordell killed. Benson and Stabler decide to pay a visit to Klaussen. They ask him to account for his movements, but he is not willing to comply. When he begins making backhanded remarks, Stabler throws him against his van and tells him they ought to arrest him for making threatening remarks. Klaussen says that two nights ago he was at home, and last night he and his wife were at Lamaze class.Mrs. Harding's Foster Home is the stop for Fin and Munch. Mrs. Harding said Clayton was pretty stable considering his circumstances, but he would occasionally run away. We he did run away, he went to see his friend Michael Washington at the group home in the Bronx. At the group home, the director said that Clayton and Michael bonded over their similar circumstances of abusive fathers. He also said that the psychologists thought it was better to move Clayton for his own well-being, and Mrs. Harding had called the home after Clayton went missing to see if he was there, but neither they nor Michael had seen Clayton in some time. When Fin and Munch talk to Michael directly, he admits that he did see Clayton the day before. Michael said that Clayton had received a letter that he had won a computer, but needed cab fare. Michael gave Clayton all he had - $22.00. Michael watched Clayton get in the cab from Starling Car Service to go and pick it up.At the Barrantes residence, Carmella's mother said that her daughter never went out after dark, but she was getting her life together and going back to school. She tells that her daughter was excited because she had received a letter saying she had won a computer in a raffle.Back at the squad room, Stabler says it didn't seem that any of the victims knew one another. Benson adds that, so far, they hadn't been able to track down Clayton's father. Fin says that they checked back and Peter Cordell had received a letter saying he had won a new computer just like Clayton had. Benson adds that Mrs. Barrantes said Carmella had received the same letter. Munch hangs up the phone and says that he talked to the cab company and got the address in Chelsea where the boy was dropped off. Benson says they're going to need a warrant.Detectives Benson, Stabler, Munch, and Fin go to the address, and the building owner meets them there. He says he never met the guy; the whole rental agreement was done by phone. He paid the owner six months rent in advance, and the owner left the key above the door since there was nothing to steal. \"AivilO Productions\" was in the business of designing promotional literature. A search of the office turns up several computer letters like the ones the victims received. Stabler notes the two glasses where he must have offered his victims a drink laced with valium or some other sedative. Benson closes the door and reveals the reverse of \"AivilO\" on the window portion of the door. From the backside it reads \"OliviA\".Back in the squad room, Huang briefs the detectives on the killer's profile. The three victims, being of different races, genders, and ages, indicate the perp was after revenge and the real target was Detective Benson. She has enraged the perp so much that he wants her twisting. The fact that the victims were placed in a federal facility indicates that he wanted attention for them. The perp used potassium chloride (as in a death row cocktail)  and posed the dead victims indicating he wanted them not to be any pain. Cragen puts Munch and Fin on the detail of checking Benson's old case files and seeing who might hold a grudge. Benson and Stabler are sent to follow the money trail. At the bank, they find out that the account was opened four months ago. Only photocopies are available of the checks so no fingerprints are available. The detectives ask the bank to not physically handle any checks that come through on that account so that prints can be checked. As they exit the bank, Benson is disgruntled that the FBI will be handling the prints. Stabler says they're just better equipped and quicker. Benson gets a phone call that Clayton's father, Bruce Derricks, has been arrested on a drunk and disorderly charge. At the jail, they interview the man to see if he has had any recent contact with his son or anyone asking about him. He turned on the detectives, saying it was their fault he was taken and raped in the group home. He gives no further information. After the detectives leave, Stabler expresses concern for Benson's safety. Benson replies that if he had wanted to take her out, he would have already done so. The detectives continue to interview parolees that may have had a grudge against Benson, but they continue to come up with no solid leads. Benson and Stabler next travel to the flower shop of Eric Plummer's ex-wife. As it turns out, the innocent Eric Plummer spent 7 years in prison for attempted murder and rape. DNA evidence not available at the time cleared him. Ms. Plummer says she doesn't know where her ex-husband is and wouldn't tell the detectives if she did. As they leave, Stabler invites Benson over for dinner. Benson declines.As Benson sleeps, the buzzer to her apartment is rung. She answers, but no one replies. Then it rings again without stopping. Benson grabs her gun, goes down stairs, and finds the buzzer has been purposely jammed. In front of the building, in a box marked \"From AivilO Productions\", is the dead body of Clayton's father, Bruce Derricks. Unlike the other victims, Bruce Derricks had suffered in death. FBI agents question whether Benson has seen or heard anything. Then he tells Benson that Derricks was alive until she went to talk to him. He concludes that Benson needs police protection because she is being stalked. Benson says she doesn't work for him and asks who bailed Derricks out from jail. The agent says that according to police forms, it was her. Benson and Stabler go to the Lonnie's Bail Bonds office and ask to see the paperwork on Bruce Derricks. Lonnie said the guy by the name of Oliver Benson paid cash, so he didn't take an ID. Uncooperative as he is, Benson and Stabler start moving people out of the office. Lonnie then gives a vague description of what he remembers about the guy.Cragen is strong-armed by the FBI to put Benson on desk duty, but he doesn't relent. He comes out to ask the squad if there are any leads. Stabler comes up with a lead  a 45 minute call from Plummer to a Baseline Labs in Midtown. Fin adds if Plummer works for the lab, he'd have access to potassium chloride. Munch says the autopsy report on Derrick reveals that he suffered. He was awake and aware, but paralyzed when he was suffocated. Benson says that the killer saw Derricks as a perp and killed him like one. Cragen orders Benson and Stabler to the lab to check out employees. Cragen tells Benson he's worried about her safety. Benson says \"no protective detail. She says this perp doesn't want her dead; he wants her twisting and obsessing about what's going on.At Baseline Labs, the director says he doesn't have an Eric Plummer working for him. When they show him Plummer's mug shot, he says that it looks like Norman Webber. He works for their insurance sector collecting blood and urine samples from clients for physicals. Benson asks to see his personnel file. The man is flustered and offers that their company has a rigorous screening process. If this man is a criminal, they could be in big trouble for hiring him in the first place. Stabler says the man is not an ex-con, but needs to call them as soon as possible.Back at the station, Benson steps into Huang's office. Benson says that the perp hates her and is killing the people she tried to help. Huang shares that one time while working an FBI case, he misinterpreted the amount of time it would take for a perp to try to kill him before the guards could get there. Benson understands  the perp got in his head just like this one is in hers. Huang says this perp is enacting psychological warfare. The fact that he had posed the bodies in a comforting position and used potassium chloride so that they would suffer painless deaths indicates that the perp, in his own mind, is freeing them from the miserable existence he must feel that Benson left them in. Somehow he identifies with the victims and sees himself as a victim, too.Back in the main squad room Plummer arrives with his attorney. Novak tells the two that this is simply an ongoing investigation, and when they clear him, Mr. Plummer can put this behind him. The attorney says he must insist on Benson's absence from the meeting. Benson says that's not a problem, she was leaving anyway. Munch tells Benson that they're heading to Chauncey's (bar). Plummer's attorney says that his client has already been wrongly convicted and spent seven years falsely imprisoned. Stabler says those seven years must have given him plenty of time to plan his revenge. Novak tells Plummer he wasn't personally sent there by Benson. He had been convicted by a jury in a fair trial. Plummer turns to Novak and asks if she's ever been to prison  arrested, cuffed, fingerprinted, beaten, raped, and tortured. If not, then don't dismiss his feelings. Stabler asks Plummer why he changed his name to Norman. Plummer says he wanted a fresh start.  Stabler then asks what drugs he had access to including potassium chloride. Plummer says he doesn't even know what that is. The attorney presents Plummer's work records for the last two evenings and says that he doesn't have an alibi for his evenings because he lives alone, but this time circumstantial evidence won't cut it. The two leave. Novak says he's right. If they want to get a conviction for this, they're going to have to prove he had the syringe in his hand. Stabler says he thinks Plummer is the guy. Cragen agrees. He tells Stabler to follow up on Plummer's seven years in prison. He had to have made a friend there.At the bar, Munch tries to convince Benson it wasn't her fault that Plummer went down. A witness picked him out of a lineup. Fin adds that the guy couldn't provide an alibi. Benson asks him to remember where he was at a specific time a couple of weeks ago and his inability to do so proves her point that sometimes it's hard to remember your exact whereabouts for a given time. Benson says that it was her evidence that helped put him away on such a weak case, and even one wrongfully imprisoned man is too many. She goes on to point out that Plummer was a victim. Munch says if he's the right guy, he's a predator, not a victim.  Benson calls it a night and leaves the bar. As she walks down the street, she is aware of a man following her. She pulls her gun and turns on him. The man says he's FBI. While Benson has him pinned and looking for ID, she spots Plummer walking down the opposite side of the street observing her. She turns to go after Plummer when a second FBI man stops her. She asks who they are and why they are following her. They admit that they are protective detail requested by Detective Stabler. Benson goes straight to Stabler's house and tells him that \"only the rat squad puts cops on other cops without telling them\" and she deserves better than that. She ends the conversation with the statement, \"When you can't trust your partner, Elliot, it's time to get a new one.\"The next day, Benson is in Novak's office. Benson tells Novak that warrants have been issued in the past for less, why not now? Novak replies that once a judge knows of Plummer's wrongful conviction, that judge is going to bend over backwards for him. Benson says she saw Plummer and knows he is stalking her. Novak asks how Plummer could have known where she was. Benson says he must have overheard them in the squad room. Novak counters by asking how many businesses were in the area because any decent defense attorney will say he was just running errands. Benson argues that he has killed four people and they aren't doing anything about it. Novak looks at Benson and asks how many drinks she had that night. Benson is clearly irritated with this question. Novak continues that since the system made a mistake before, everything they do is under a microscope. Benson stares at Novak and says, \"I wasn't drunk.\" She storms out of Novak's office and goes to Cragen's office asking for permission to take the vacation time she has coming because she knows she's too close to the case. Cragen offers that no one is questioning her ability. Benson says, \"I am.\" In the central squad room, Cragen asks Stabler, Fin, and Munch if they've followed up on information about Plummer in prison. Munch says Plummer corresponded with his wife almost daily, even after their divorce. Stabler asks who his cell-mate was. Fin says it was a murderer by the name of Russell Williams who was parolled in 2000, but is currently at Riker's awaiting trial in another murder case. Cragen says Williams is going to want to cut a deal but if the prosecution has a good case, they're not going to want to cut him any slack. Novak goes to the ADA in charge of Williams' case. The ADA says no deal. Novak asks if they want her to show the rotting corpse of a ten year-old boy. The ADA argues that this time they could put him away for good. Novak asks them to go for twelve and a half to twenty-five if they can get information to put Plummer away. He agrees.At Riker's, Williams says that Plummer had it in for some female cop. The two ADAs say they need proof. Williams says he handed over several letters to his old lady from Plummer to give to Plummer's wife. Williams further adds that if he spilled his guts to his cell-mate, imagine what must be in the letters to Plummer's wife.  The detectives carry out the warrant they have for Plummer's apartment. Fin finds a loose tile and pries it up to find a box containing vials of potassium chloride. Stabler says it's time to pick up Plummer. He heads to the lab to ask if Plummer is working that day. The irritated boss says that this is harassment. He knows of the story where Norman (Plummer) was wrongfully convicted. He tells Stabler that his partner has already been in threatening obstruction and he gave her the address just so she'd leave. Stabler asks what the address is. Benson enters an apartment building, and almost immediately hears shots fired within the first apartment. She calls for backup. A woman opens the door. Plummer is out of the doorframe, but has a gun pointed at her head. Crying, the woman says that he knew she was coming. She says that Plummer is going to kill her. Benson says it won't. The woman says that Plummer wants her to tell Benson that they were suffering and he only helped alleviate the misery Benson had put them in. The woman says Plummer wants her to come in. When Benson says she can't, Plummer pulls the crying woman into another room. Benson yells that she's coming in. With gun drawn, she enters the room where Plummer has the gun drawn on the woman. Benson says to let the woman go because this is between the two of them. Plummer asks Benson how it feels to have your credibility shot and your life in ruins. Benson replies, \"It sucks.\" Plummer says he was innocent. Benson agrees, but adds that now he has killed four innocent people. Plummer says it was three innocent people and one child molester. Benson offers to testify on his behalf in court that she was responsible. Plummer says there's not going to be a trial. Benson keeps her gun pointed on Plummer and tells him not to think she won't shoot him. Plummer says he's counting on it. He pushes the woman down and the gun harder against her head. Benson tells him to drop his weapon. Plummer says there are no bullets in his gun and then makes to shoot his victim, but Benson fires at Plummer, killing him instantly. The entry squad and detectives arrive on the scene immediately after. While Stabler takes the gun from Benson's hand, the first entry cop checks Plummer's gun and reveals that it wasn't loaded. The grief-stricken Benson is speechless. Stabler offers to drive her home, but Benson says she has to give her statement. Stabler says he'll take her, but Benson tells him to stay away from her.Back in Benson's apartment, she is sitting in the dark as the rain falls outside the windows. As tears roll down her cheeks, she ignores both the knocking at the door and the ringing phone. In the hallway, Stabler looks at the door, closes his cell phone, and walks away."
    },
    {
      "episode_title": "Repression",
      "nth_episode": 23,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/repression-73306/recap",
      "nth_season": 3,
      "source": "http://www.tv.com",
      "corpus": ""
    }
  ]
}