{
  "episode_recaps": [
    {
      "episode_title": "Goliath",
      "nth_episode": 1,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/goliath-418600/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Parts",
      "nth_episode": 2,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/parts-418599/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Blood",
      "nth_episode": 3,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/blood-418598/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Night",
      "nth_episode": 4,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/night-418597/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Intoxicated",
      "nth_episode": 5,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/intoxicated-409679/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": "The show begins when Carrie's mother, Denise, walks in the bedroom to find her daughter and her 21 year old boyfriend naked in bed. The mother calls the police, and claims rape. Carrie, who is fifteen, and Justin are brought into custody for questioning. When at SVU, Carrie repeatedly claims that she and Justin did not have sex, and that she was definitely not raped. Denise states repeatedly that Carrie had been raped, and that she needed to get a rape kit. Finally, Denise convinces Benson to take Carrie to get a rape kit. However,  Benson calls a lawyer (Simone Bryce)  on the way. When Denise finds out from Bryce that her daughter can't be forced to take a rape kit, she becomes violent and loud, dragging Carrie home.The next day, Denise is found dead in her apartment, and Carrie and Justin are missing. After SVU questions the doorman of Carrie's apartment, they find that Justin left dragging a screaming girl out of the door,covered in blood. They begin searching for the two lovers. The trail leads them to a cabin in upstate New York, where Justin and Carrie are hiding. Justin is arrested for the murder of Carrie's mother.Neither lover is talking, and during interrogation, they begin yelling through the walls at each other, saying \"I love you\" to each other. When it's clear to the detectives that no answers will be uncovered by interrogation, they decide on new tactics. They first check with Carrie's school, and find that Carrie went to but left early saying she felt sick. When checking with Justin's work, they find that Carrie and Justin had a conversation on webcam, showing Carrie covered in blood, frantic, and begging Justin to take off work and come to her apartment. She said that there had been an accident. The tape is shown to Justin, but he refuses to betray Carrie.  Benson tries to break apart the lovers by telling Carrie that Justin had betrayed her and offered information, to save himself from life in prison. At first Carrie refuses to believe it, but after prodding from Benson, she begins to cry, and starts to speak. Despite Simone Bryce's advice to stop talking, Carrie starts blurting out that she hadn't meant to kill her mother, that she just lost control.Benson walks Carrie out of the interrogation rooms, right by Justin. Carrie asks him why he broke their promise by talking. He looks confused, and says that the police had their conversation on webcam, but that he hadn't told. Carrie then lunges at Benson,  screaming, \"YOU LYING BITCH,\" over and over.Benson asks Huang if  Carrie has a mental illness that might mitigate her sentence. After interviewing Carrie, Huang diagnoses her with  Premenstrual Dysphoric Disorder, PMDD. He says that Carrie was on her period, and that she didn't remember any of her attack on her mother (two common symptoms of PMDD). Still, Benson is convinced there is something else to the story; she found Denise suspicious from the beginning. Upon arriving at Carrie's apartment, Benson begins looking through the cabinets and refrigerator. She finds many bottles of vodka and rum. When Elliot arrives, Benson says, \"She didn't care about her daughter, she was only concerned about where her next drink was coming from!\" (Benson's mother was also an alchoholic.)  Stabler also makes a stunning discovery. He finds birth control pills, showing that Carrie was on the eighth day of her period, not her sixth. This rules out Huang's diagnosis. When Benson confronts Carrie with this information, she tells her she wants to help. Carrie looks at Bryce, and decides that she has nothing to lose by telling Benson her story. \"When I came home from school, my mom was there. She was really stressed about Justin, and she was drunk off vodka. She told me that she hated me and Justin, and that she would do anything to break us apart. She also said that she would make Justin lose his job, so he wouldn't love me anymore.\" Carrie starts to cry.   The argument escalated, and Denise slapped Carrie repeatedly. Carrie then got so angry at her mother, that she hit her with a lamp- \"over, and over, and over.\" Benson listened to the confession, then got up silently to leave. At court the next day, Carrie was given a shortened sentence, to be served in juvenile detention. Benson and Novak went for a drink.  \"She [Denise] was just like my mother, a drunk. She didn't care about her daughter,\" Benson said.\"Olivia, you didn't kill your mother.\" \"No... but I know what it's like to want to.\"\"When I was a senior in high school, I started dating one of my mom's college students. She found out, and when I got home from school that day, she confronted me about it. She was very drunk, and I was young and immature. She made me so mad that I told her I was moving out with him. She told me that she would fail my boyfriend....\" Casey asked why Carrie (or by implication, Benson)didn't just tell someone. \"Because then the abuse becomes real. If you keep quiet, you can pretend it's not...\" As we close, Benson has tears in her eyes."
    },
    {
      "episode_title": "Pure",
      "nth_episode": 6,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/pure-398476/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Rage",
      "nth_episode": 7,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/rage-384623/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Ghost",
      "nth_episode": 8,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/ghost-381745/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": "It's just another Monday at Brevet Investments until the bloodied body of Elena Brevet is found in the supply room. She was raped, beaten and repeatedly stabbed; and her throat was cut. The medical examiner estimates she died at least 48 hours before, which is consistent with her being last seen alive on Friday night.  Elena owns Brevet Investments with her husband, Jason. He had flown to Miami on Friday night for business, and was due back Sunday. When Elliot and Olivia go to the Brevet house, they find Jason bound to a living room armchair, dead about 12 hours from a slashed throat.A monogrammed keyring on the table indicates Jason's killer took Elena's keys to get into the house. Upstairs is an empty built-in safe. It's a totally pick-proof model, meaning the killer got the combination by torturing it out of Jason. A new tool called a gas chromatograph indicates the safe had contained at least $1 million in cash.The Brevets had been heavily in debt, and their company turns out to be just a high-end pyramid scheme. Their real business was laundering Colombian drug money, particularly for a bogus client called Casa Vega Enterprises. The Brevets skimmed the cash in the safe, and the dealer found out and killed them.SVU consults Narcotics detective Miguel Sandoval, who recognizes the laundering scheme. A Colombian drug dealer in Bogota is in the money in New York, but he can't move all that cash out of the US without attracting attention. So dealer hires black market money broker, who finds Colombian nationals with checking accounts in the US. These good people write clean checks in exchange for the drug cash, keeping a bit for their trouble. The dealer can deposit these checks anywhere, such as into the Casa Vega account at Brevet Investments. Then the money can be legitimately wired to Colombia.One of the Casa Vega check writers is a woman whose son Miguel sent to prison for selling marijuana out of the family business. Miguel, Elliot and Olivia pay her a visit and offer to transfer her son to a facility closer to home, if she helps them. She points them to a man named Felix Montoya.At Montoya's apartment the detectives find Felix and his wife dead in the living room, shot execution-style only a short time before. In a bedroom is their young son Antonio, who's also been shot through a pillow covering his face. However, the shooter missed and only grazed the boy's skull. In the hospital, Antonio says a ghost shot him and his parents. Outraged that any drug dealer would shoot a child in the head, Miguel insists on participating in the investigation.Ballistics tests reveal something unexpected: the weapon used to shoot the Montoyas was also used to shoot former SVU prosecutor Alexandra Cabot two years ago. A Colombian drug dealer targeted Alex when she persisted in prosecuting one of his men for raping and murdering an undercover NYPD officer. (Season 5's \"Loss\". Officially Alex is dead, but only Elliot and Olivia know she's actually alive and hiding in witness protection.)The DEA runs the entire cast of Casa Vega characters through its HIDTA computer, which searches for links between cases. However, no one connects back to the drug cartel. When Miguel then comments \"This guy really is a ghost\",  the HIDTA technician recognizes their killer as El Fantasma (\"the ghost\" in Spanish), aka Liam Connors. Connors is a former IRA hit man who became unemployed after the cease-fire in Northern Ireland. Now he and others like him are in Colombia working for the cartels.Through a parking ticket on a rental car, Connors is eventually tracked down and arrested. The grand jury indicts Connors for the Brevet and Montoya murders, but not within the legal deadline for either indicting him, or releasing him until his trial. To keep Connors in custody, Casey orders Elliot and Olivia to arrest him for Alex Cabot's murder. The detectives hadn't expected that, and now they're in a major jam. Since Alex is alive, they've just charged Connors with a crime he didn't commit.Captain Cragen gets a visit from Jack Hammond, the DEA agent in charge of the undercover drug operation from two years ago. Hammond raises holy hell over Connors' arrest for Alex's murder, then realizes Cragen didn't know Alex is alive. Cragen is furious with Elliot and Olivia, who've now jeopardized everything they've worked for and every case they've worked on. Casey isn't happy either, because she's on the hot seat with the judge for charging Connors with a crime he didn't commit.Cragen and Hammond visit Alex at her home in Wisconsin, and show her a picture of Liam Connors. The person she's lived in fear of for two years, finally has a face and a name. Hammond apologizes that they can't prosecute Connors for Alex's shooting, but at least they've got him for the other four murders and the attempt on Antonio Montoya. But Alex wants Connors to pay for what he did to her, too. And the other cases depend entirely on young Antonio's testimony. As a prosecutor, Alex encouraged countless victims to stand up and face their attackers. Now it's her turn to do the same.Alex returns to New York to testify, even though it means revealing she's alive and becoming a target again. With Alex's presence, Casey manages to keep Connors in custody, and to save Elliot and Olivia's professional necks. At the trial, on cross-examination Connors' attorney asks Alex only one question:  Did you see Liam Connors shoot you? The answer is no, but Alex is able to goad Connors into blurting out in court, \"You think you're safe? They know where you are! You should have stayed dead!\"The jury convicts Connors on all counts of murder and attempted murder. Cragen, the detectives and Casey gather in Casey's office for a victory party. When they hear someone else coming, they think it's Alex and quiet down to surprise her. The door opens and Hammond comes in, alone. He apologetically tells them that Alex and Antonio Montoya are being moved to new identities, and she had asked him to say goodbye for her."
    },
    {
      "episode_title": "Hooked",
      "nth_episode": 9,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/hooked-378844/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Game",
      "nth_episode": 10,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/game-378843/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Quarry",
      "nth_episode": 11,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/quarry-378837/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Identity",
      "nth_episode": 12,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/identity-372642/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Contagious",
      "nth_episode": 13,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/contagious-369987/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Haunted",
      "nth_episode": 14,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/haunted-367462/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Weak",
      "nth_episode": 15,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/weak-365280/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": "As the episode opens, three different women are attacked in a short period of time. The first two, a wheel-chair bound woman and a woman with a baby, were raped. Both of these women, Coleen and Samantha, lived in the same building. The third woman, Gina, was attacked about a block away, but was able to fight off her attacker with the crutches she was using since her knee surgery. All three say the perp tried to stay behind them and that he smelled of cigarettes. Gina was able to give a bit more description – white male, medium height, sunglasses, and a hooded sweatshirt. The sketch looked amazingly like the \"Unabomber\". Stabler makes the connection that the perpetrator seems to attack women with a weakness – a woman in a wheelchair, a woman with a baby, and a woman on crutches. As the detectives follow up on possible witnesses, Fin gets a possible hit with a man seen leaving the scene of the last crime and getting into a blue, Ford Taurus. Stabler and Benson retrace Colleen's path the previous day, and at the nail salon, find out that a man came in with a hooded sweatshirt and glasses. He smelled like an ashtray and his nails were filthy.While the detectives are discussing the case at the station, Benson suggests they get Huang to start working up a psychological profile, but Fin mentions that he can't because he's in Washington. Next, a woman enters the station house babbling nonsensically and carrying a copy of the sketch on which she has made strange notations. When Benson asks her if she was attacked, she does manage to tell her that is why she is there. As the detectives reach out to lead her to an area, she becomes physically violent, at one point punching Fin in the jaw. The detectives quickly realize the woman is suffering from some kind of mental illness and go with her to Bellevue Psych for an examination. At Bellevue, Benson sees Dr. Rebecca Hendrix, a cop turned psychiatrist, who informs the detectives that the woman is Miranda Cole who suffers from schizophrenia. Miranda does mention again that she was attacked. However, she also keeps saying she was being stalked by terrorists who tried to place listening devices inside of her. A rape examination proves too difficult to do while Miranda is so frantic, much to Benson's dismay. Hendrix won't budge as she realizes that Miranda is doubly troubled by her schizophrenia and post traumatic stress disorder. Hendrix believes that Miranda is telling the truth about being attacked and adds that schizophrenics rarely false report sexual assaults. Again, it appears that the perp has attacked another \"weak\" woman.When the next victim is attacked, the evidence reveals the same M.O. and the attack occurs in the same neighborhood as the previous ones. This victim, Laurie, was killed in the process, and the detectives realize the perpetrator's behavior is escalating and becoming more violent. The detectives realize their best possible witness is Miranda Cole in the psych ward, and they go back to convince Hendrix to get the examination done. Benson reveals a certain animosity against Hendrix saying that she became a psychiatrist because she thought she was too good to be a cop. When the detectives arrive at the hospital, Hendrix has the rape kit waiting on them. Stabler likes Hendrix because he thinks they've finally found a doctor who \"gets it\". When Hendrix agrees to sit in and help in the interview with Miranda (temporarily lucid due to medications), Stabler readily agrees. Hendrix warns them that schizophrenics suffering from post-traumatic stress often relive the experience as they talk, and the sounds, details, and sensations come back to them not in flashbacks, but in very real episodes. After the three enter, Miranda tells them bits of her story – enough to convince the detectives of the similarities between Miranda's attack and the other attacks. When Benson shows her the sketch, Miranda again withdraws into her illness. The rape kit reveals that Miranda did indeed have a recent sexual encounter, and DNA evidence is available this time. DNA profiles tag another psych patient, Raymond, as the man with whom Miranda had sex with. Hendrix says he's not a rapist. His DNA is only in the system because he's continually filing false reports against his neighbor for trying to kill his cat. Hendrix explains that it is possible that Ray Ray and Miranda had sex, but that he is not the rapist they are looking for. Miranda could have encountered the real perp at some time before. The detectives and Dr. Hendrix return to Bellevue to again question Miranda. They're told by the nurse that she checked herself out. The ward is only required to keep a patient for 24 hours if they're lucid and taking their meds, so Miranda was able to sign herself out.The team decides their most pressing need is to track down Miranda. Hendrix mentions she has a sister, and the detectives and doctor go to see her. Her sister is distraught when she learns her schizophrenic sister was telling the truth about a man hurting her and trying to kill her. The sister tells them of an apartment her Mom left them. It so happens that the apartment is located very near the other crime scenes. When the detectives go to the apartment, they find a hysterical Miranda, now clearly off her meds. She begins reliving the experience. She mentions the kitchen, and the detectives go and see that Miranda has preserved the crime scene with her pants and underwear still on the floor. She describes the man exactly as the sketch. A blood smear is found on the cabinets. Then Miranda repeats the words of her attacker revealing his name is Thomas. The detectives run a list of all blue, Ford Tauruses in the area, and then narrow it down to owners named Thomas. There is a single hit – Thomas Mathers. Fin also notes that the blood in Miranda's apartment matched the blood on Gina's crutch.Stabler, Fin, and Warner go to Mathers' apartment to question him and convince him to offer a DNA swab. They are surprised to find out their suspect is homosexual. They question Mathers' whereabouts of three nights ago. The roommate says he was home in bed. Finally, Mathers agrees to a mouth swab for DNA. When they arrive back at the station, Benson reveals new information discovered on Mathers. A series of peeping incidents that took place at Mathers' college when he was a student mysteriously stopped during Mathers' three leaves of absence and after he graduated. After graduation, Mathers moved to Cleveland where the PD reported a string of unsolved breaking and entering complaints – all women – nothing was taken. Stabler said Mathers had an alibi – his boyfriend had said he was home in bed all night. Benson says either the boyfriend is a liar or a heavy sleeper. Mathers' cell phone records reveal that, on the night of the attacks, Thomas' cell phone received a call from his mother in Queens at 10pm. Then at midnight, there was an outgoing call to his mom, but the signal was transmitted by a tower in Queens. He would have had plenty of time to get back before the attack on Colleen at 2am.Munch and Fin head to Thomas' mother's house on a little-information seeking hunt. When they arrive, one of the first things they notice is the heavy cigarette smoke that permeates the air due to Mrs. Mathers' chain smoking. Under the pretense of asking about a hit-and-run accident, Mrs. Mathers' volunteers that Thomas was indeed there after midnight trying to help fix the furnace, and arguing that he couldn't stay. After about 20 minutes, Thomas left saying he had things to do, so the furnace didn't get fixed. Munch tells her he'll be happy to give the furnace a check. Thomas arrives and wants to know what's going on. After a brief period, Munch comes back upstairs to reveal the furnace is shot. He tells Fin to look at how filthy his nails are; Fin tells him he's going to need a manicure and turns to Thomas to ask if he knows where he can get one. Detectives Fin and Munch tell him he's under arrest and take him into custody.To Benson's dismay, Stabler asks Hendrix to sit in on the interrogation. Stabler also wants to know why a homosexual man would rape. Hendrix replies that it's probably for the same reason a heterosexual man does. It's all about the position of power. Thomas enters the room, and denies that he raped anyone. In response to the detectives questioning, he says his roommate passed out from drinking and didn't know he left. He also vehemently denies that he is gay and even acts disgusted by the notion. He tells them he's just going through a \"thing\". The detectives notice a cut on his throat is bleeding. Thomas claims it came from shaving. As the detectives meet outside to debrief on the interrogation, Cragen comes in to say that he's the wrong guy; the DNA didn't match the blood evidence. Hendrix and Stabler still think they've got the right guy. Everything fits – the car, the cigarette smoke, the dirty fingernails, and Hendrix's profile. Benson is livid that Stabler is siding with the shrink when the DNA cleared Thomas. Hendrix knows when she is in the way, and leaves the room. After the showdown between Benson and Stabler, Hendrix pulls Stabler aside and says that she is bothered by the fact that Mathers says he cut himself shaving, but the stubble he had made him look as if he hadn't shaved in days. \"Why didn't the blood clot?\" she wonders. They go to the lab and find out the blood sample reveals a low platelet count which could keep it from clotting properly. Hendrix tells Stabler of the time during her internship when she needed some information on a patient who was unconcious and all she had to go by was his college ring. Hendrix called up the school and was able to get his medical records and save his life. She says she can't do it now because she would lose her license. Stabler smiles and says, \"But Dr. Elliot can.\"Benson, meanwhile, goes back to talk to Miranda once again. Through questioning, Benson realizes that Miranda first saw her attacker in the library. She asks Miranda, who still believes it was a terrorist stalking her, to take her there and show her exactly where she was when she saw him following her. Miranda leads her to a stack of books and warns Benson that they are recording her, too. Benson turns and sees the security camera and gets the tape of Thomas confronting Miranda in the library, and this time he wasn't wearing his disguise. Benson asks Miranda to promise to take her medication, and that it will make the terrorists go away.Benson gets back to the station with the tape and Stabler and Hendrix are waiting on her. They tell her that they find out the problem was with Mathers' blood. Thomas had leukemia and in college received a marrow transplant. From that point on, Thomas's blood produced a different DNA from the rest of his body. That's why the samples didn't match. They only had taken a cheek swab rather than a blood sample for the match. They know the method they used to collect the information is not enough to get a warrant to retest Mathers' blood, but Benson offers the tape and says, \"This is.\"In the courtroom, Mathers' bond is denied and he is held in custody. Hendrix enters the courtroom to tell Benson that Miranda killed herself that morning. A teary-eyed Benson asks if this is some kind of \"I told you so\". Hendrix said it had nothing to do with her, but the disease and the voices in her head. She tells Benson, \"You can't save everyone. I'm sorry.\""
    },
    {
      "episode_title": "Doubt",
      "nth_episode": 16,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/doubt-364954/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Charisma",
      "nth_episode": 17,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/charisma-338481/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": "As the episode opens, Benson is questioning Melanie, a 12 year-old girl who is pregnant and has been left alone at the hospital. Benson is finally able to get the girl to write down her home address so she can contact her mother. Benson also asks the girl who is the father of her child. She replies that the father is Abraham, her husband. Benson goes to the address with a patrol car backup. When she knocks, the door is opened by a group of children. Benson asks if there is anyone home with them, and a man comes to the door asking if he can help her. Clearly visible is a snake tattoo on his arm. Benson asks the man if his name is Abraham. When he responds vaguely, she asks him to step outside after which he closes the door on her. A few moments later a number of shots are fired at the officers and Benson calls for backup. Fin, Munch, Stabler and the backup units arrive. Fin reports that the neighbors say there's mostly a lot of women and children living there. The only report on the address has been a noise citation. As they are talking, numerous shots are heard inside of the apartment. The entry team breaks into the apartment to discover all the children have been shot. The perp is gone from the building. The detectives enter to discover clear signs of a cult. Commandments are painted on the walls as is a huge portrait of Abraham. Candles and bibles as well as blood-stained teddy bears are strewn about the darkened home. The detectives are emotionally floored by the destruction of young lives. Benson is particularly troubled, because she had seen those same children only moments before.The group is gathered back at the station house where Cragen briefs them all. He says that signs point to a cult group. Other members may have escaped through a secret tunnel in the house. Priorities include finding these escaped members and identifying all the bodies. All of the detectives are ordered to go through a psych evaluation before they can continue on the case. Huang interviews a stoic and emotionally unattached Stabler. Munch tries to keep his cynical nature in check, but Huang breaks through to help Munch recognize that, cynical though he may be, he can still be repulsed by the nature of such a horrid crime. A tearful Benson is grieving for the children and worries that she cannot hold it together. Huang says she is handling it, by acknowledging how much it is affecting her. Fin is clearly shaken and knows he's seen too much. As the detectives are back at work in the department, Stabler shares that collected items from inside the house, such as mail and paycheck stubs, reveals a number of women's names, but the social security numbers and names are fraudulent matches. Munch is convinced one of the women at least will come forward to identify her child in the morgue. Benson returns with a positive ID on Abraham based on fingerprint dusting inside the house. His real name is Eugene Hoff and he's in the system for four instances in the 80's involving identity theft, check forgery, counterfeiting, and various frauds. Fin comes in to say he's taking himself off the case. He knows he needs time to recuperate emotionally from the devastation he's witnessed. Munch walks him out. Stabler says Abraham's last place of employment was a Pentacostal church. An agitated Benson says she believes they're going to take her off the case because she was too emotional. However, within minutes, Cragen temporarily releases Stabler from duty and refers him to psych services after Huang's evaluation. Cragen partners Benson with Munch for this investigation. Benson and Munch head to Abraham's former church. The pastor says that Eugene (Abraham) was very popular, and the more popular he became, the more radical he became. He was preaching that the serpent was Christ. Benson realizes that explains his tattoo. The pastor continues by telling the detectives that ten families left the church when Eugene was fired. He gives them the names of one of the families that left the church and later left Eugene's group. As the detectives arrive at the home, the couple tells Benson and Munch about Abraham's increasing paranoia – hoarding food and weapons, taking the members to the firing range, separating the men and the women. They also said he seemed to pay most of his attention to the girls and women, and one night they found them in the room of their daughter, trying to seduce her. They realize his maniacal ways now, but back then, they say, he was mesmerizing. They offer a tape of Abraham preaching.Back at the station house, Huang says Abraham's behavior, including sexual relations with the members, is not that unusual in cults. As they are talking, a woman calls to ask if one of the boys killed was a nine-year-old boy with brown hair and a scar on his leg. While Cragen talks to her, Huang traces the call. She refuses to give her name, but she was on long enough to have the call traced to the same hospital where Melanie is. Benson immediately goes to the hospital pressing Melanie to give her information so she can protect her mother. The girl gives up the address where the women are hiding out and hoards of weapons are found. None of the women will talk when the detectives try to interview them. Benson returns to the hospital to try to get a positive ID from Melanie while Munch heads to the morgue to get Warner's report. Warner relays the information that all of the children have the same father except the shooter. Munch is angry and calls Abraham an incestuous pedophile who kills all his victims so they can't testify against him. Warner reminds Munch that there is still one victim alive – Melanie. When Benson arrives to talk to Melanie, she is told that her father checked her out a short time ago. In the station house, a voice match is made between one of the women and the phone call asking about the young boy. Cragen tells Benson that several numbers were found in this woman's (Sarah's) pocket, but she won't reveal what they mean. Benson compares Sarah to Sarah from the bible who was married to Abraham. The biblical Sarah allowed Abraham to have sex with her daughter so that he could have another child. Benson becomes angrier as the woman continues says that Abraham protects them and she doesn't expect Benson to understand. Benson counters that she is just as responsible for the deaths of the children and the rape of her daughter because she sat back and did nothing. Back in the SVU room, Munch comes in with news that forensic accounting came up with the meaning of the numbers – all ten digit numbers with the first four digits the same – bank accounts. They had all been closed out the day before to the tune of $600,000. Most of the money came from fraudulent checks from large corporations because they take longer to realize the fraud. Cragen asks if it was coincidence that Abraham does all his bogus banking in one place. Benson realizes that he must have had an inside guy. Benson and Munch find out the processor and go to the bank to confront him. When he (Reg) realizes how much trouble he's in, he offers information that there is one more account with more money than all the others together. A plan is devised whereas Reg will slip a GPS tracker in with the money when Abraham comes in to cash it out. The detectives and Cragen devise a plan to stake out the bank and arrest Abraham when he tries to cash out. Abraham becomes suspicious at the way Reg is acting. He turns to leave and Cragen and Munch draw their weapons. Benson hears the commotion on her radio and leaves her post in the outside squad car to come in and assist. As Abraham draws a knife to his throat, Benson runs and tackles him from behind and he is cuffed and arrested.In the interrogation room, Abraham gives up nothing of value to Benson. When she exits, Cragen tells her (and Novak) that it's okay. As soon as DNA results are back, they'll charge him with statutory rape. Just then, Abraham's lawyer arrives and overhears the conversation. He says that Abraham had no reason to suspect the girl was his daughter and no court will allow an estimation of age on the deceased victims, so there is really no proof that Abraham did anything wrong. He enters the interrogation room to talk with his client. Back in the hallway, Novak says he's right. They can hold Abraham for 24 hours on check fraud, but unless they can produce Melanie to testify against him, they don't really have a case. Munch walks up to the group with information that the bank account that Abraham had tried to close that day had over a million dollars. It had come from a trust fund of John Kramer from Englewood, New Jersey. This time the name and social are real, but Kramer was reported missing ten years ago along with his wife and daughter. The daughter was about two at the time. Her name was Melanie. Kramer's parents had reported them missing, but they are now deceased. They decide to talk to the former investigating officer.The officer remembers the case and produces a photo of the Kramers from the file. The wife's real name was Cindy. He doesn't recognize the photo of Abraham, but does say he always thought it was some kind of cult involvement. His parents had noted that Kramer had become really secretive and donated his trust fund to the religious group. The only contact the parents had after their son left was a letter from the group demanding the money from their granddaughter's trust fund worth about two million. It can only be accessed when the girl turns 21 or has a baby – whichever comes first. Benson realizes that's Abraham's motive for keeping Melanie alive – at least until she delivers. The officer tells them that Kramer's last known activity was charging a lot of building supplies on his credit cards. Munch remembers that the neighbors had said something about middle of the night construction. Benson counters with the fact that they searched that place top to bottom. Munch says, \"We didn't check the walls.\"Back at the cult complex, an x-ray of a wall reveals John Kramer's body inside. Positive ID is made from the credit cards in the wallet still in his jacket pocket. Benson confronts Sarah again with the wallet, the photos of John, and the wedding ring he was wearing when he died. Sarah breaks and gives out the location of a warehouse Abraham owns up north where he and Melanie are hiding out. Benson and a group of officers go to the scene and find Melanie on bed in an office area of the warehouse. Abraham enters with groceries and as the officer tries to arrest and cuff Abraham, Melanie pulls out a gun and shoots him in the leg. Benson convinces Melanie to let the officer go get some medical help. Both Abraham and Benson try to convince Melanie they are telling the truth while Melanie keeps her gun pointed on Benson and Benson keeps her gun on Abraham. Finally, Abraham is screaming at Melanie that they had to send so many people to arrest him because he is greater than man and greater than God. Melanie shoots him and breaks down. Benson grabs the gun and hugs the crying child. Melanie says that he was a liar. He said he was greater than God, but no one is."
    },
    {
      "episode_title": "Conscience",
      "nth_episode": 18,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/conscience-358047/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Outcry",
      "nth_episode": 19,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/outcry-332593/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Scavenger",
      "nth_episode": 20,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/scavenger-335695/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Obscene",
      "nth_episode": 21,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/obscene-338480/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Debt",
      "nth_episode": 22,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/debt-327970/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": ""
    },
    {
      "episode_title": "Birthright",
      "nth_episode": 23,
      "corpus_url": "http://www.tv.com/shows/law-order-special-victims-unit/birthright-326376/recap",
      "nth_season": 6,
      "source": "http://www.tv.com",
      "corpus": "A day at the park turns traumatic for six-year-old Patty Branson when someone tries to kidnap her. She escapes, and the would-be kidnapper flees with only a handful of her hair. Elliot and Olivia are called to the scene. Told that the perp was on a bicycle, Elliot wonders how he had expected to carry off Patty.Olivia talks with Patty, who describes the perp as a \"big boy\" (that is, not a man or a young boy). Patty had encountered him once before, outside the neighborhood supermarket where her parents shop.  Somebody knows Patty's movements, and seems to be specifically interested in her.The supermarket manager tells Fin and Munch that the previous week, a man and a teenage boy were in a dark blue van parked near the store, obstructing the delivery entrance. He noted the van's Arizona license plate number. A check on that number reveals that the van was also seen recently near Patty's school.Elliot and Olivia talk to the school security officer who reported the van, which had been parked in the teachers' zone. As they leave the school, they see the van parked nearby and call for backup. Shortly before dismissal, a boy emerges from the van and mingles with the parents waiting for their children. Cragen and Fin confront the van's driver, and arrest him after he unsuccessfully tries to pass himself off as a cop. Elliot, Olivia and Munch arrest the boy.The man is Peter Carson. The boy is Kenneth Pratt, who is actually 23 years old but looks younger. Both men are private investigators, licensed in New York and Arizona. Carson is known for rescuing kidnapped children and returning them to their custodial parents. Patty picks Pratt out of a line-up.Initially both Carson and Pratt refuse to discuss their ongoing investigation, which they insist is based on  accurate information. Cragen tells Pratt that New York state is ready to revoke Pratt's PI license, which will lead to Arizona's doing the same. Faced with possibly losing his livelihood, Pratt reveals that he and Carson were hired to return Patty to her real mother. Carson insists that Patty is his client's daughter, who vanished four years ago.Elliot and Olivia visit Carson's client, Manhattan resident Michele Osborne. She readily invites them into her home and shows them photos of her daughter, Anna. One is of Anna at age two, when she disappeared. The other is an age-progressed photo showing what Anna would look like today. The second photo looks startlingly like Patty Branson. Michele tells the detectives that Anna disappeared from a rest stop when Anna and Michele's husband, Steve, were driving to his parents' home in New Jersey. Steve Osborne is dead, killed in a car crash. Michele is sure that Patty is Anna, and happily shows them Anna's bedroom all ready and waiting for a six-year-old.Elliot and Olivia arrest Michele for conspiracy to commit kidnapping. The arraignment judge grants Casey's request for an order of protection forbidding Michele to come within 100 feet of Patty, her parents, their home, or Patty's school. Huang is intrigued by the fact that Michele had updated Anna's bedroom for her daughter's return. Most missing children's bedrooms are kept the way they were when the children disappeared.A background check reveals that Michele is clean. Birth records indicate that Anna and Patty were born two weeks apart in different cities, so they weren't switched at birth. However, Huang can't find Anna in the Missing Children's Center database. An FBI database reveals why: Anna is dead.SVU is informed of a disturbance at the Bransons' house. Michele has violated the order of protection, repeatedly ringing the Bransons' doorbell and saying she \"has proof.\" Olivia tells Michele that they know the truth: Anna was killed in the same car crash as Steve Osborne. Michele argues that the police never found Anna's remains. Olivia replies that the car had been hit by a gasoline tanker; there had been nothing left to find. Michele vehemently insists that Anna is alive.During Olivia's exchange with Michele, Elliot finds Peter Carson in a parked car around the corner. Carson has the lab report of a DNA test on Patty's hair. The report indicates that Patty is Michele's daughter.The Bransons insist that Sarah carried and gave birth to Patty. Warner tests a lock of Anna's hair provided by Michele. Anna and Patty are different children, but their mitochondrial DNA (from the mother) is identical. Their birth records indicate that both girls were conceived through in vitro fertilization. The only explanation for the current situation is that the fertility doctor implanted Michele Osborne's embryo into Sarah Branson.Michele and Sarah had gone to the same doctor, Dr. Stanley Norton. Michele tearfully apologizes for her behavior, and Sarah asks that the order of protection be lifted. However, Casey insists on taking Michele to trial for violating the order. Given that Norton created this mess, Olivia asks Casey to cut Michele a deal. Casey tells Olivia to talk to Norton. If he verifies Michele's and the Bransons' stories, she'll consider it.Norton denies that his clinic could have made such a glaring error. The only way this incident could have occurred is if Michele had agreed to donate her unused embryos. He provides a copy of Michele's signed consent form, which contains checkboxes for multiple items. The box agreeing to donate unused embryos is marked. Michele verifies her signature, but firmly denies marking that particular box. Norton's office had specifically asked her and Steve about donating embryos, and they had declined because they didn't want someone else giving birth to their child. Michele hadn't had any extra embryos; Norton had placed all her fertilized eggs back into her.SVU obtains the original consent form, and the lab determines that the disputed mark is a forgery. Casey obtains subpoenas and warrants for all of Norton's patient records and clinic logs. Sarah Branson's records note that none of her eggs had fertilized. Instead of telling the Bransons the truth, Norton had simply given Sarah one of Michele's embryos.Patty disappears during a school trip to a local museum. Shown a picture of Michele, the teacher remembers seeing her near the museum entrance as the children left. Michele's house is empty, but family photos show that she has a beach house in Queens. Elliot and Olivia go there and arrest Michele for kidnapping. Patty is physically unharmed, but emotionally very upset: Michele told her that she's her real mommy.Michele refuses to accept a plea bargain, or to give up the fight for Patty. Casey realizes that while the law and the evidence is on the Bransons' side, the jury's feelings aren't. She seeks advice from devoted father-of-four Elliot. If Michele is convicted she'll go to prison, which she doesn't deserve. If Michele is acquitted, she'll keep fighting the Bransons for Patty in a battle that will never end. Elliot recounts the biblical story of King Solomon, who had to decide which of two women claiming the same child was really the mother. Solomon called for a sword, then ordered that the child be divided in two and half given to each woman. Casey says that unlike Solomon, she can't split the baby. Elliot replies that Solomon didn't have to.At the trial, Patty Branson takes the witness stand. She testifies that Michele told her she was Patty's \"egg mommy.\" Although Sarah Branson gave birth to Patty, the egg Patty came from was from Michele. Eventually Casey asks, \"You know what Michele said about being your egg mommy is true, right?\" Patty begins to cry and wails, \"No. It's not true! Michele's not my mommy! I don't want to go with Michele! Please don't take me away!\" She asks to leave the witness stand, but Casey says she can't until they're finished. Patty becomes more and more hysterical until Michele can stand any more, and cries, \"Stop it! Just stop it!\" Michele then apologizes to Patty and says she'll never bother her again. Patty runs off the witness stand to the Bransons, crying \"Mommy! Mommy!\"Michele pleads guilty to custodial interference, and is given a suspended sentence. She decides to move out of state, because it's too painful to be near Patty and not see her. Olivia finishes auditing Norton's fertility clinic records. Michele had in fact had extra embryos, ten of which had been implanted in other women. In addition to Patty, somewhere out there Michele has two other daughters and a son."
    }
  ]
}